[
  {
    "url": "https://therealdeal.com/texas/houston/2025/03/20/nord-groups-houston-multifamily-loan-to-special-servicing/",
    "title": "Nord Group’s multifamily loan heads to special servicing",
    "subhead": "Firm’s principals said they were “inexperienced and unfamiliar” with multifamily CRE in unrelated bankruptcy filing",
    "authors": "ByJess Hardin",
    "pub_date": "Mar 20, 2025, 4:00 PM",
    "pub_date_dt": "2025-03-20T16:00:00",
    "content": "A distressed multifamily investor that once self-identified as “inexperienced and unfamiliar” with multifamily commercial real estate is in trouble with another Houston asset.\nA $38 million loan backed by La Solera Apartments, owned by New York-based Nord Group, was sent to special servicing in February, Morningstar Credit reported.\nCashflow at La Solera in 2023 was down 36 percent from when the loan was issued in 2022, Morningstar said. The property’s occupancy dipped from 94 percent at the end of 2022 to 88 percent last June.\nNord Group bought the garden-style multifamily property, at 10300 Wilcrest Drive, in 2021. It was built in 1979 and is located in the southwest Houston suburb of Alief, about 16 miles from downtown. The property’s taxable value was set at $32.4 million million last year, appraisal district records show.\nNord Group was founded in 2018 and said it got swept up in the multifamily bubble of the pandemic that burst when interest rates surged and valuations plunged.\n\nTwo principals at Nord Group, Khaled Noor and Baruch Teitelbaum, were majority interest holders in three ownership LLCs that filed for Chapter 11 bankruptcy protection late last year, Bisnow\nreported\nin December.\nThe LLCs owned three Houston apartment complexes totaling 618 units: The Avenue, a 215-unit property at 5050 Yale Street; Toro Place, a 320-unit property at 12101 Fondren Road; and Miramar Townhomes, a 48-unit property at 2380 Bering Drive.\nThe debtors blamed their Houston-based management company Better World Properties for botching renovations.\nThey also said in the filing that they were “inexperienced and unfamiliar” with multifamily commercial real estate.\nHouston’s multifamily market has absorbed a glut of deliveries in the last three years, driving occupancy and rental rates down. The numbers were stabilizing heading into this year — with occupancy at 88.6 at the end of last year, up slightly from its position at the end of 2023, 88.5 percent —  but some inexperienced operators like Nord Group have struggled to survive the cycle.\n",
    "related_links": [
      "https://www.bisnow.com/houston/news/multifamily/3-houston-apartment-complexes-seek-bankruptcy-protection-127128",
      "https://therealdeal.com/texas/2024/07/17/lynd-declaration-partners-invest-in-distressed-multifamily-loans/",
      "https://therealdeal.com/texas/houston/2024/09/27/260-million-in-houston-commercial-real-estate-loans-headed-to-auction/",
      "https://therealdeal.com/texas/austin/2023/05/16/nitya-sells-multifamily-holdings-for-100m/"
    ],
    "market": "Texas",
    "published": "Thu, 20 Mar 2025 20:00:00 +0000",
    "published_dt": "2025-03-20T20:00:00+00:00",
    "author": "Jess Hardin"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/20/ny-issues-rfp-for-1024-fulton-street/",
    "title": "Hochul wants housing on long-derelict Brooklyn site",
    "subhead": "State launched RFP for 1024 Fulton Street",
    "authors": "ByKathryn Brenzel",
    "pub_date": "Mar 20, 2025, 3:48 PM",
    "pub_date_dt": "2025-03-20T15:48:00",
    "content": "A long-neglected state-owned site in Brooklyn that has sat in redevelopment limbo for decades is once again up for grabs.\nGov. Kathy Hochul issued a request for proposals on Thursday for 1024 Fulton Street, seeking a developer to take over the 12,800-square-foot Clinton Hill site. The request comes with conditions: The new owner must build apartments where all rents are at or below 100 percent of the area median income, and the new building must include at least 100 units. The RFP also calls for a community center on the building’s ground floor.\nWhoever is selected to take over the site will pay a nominal fee. The state may still opt to create a ground lease on the site rather than handing over full ownership of the property.\nPlans to redevelop the site have been snarled up in attempts to transfer the property to a nonprofit.\nIn 2014, the Cuomo administration halted plans to auction the site at the urging of then-Assembly member Walter Mosley, who wanted to sell the property to the nonprofit Northeast Brooklyn Housing Development Corp.,\nthe New York Daily News reported at the time\n. When that plan fell apart, the state legislature\napproved a bill\nin 2020 to sell the property to Philadelphia-based TCH Holdings for “fair market value.”\nThat proposal also didn’t come to fruition because TCH didn’t file the required paperwork outlining its plan for a senior center on the site,\nThe City reported\n.\n\nThe latest RFP requires that the development team be 51 percent owned by a nonprofit, and it gives a slight edge to those wholly owned by a nonprofit (five points out of a maximum of 100 a bidder can earn based on criteria outlined by the state).\nThe state budget for fiscal year 2024-2025 allocated $3.7 million to demolish the 33,000-square-foot vacant building on the site. The building served as a showroom for Brooklyn Union Gas in 1912 and then for manufacturing and commercial uses.\nThe state’s Office of Children and Family Services bought the property in 1997, hoping to develop a community center. However, “due to structural issues,” the agency abandoned that plan, according to the RFP. The building has since sat vacant.\nThe site’s current zoning allows residential space that is four times the size of the lot (or a floor area ratio of 4), with a maximum building height of 85 feet. If a building includes affordable housing, the FAR can go up to 5 and the height to 115 feet. The RFP notes that the state is willing to override local zoning to maximize the amount of affordable housing, and will consider additional density, height and other modifications if they “support a superior design and site plan while being cost-effective.”\nThe RFP for the Fulton Street site is the latest effort by the Hochul administration to build on state-owned land. The\nstate budget last year\ncreated a capital fund to build more than 15,000 homes on state-owned properties.\n",
    "related_links": [
      "https://www.nydailynews.com/2014/12/09/state-backs-off-building-auction-after-brooklyn-pol-asks-that-it-be-sold-to-a-charity/",
      "https://nyassembly.gov/leg/?default_fld=&leg_video=&bn=A08555&term=2019&Summary=Y&Actions=Y&Text=Y",
      "https://www.thecity.nyc/2024/05/15/derelict-clinton-hill-building-a-monument-to-hochul-officials-failed-intervention/",
      "https://therealdeal.com/new-york/tristate/2024/05/06/gov-hochul-issues-first-housing-rfp-since-budget-deal/",
      "https://therealdeal.com/new-york/2024/12/19/hochul-taps-bxp-brp-companies-for-site-k/",
      "https://therealdeal.com/new-york/2023/07/19/state-issues-request-for-apartments-not-offices-at-hudson-yards-site/",
      "https://therealdeal.com/new-york/2025/01/14/gov-kathy-hochul-unveils-housing-agenda-in-state-of-the-state/"
    ],
    "market": "New York",
    "published": "Thu, 20 Mar 2025 19:48:51 +0000",
    "published_dt": "2025-03-20T19:48:51+00:00",
    "author": "Kathryn Brenzel"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/20/chicago-apartment-listing-tests-south-side-neighborhoods-hype/",
    "title": "Bronzeville apartment listing tests neighborhood hype",
    "subhead": "Midsize complex asking $225K per unit near planned lakefront megadevelopment",
    "authors": "ByEmma Whalen",
    "pub_date": "Mar 20, 2025, 3:30 PM",
    "pub_date_dt": "2025-03-20T15:30:00",
    "content": "A South Side landlord is testing how buzzy Bronzeville has become by listing two apartment buildings for $225,000 per unit.\nRaphael Lowenstiein, who previously landed in financial hot water from racking up code violations on other South Side properties, is putting two apartment buildings at 4201 and 4750 South Michigan Avenue up for sale together or separately. If the combined 45 units sold at the target price of $10.1 million, the sale would be on par with recent multifamily sales in more established real estate markets in Chicago. The properties do not have outstanding code violations.\nAssets snagging between $200,000 and $300,000 in the past year include a 17-unit complex sold in Avondale, which sold for $235,000 per unit last May; a 47-unit complex in river West that\nsold for $302,000 per unit\nthe following month; and in the West Loop,\na 274-unit tower that sold for $278,000 per unit\nin October.\nBronzeville had been experiencing a dramatic decline in population until recently, much like other areas of the South Side.\nThe neighborhood was a hub for Black population growth during the Great Migration in the early to mid-1900s, but years of disinvestment led its population to decline by more than 75 percent between 1950 and 2000, according to United Way of Metro Chicago.\nGrowth in nearby Hyde Park and the expected 2026 completion of t\nhe Obama presidential library\nin Woodlawn has spurred an influx of interest recently, along with Farpoint Development’s planned\n$3.2 billion megadevelopmen\nt known as Bronzeville Lakefront.\nOn the residential side, a single family home in\nWoodlawn set a record this month\n, selling for $1.2 million, which was $400,000 more than any previous home sold in the neighborhood.\n“From the 7100 block up to Douglas, it’s all improved significantly,” said SVN’s Joe Connelly, who is listing agent for Lowenstein’s South Michigan Avenue properties. “In Woodlawn, I was working on a deal for $200,000 a door. That would have been absolutely unheard of even four years ago.”\n\nA sale at or above $200,000 per unit is not a guarantee, even with the area’s growth. A two-building Hyde Park portfolio at 5111 South University Avenue and 5135 South Blackstone Avenue totaling 77 studio and one-bedroom units sold this month for $103,000 per unit.\nBut the South Michigan Avenue properties also benefit from their proximity to Bronzeville Lakefront and from larger-than-typical floorplans because they were converted from condos and renovated, Connelly said.\n“Local investors think the price per door is a little steep for Bronzeville, but it reflects the rents that they’re achieving,” Connelly said.\nAverage rents are close to $2,000 per unit, and the average average unit size is about 1,315 square feet, Connelly said. Some duplex units have 2,400-square-foot floorplans, he said.\nIt hasn’t been smooth sailing for the buildings’ owners. Raphael Lowenstein, who leads property management firm 312 Properties with his brother Ari Lowenstein, have been accused of allowing other properties they run to rack up code violations and leave tenants living in poor conditions.\nThe code violations at properties at 4520 and 4830 South Drexel Boulevard and 4612-4626 South Lake Park Avenue\nnearly led the landlords to default\non $54 million worth of CMBS loans backing the properties but they later cleared the violations and\nsecured new financing\n.\nRaphael Lowenstein did not respond to requests for comment.\n",
    "related_links": [
      "https://therealdeal.com/chicago/2024/06/11/dmg-capital-buys-river-wests-linkt-apartments-for-14m/",
      "https://therealdeal.com/chicago/2024/10/11/jll-investment-arm-sells-chicago-multifamily-highrise-for-discount/",
      "https://therealdeal.com/chicago/2025/03/19/aquinnah-investment-trust-proposes-hotel-near-obama-center/",
      "https://therealdeal.com/chicago/2025/03/14/farpoint-visualizes-chicago-bears-stadium-in-bronzeville/",
      "https://therealdeal.com/chicago/2023/03/20/woodlawn-mansion-buyer-shatters-neighborhood-record/",
      "https://therealdeal.com/chicago/2024/11/11/south-side-landlord-lowenstein-late-on-54m-in-kenwood-loans/",
      "https://therealdeal.com/chicago/2024/03/22/how-chicago-multifamily-owners-refinance-as-market-thaws/",
      "https://therealdeal.com/chicago/2024/11/11/why-suburban-chicago-multifamily-sales-outperform-city/",
      "https://therealdeal.com/chicago/2024/12/04/trio-of-investors-pay-combined-165m-for-suburban-chicago-apartments/",
      "https://therealdeal.com/chicago/2025/01/07/former-transwestern-broker-eyes-30m-land-deal-for-50-story-tower/"
    ],
    "market": "Chicago",
    "published": "Thu, 20 Mar 2025 19:30:54 +0000",
    "published_dt": "2025-03-20T19:30:54+00:00",
    "author": "Emma Whalen"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/20/miami-beach-commission-oks-terra-meruelos-deauville/",
    "title": "Miami Beach commission grants initial approval of Deauville redevelopment",
    "subhead": "Despite overwhelming support, some raised concerns with green-lighting Meruelo family’s plan",
    "authors": "ByKatherine Kallergis",
    "pub_date": "Mar 20, 2025, 3:30 PM",
    "pub_date_dt": "2025-03-20T15:30:00",
    "content": "Miami Beach commissioners approved land use changes that will allow the Meruelo family and David Martin’s Terra to build a larger project on the oceanfront property that was previously home to the Deauville Beach Resort.\nThe commission on Wednesday evening voted six to 1, with commissioner David Suarez casting the sole ‘no’ vote, on first reading to approve two amendments that would apply to the 3.8-acre oceanfront property at 6701 Collins Avenue in North Beach. Mayor Steven Meiner and commissioners Tanya Bhatt, Laura Dominguez, Alex Fernandez, Joseph Magazine and Kristen Rosen Gonzalez voted in favor.\nMartin, CEO of Terra, has been leading the charge on behalf of the Meruelos, who have a 75 percent stake in the property. Martin was brought on in part due to his reputation as a developer who negotiates successfully with local governments, helping\nwith damage control\n.\nThe Meruelo family and Terra now plan a 120-unit condo and 150-room hotel project on the site, designed by Foster + Partners, Shulman + Associates and ODP as the project architect.\nThe\nDeauville\nproperty currently has a floor area ratio, or overall project size, of 3.0 to 3.15. The developer is seeking legislative changes that would allow for an FAR of 5.5, for a project that could span nearly 916,000 square feet. The project would include a partial reconstruction of the Deauville and a proposed height of 400 feet tall.\nThe changes will require a referral to the planning board and a second reading vote from the commission, likely next month.\nThe Meruelos were heavily criticized for letting the iconic Deauville fall into disrepair to the point where it required demolition. The family has also been tied up in litigation with the city.\nThose sentiments weren’t on display for the majority of the discussion at Wednesday’s commission meeting. Residents and city officials spoke overwhelmingly in favor of the redevelopment.\n“I want to speak to you from my heart when I tell you that this project is brilliant, and Mr. Martin, the time he has spent listening, public hearings, answering questions, I think the humanity of it is also brilliant for such a big project,” said Richard Zaki, a resident at the nearby Sterling condo building.\nElizabeth Latone, who is on the city’s planning board, spoke as a member of the public, begging the commission to approve the project.\n\n“How much longer can we wait? At what point is something going to be good enough for this spot? Yes, we have terrible owners. Everybody knows that they are toxic, but we can’t wait anymore,” Latone said.\nCommissioner Bhatt agreed.\n“I hate the fact that they’re going to make money off of this,” she said, referring to the Meruelos. Bhatt said the city was nearing a deal to have the owners pay off millions of dollars in fines they owe the city.\nDaniel Ciraldo, executive director of the Miami Design Preservation League, supported the project and praised its design, but urged the city to remember that the Meruelos own the majority interest and asked that they negotiate a lower height.\n“We need to make sure that we’re clear that the owners are also the Meruelos, and they owe millions of dollars to the city of Miami Beach, and David Martin is a very good developer, but there’s another owner that a lot of us know cannot always be trusted,” he said.\n“It is a double height of what was there,” he added. “Between first and second [reading], I hope you guys can really negotiate the height, make it even better.”\nThe Deauville, built in 1957, was about 185 feet tall and 17 stories.\nThis latest proposal follows billionaire developer Steve Ross’ plan to secure an FAR of 4.5, which voters\nrejected via a referendum\nin 2022. Ross entered into a contract with the Meruelos to pay $500 million for the site, but the deal was contingent on voters approving the referendum.\nIn a statement, Martin said the development team is “taking the time to get it right.” The project, he wrote, “will pay tribute to the legacy of the historic Deauville.” He joined the project about a year ago when Terra\npaid $12.5 million\nfor a 25 percent stake in the property.\n",
    "related_links": [
      "https://therealdeal.com/miami/2024/04/14/weekly-dirt-timeline-of-david-martin-buying-into-deauville/",
      "https://therealdeal.com/tag/deauville-beach-resort/",
      "https://therealdeal.com/miami/2022/11/09/billionaire-ross-proposal-to-upzone-deauville-site-in-miami-beach-fails/",
      "https://therealdeal.com/miami/2024/04/11/terras-david-martin-buys-25-stake-in-deauville-miami-beach/",
      "https://therealdeal.com/miami/2025/02/04/meruelos-david-martin-seek-deauville-miami-beach-approval/",
      "https://therealdeal.com/miami/2024/11/21/meruelos-david-martin-propose-multi-tower-deauville-project/"
    ],
    "market": "South Florida",
    "published": "Thu, 20 Mar 2025 19:30:00 +0000",
    "published_dt": "2025-03-20T19:30:00+00:00",
    "author": "Katherine Kallergis"
  },
  {
    "url": "https://therealdeal.com/national/philadelphia/2025/03/20/tenants-file-class-action-lawsuit-against-philly-landlord/",
    "title": "Tenants sue Philly landlord over rentals in disrepair",
    "subhead": "Bentley Manor residents claim Odin Properties improperly collected rent",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 20, 2025, 3:30 PM",
    "pub_date_dt": "2025-03-20T15:30:00",
    "content": "Tenants at a Philadelphia apartment building are banding together to take the rare step of suing their landlord.\nResidents of the 71-unit Bentley Manor in West Oak Lane filed a class action lawsuit against Odin Properties and ownership entities tied to the company, WHYY\nreported\n. The lawsuit was filed last week in the Common Pleas Court.\nThe plaintiffs allege Odin collected rent despite the city’s Department of Licenses and Inspections labeling the property as an “unsafe structure,” citing loose and missing bricks, as well as a “leaning parapet” on the roof. The determination was made in November, after which Odin had 30 days to make repairs.\nIn Philadelphia, landlords are not allowed to collect rent if buildings are not compliant with safety and habitability standards. Odin is accused of failing to appeal the 30-day notice it received or make the necessary repairs, therefore forfeiting its right to collect rent.\nBut Odin continued collecting for four months, according to the lawsuit. The complaint demands Odin make the required repairs and return the unlawful rent paid to the landlord.\n\n“We care deeply about our residents and take tremendous pride in our relationships with them, so we take any allegations to the contrary very seriously,” Odin chief executive officer Philip Balderston said in a statement. “We are carefully considering the allegations of the recent complaint and plan to respond appropriately.”\nOdin did receive a commercial building permit two weeks ago, suggesting it may be about to make structural repairs to the property.\nOdin owns and manages more than 1,500 apartments in Philadelphia. It also has a history of receiving tenant complaints regarding living conditions. Last year, Renters United Philadelphia held a protest demanding the landlord make repairs at affordable apartments across its portfolio, an action that came after tenants petitioned for a rent and eviction freeze at all of Odin’s properties until repairs were made.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://whyy.org/articles/philadelphia-odin-properties-bentley-manor-west-oak-lane/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/national/philadelphia/2025/03/14/philadelphia-budget-proposal-full-of-real-estate-nuggets/",
      "https://therealdeal.com/national/philadelphia/2025/02/24/philadelphia-mayor-signs-order-to-create-preserve-30k-units/",
      "https://therealdeal.com/national/philadelphia/2025/02/14/philly-developer-sells-pair-of-apartment-buildings-for-93m/"
    ],
    "market": "National",
    "published": "Thu, 20 Mar 2025 19:30:00 +0000",
    "published_dt": "2025-03-20T19:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/austin/2025/03/20/torchys-tacos-founder-lists-lake-austin-estate/",
    "title": "Torchy’s Tacos CEO tests demand with $25M lakeside listing",
    "subhead": "Luxury sales have slid while their price per square foot has increased",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 20, 2025, 3:26 PM",
    "pub_date_dt": "2025-03-20T15:26:00",
    "content": "The home of Torchy’s Tacos Mike Rypka hit the market as Austin’s priciest listing.\nRypka, founder and CEO of the popular chain, listed his estate on Lake Austin for $25.5 million, MySanAntonio\nreported\n.\nThe listing includes three parcels, at 4705 and 4709 Island Cove and 4400 Island Avenue, totalling 5 acres, his over 10,000-square-foot home, a one-bedroom casita, three-car garage and two-slip boat dock on the lake. The price pencils out to $2,452 per square foot.\nThe home has five bedrooms, three kitchens and eight living spaces, including a lower-level pool lounge. The property also includes a pickleball court, pool, hot tub and swim-up bar.\nRypka bought the house in 2017 and hired Britt Design Group to modernize it.\n\nHe opened Torchy’s as a food truck in Austin in 2006; the chain now has 120 locations across 16 states.\nLake Austin has cemented its status as a haven for Austin’s wealthiest residents in search of luxury real estate.\nA Four Seasons condo project is planned for the popular retreat along the Colorado River. The project is slated to include 179 homes and nine standalone villas. They start at $4.1 million according to the project’s website, ranging from 1,900 square feet up to four-bedroom spreads.\nLast month, Douglas Elliman publicized an off-market listing in the area. A 4,100-square-foot villa that’s one of five units at The Villas at West Harbor is\nasking $14.1 million\n. Though million-dollar home sales in Austin remained flat last year, the average price of luxury properties jumped from $472 per square foot to $510 per square foot, according to a\nreport\nfrom Texas Realtors.\n",
    "related_links": [
      "https://www.mysanantonio.com/realestate/article/torchys-tacos-founder-austin-estate-sale-20227605.php",
      "https://therealdeal.com/texas/austin/2025/02/18/ultra-luxury-condo-on-lake-austin-listed-for-14m/",
      "https://www.texasrealestate.com/wp-content/uploads/2024TexasMillionDollarHomeSalesReport-a.pdf",
      "https://therealdeal.com/texas/austin/2025/02/18/ultra-luxury-condo-on-lake-austin-listed-for-14m/",
      "https://therealdeal.com/texas/austin/2024/10/22/turnbridge-equities-leaves-four-seasons-lake-austin/",
      "https://therealdeal.com/magazine/july-2024/an-odd-couple-of-developers-bets-they-can-build-miami-level-luxury-condos-in-austin/"
    ],
    "market": "Texas",
    "published": "Thu, 20 Mar 2025 19:26:07 +0000",
    "published_dt": "2025-03-20T19:26:07+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/20/sfs-largest-apartment-complex-ordered-into-receivership/",
    "title": "SF’s largest apartment complex ordered into receivership",
    "subhead": "Receiver to control 3,200-unit Parkmerced after Maximus defaults on $1.8B in loans",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 20, 2025, 3:00 PM",
    "pub_date_dt": "2025-03-20T15:00:00",
    "content": "Parkmerced has veered into receivership after Maximus Real Estate Partners defaulted on nearly $1.8 billion in loans secured by the largest apartment complex in San Francisco.\nA court appointed the San Diego-based Douglas Wilson Companies to serve as a receiver for the 152-acre, 3,221-unit complex at 3711 19th Avenue, south of San Francisco State University,\nthe San Francisco Business Times reported.\nMaximus and its lawyers are set to appear in court later in March to “give legal reason why a receiver should not be confirmed,” according to court records.\nThe court order came three months after the locally based Maximus defaulted on a $1.5 billion commercial mortgage-backed loan, according to the newspaper. It said the landlord was in talks\nwith lenders\nBarclays and Citigroup for months leading up to the December maturity default\nThe Real Deal\n, however, had reported in July that Maximus had\ndefaulted on $1.775 billion in loans\ntied to the blighted complex.\nIt was in 2019 that Maximus recapitalized $1.8 billion debt with $1.5 billion in senior financing from Barclays and Citi and a $275 million mezzanine loan from Aimco.\nMaximus had proposed redeveloping the World War II-era garden apartments by adding 5,700 homes, 230,000 square feet of shops and restaurants, 80,000 square feet of offices and a 64,000-square-foot community center.\nAlthough plans for its redevelopment were approved in 2011, and\nnew renderings put out\nin 2022, the project never broke ground, with Maximus founder Rob Rosania citing “sky-high construction costs, inflation and supply chain issues.”\n\nRosania said in December his firm was planning to close a loan extension in “coming weeks.” Notes sent to bondholders this month said future lender actions could include foreclosure.\nLast April, $1.8 billion in loans backed by Parkmerced were\nturned over to special servicing at the request of the landlord\n, citing high vacancy and a looming loan maturity.\nIn May, the\nSan Francisco Chronicle reported\ndozens of Parkmerced tenant complaints about broken elevators, lack of lighting in public areas, mold and mildew, leaks, car break-ins, rodents, overflowing dumpsters and squatters taking over vacant units.\nThe publication said the landlord may have cut back on security and maintenance, leading to\nrising crime and blight\n.\nParkmerced, a planned development from Metropolitan Life and designed by Leonard Schultze and Associates, opened its first apartments in 1944 for homecoming war veterans. It’s the second-largest complex in the state behind L.A.’s historic Park La Brea, another garden apartment complex with 4,225 units.\nDouglas Wilson, founder of his eponymously named company, said its goal will be to safeguard Parkmerced and work toward its “repositioning.”\n“It’s been lacking capital for some time,” Wilson told the Business Journal, adding his firm would address issues with life safety and spending. The company is considering bringing in a new property management firm.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.bizjournals.com/sanfrancisco/news/2025/03/19/parkmerced-receiver-san-francisco-maximus.html",
      "https://www.bizjournals.com/sanfrancisco/news/2024/10/18/maximus-parkmerced-negotiations-cmbs.html",
      "https://therealdeal.com/san-francisco/2024/07/16/parkmerced-loans-land-in-default-appraisal-dips-700m/",
      "https://therealdeal.com/sanfrancisco/2022/08/12/maximus-unveils-plans-for-sfs-parkmerced/",
      "https://therealdeal.com/sanfrancisco/2024/04/16/1-8b-in-parkmerced-debt-heads-to-special-servicing/",
      "https://www.sfchronicle.com/bayarea/article/parkmerced-apartments-problems-19423636.php",
      "https://therealdeal.com/san-francisco/2024/05/02/sfs-parkmerced-plagued-by-crime-vermin-squatters-debt/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2024/07/16/parkmerced-loans-land-in-default-appraisal-dips-700m/",
      "https://therealdeal.com/san-francisco/2024/05/02/sfs-parkmerced-plagued-by-crime-vermin-squatters-debt/",
      "https://therealdeal.com/san-francisco/2024/04/16/1-8b-in-parkmerced-debt-heads-to-special-servicing/"
    ],
    "market": "San Francisco",
    "published": "Thu, 20 Mar 2025 19:00:00 +0000",
    "published_dt": "2025-03-20T19:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/20/february-existing-home-sales-numbers-a-mixed-bag/",
    "title": "Home sales climbed out of winter freeze in February",
    "subhead": "Price, activity gains across markets, but market still down annually: NAR",
    "authors": "ByHolden Walter-Warner",
    "pub_date": "Mar 20, 2025, 2:45 PM",
    "pub_date_dt": "2025-03-20T14:45:00",
    "content": "The housing market thawed out from a winter freeze in February, warmed up by rising supply.\nExisting home sales increased 4.2 percent in February from January to a seasonally adjusted annual rate of 4.26 million, according to a\nmonthly report\nfrom the National Association of Realtors. Despite the monthly gain, sales were down 1.2 percent compared to last February.\n“Home buyers are slowly entering the market,” NAR chief economist Lawrence Yun said in a statement. “Mortgage rates have not changed much, but more inventory and choices are releasing pent-up housing demand.”\nThe median price for existing home sales rose to $398,400, a 3.8 percent increase from the same period in 2024 and the 20th consecutive month of year-over-year price increases. All four regions tracked recorded price gains.\nHousing inventory at the end of the month climbed to 1.24 million units, up 5.1 percent from January and 17 percent from one year ago. That represents a 3.5-month supply at the latest sales pace, unchanged from January but up from three months last February.\n\nRegional performance varied. The Northeast saw a 2 percent monthly decrease, but a 4.2 percent annual increase. Midwest sales remained unchanged from January but rose 1 percent from last year. The South experienced a 4.4 percent monthly increase despite being down 4 percent annually. And the West showed the strongest monthly growth at 13.3 percent, with sales remaining identical to a year ago.\nFirst-time buyers accounted for 31 percent of sales in February, up from 28 percent in January and 26 percent a year earlier. Cash sales represented 32 percent of transactions and individual investors purchased 16 percent of homes.\nProperties typically remained on the market for 42 days in February, slightly longer than both the previous month (41 days) and last February (38 days).\nZillow chief economist Skylar Olsen expects the “disappointing volume of existing home sales…to be short-lived” as homebuyers remain sensitive to mortgage rates in a time of vast economic uncertainty.\nThe 30-year fixed-rate mortgage averaged 6.65 percent as of March 13, according to Freddie Mac, slightly up from the previous week but down from 6.74 percent one year ago.\n",
    "related_links": [
      "https://www.nar.realtor/newsroom/existing-home-sales-accelerated-4-2-in-february",
      "https://therealdeal.com/national/2024/10/24/u-s-housing-market-sees-worst-sales-year-since-1995/",
      "https://therealdeal.com/national/2025/03/06/investors-ease-up-on-housing-market-in-q4-redfin/"
    ],
    "market": "National",
    "published": "Thu, 20 Mar 2025 18:45:00 +0000",
    "published_dt": "2025-03-20T18:45:00+00:00",
    "author": "Holden Walter-Warner"
  },
  {
    "url": "https://therealdeal.com/national/las-vegas/2025/03/20/developers-buy-as-feds-peddle-parcels-in-landlocked-vegas/",
    "title": "Developers buy as feds peddle parcels in landlocked Las Vegas",
    "subhead": "Bureau of Land Management sells 42 acres at auction for typical $394K per acre",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 20, 2025, 2:06 PM",
    "pub_date_dt": "2025-03-20T14:06:00",
    "content": "Developers in landlocked Las Vegas have reaped a bonanza with auction buys of dozens of acres of land from the federal government for a combined $16.5 million.\nThe Bureau of Land Management listed 10 parcels of land on Energy.net, of which eight — comprising 41.85 acres — sold, the\nLas Vegas Review-Journal reported\n, citing the\nBLM\n.\nCombined the purchases work out to $394,265 per acre.\nThe developers paid more than $1.2 million over fair market value for parcels between 2.5 acres and 25 acres. Two of the largest lots, at 25 acres and 10 acres, didn’t sell.\nPurchases broke down as follows:\nHaikal Exemption Trust, for which no information was immediately available, won three bids during the sale. The trust paid $1.5 million for 2.5 acres east of South Rainbow Boulevard and North Gomer; $1.7 million for 2.5 acres at Roban Avenue and South Las Vegas Boulevard; and $2.1 million for 5 acres east of the 215-Beltway at West Azure and North Hualapai Way.\nAtlanta-based Beazer Homes, an Atlanta-based home construction company, won bids for two adjacent 5-acre parcels east of South Racetrack between Burkholder Boulevard and Venice Avenue, for $1.7 million and $2 million.\nElite Excavating, based in Utah and Nevada, paid $3.7 million for 12.5 acres east of U.S. Highway 95 along Sun Village Park Drive and Kyle Canyon Road.\nHamid “Henry” Moradi paid $2.6 million for 6.85 acres off Blue Diamond Road between South Grand Canyon Drive and Hualapai Way.\nKhusrow Roohani, owner of locally based Seven Valleys Realty &amp; Construction, paid $1.2 million for 2.5 acres north of Blue Diamond Road along South Buffalo Drive and West Cougar Avenue.\nTwo parcels received no bids, including 10 acres at the southwest corner of West La Madre Way and North Fort Apache Road, with a fair market value of $4.3 million, and 25 acres east of the 215 Beltway, on the northern border of West Centennial. They may be reauctioned.\n\nIt’s not clear why 35 acres of available land didn’t sell.\nFunds from the BLM land auction will pay for recreational opportunities and wildland fire reduction, according to the agency. The BLM manages more than 245 million acres of public land, primarily in 12 western states.\nDevelopers in Las Vegas point to a local land crunch, with one builder saying 25,000 acres of land around Las Vegas Valley are available for development, with the region poised to run out of buildable land in as little as seven years,\naccording to the Review-Journal\n.\nHome builders at a Keller Williams’ Meet the Builders panel in March cited challenges to development, including the lack of land, high land costs, record residential real estate prices and high mortgage rates.\nThe BLM, which controls approximately 88 percent of the land in Clark County, is coming under increased pressure from the private sector to sell off dirt. Last month, Gov. Joe Lombardo pressured state legislators to issue a resolution urging the Department of the Interior to release land for housing.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.reviewjournal.com/business/housing/lack-of-land-strangling-las-vegas-valley-real-estate-builders-say-3319033/",
      "https://www.blm.gov/press-release/las-vegas-public-land-sale-nets-more-165-million-state-projects",
      "https://www.reviewjournal.com/business/housing/lack-of-land-strangling-las-vegas-valley-real-estate-builders-say-3319033/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/national/las-vegas/2025/03/17/oikos-advances-22-unit-affordable-apartment-complex-in-vegas/",
      "https://therealdeal.com/national/las-vegas/2025/03/11/southern-land-cedar-street-bridge-go-big-in-las-vegas/",
      "https://therealdeal.com/national/las-vegas/2025/02/27/musks-boring-company-pitches-apartments-by-las-vegas-loop/"
    ],
    "market": "National",
    "published": "Thu, 20 Mar 2025 18:06:25 +0000",
    "published_dt": "2025-03-20T18:06:25+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/20/rent-control-drama-in-washington-heights/",
    "title": "Who’s the exploiter? A rent-control drama in Washington Heights",
    "subhead": "Tenant paid rent for years in name of dead roommate, but lawyer calls landlord the bad guy",
    "authors": "ByErik Engquist",
    "pub_date": "Mar 20, 2025, 1:30 PM",
    "pub_date_dt": "2025-03-20T13:30:00",
    "content": "“Profit” is such a dirty word to some Americans it makes you wonder if they realize it has made the United States the richest nation in the world.\nWhich brings us to an astonishing rent control saga in Washington Heights.\nCovering a case pitting 78-year-old Freda Henderson against landlord Westside Ventura II LLC, Gothamist wrote, “Her lawyer said in a statement that the judge’s decision ensures Henderson can stay in her affordable home and protects her from the landlord’s goal of evicting her to maximize profits.”\n“This case is not just about one tenant,” said Patrick Tyrrell of Mobilization for Justice, who represented Henderson. “It is part of a pattern of landlords exploiting legal loopholes to erode rent protections and displace long-term residents.”\nWait a second. Exploiting loopholes? Eroding rent protections? Displacing residents?\nGiven the facts of the case, Tyrell’s characterizations look a lot like spin. And dissecting his argument helps debunk some common myths associated with rent control and the motivations underlying both landlords and tenants.\nLet’s start with his attack on profit. Setting aside whether the law entitles Henderson to a rent-controlled unit, her lawyer’s demonization of profit is hypocritical.\nCapitalism works because people are trying to profit. That is why communist China switched to a market economy — pulling a billion people out of poverty and supercharging productivity. Yet Tyrell is portraying profit as a\ncause\nof poverty.\nIf the landlord is trying to “maximize profits,” the tenant is trying to minimize rent. Which is really the same thing. Henderson’s profit is her income (Social Security) minus expenses. Her primary expense is likely her rent, which is … wait for it … $640 a month.\n\nThat’s for a two-bedroom in Manhattan, where the\nmedian rent is $4,500\n.\nTo accomplish her goal of maximizing profit, when her longtime roommate died, Henderson, who was not on the lease,\nkept paying the $640 rent in his name\nand hoped the landlord wouldn’t notice. For years, he never did.\nBut in 2017 a new landlord caught on to her ruse and sought to convert the unit from rent-controlled to\nrent-stabilized\n.\nThat is how the law was designed in New York. It’s not a loophole. It’s the intent of the legislation. Fifty years ago, when rent control was replaced with rent stabilization, tenants were allowed to keep their rent-controlled leases until they moved out or died.\nIf the landlord can be said to be “exploiting a loophole” by evicting a tenant who was not on the lease, the tenant can be said to be exploiting a loophole by saying she was the previous tenant’s common-law wife and thus entitled to succession rights.\nThat is what the judge ruled, by the way, although the decision could be reversed on appeal. Both sides certainly have a case. One could even argue that Henderson was the exploiter for occupying a $640-a-month two-bedroom in the name of a deceased tenant.\nBut to give the impression that the decline in rent-controlled units — from 100,000 three decades ago to 24,000 in 2023, as Gothamist noted — is “part of a pattern” to “displace long-term residents,” as Tyrell said, is wrong.\nHere are the facts:\nRent control is being deliberately phased out by the state and replaced with rent stabilization. Landlords are trying to charge and collect the legal rent on their units. Westside Ventura II LLC and Freda Henderson are both trying to assert their rights under state law. The courts will decide who is right.\n",
    "related_links": [
      "https://therealdeal.com/new-york/2025/03/13/nyc-rents-smash-new-record-in-february/",
      "https://gothamist.com/news/a-love-story-not-a-lease-decides-washington-heights-rent-controlled-apartment-battle",
      "https://therealdeal.com/tag/rent-stabilization/",
      "https://therealdeal.com/new-york/2025/02/25/rent-stabilized-building-sells-at-97-below-pre-2019-value/",
      "https://therealdeal.com/new-york/2023/10/05/rent-control-makes-ny-apartments-affordable-by-wrecking-them/",
      "https://therealdeal.com/new-york/2025/03/17/can-city-solve-housing-crisis-and-keep-vacancy-under-5-no/"
    ],
    "market": "New York",
    "published": "Thu, 20 Mar 2025 17:30:00 +0000",
    "published_dt": "2025-03-20T17:30:00+00:00",
    "author": "Erik Engquist"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/20/hararis-aquablue-pays-18m-for-waterfront-miami-beach-lot/",
    "title": "Harari’s AquaBlue pays $18M for waterfront Miami Beach lot",
    "subhead": "Seller lost at least $4.5M on the deal",
    "authors": "ByKatherine Kallergis",
    "pub_date": "Mar 20, 2025, 1:30 PM",
    "pub_date_dt": "2025-03-20T13:30:00",
    "content": "Spec developer Philippe Harari’s AquaBlue Group paid $17.5 million for a waterfront lot in Miami Beach, adding to a string of recent sales on North Bay Road.\nProperty records show 6300 NBR LLC sold the\n0.6-acre lot\nat 6300 North Bay Road to an affiliate of AquaBlue. The latest sale marks a loss of about $4.5 million. The seller, a company managed by attorney Brian Bilzin, paid $22 million for the property in 2022.\nMick Duchon and Eloy Carmenate at the Corcoran Group represented the seller in the off-market deal.\nHarari wrote via text that he plans to develop a “beautiful home,” but declined to share more details.\n\nLast summer, his Miami Beach-based AquaBlue sold a waterfront spec mansion on Miami Beach’s La Gorce Island to a hidden buyer\nfor $62.5 million\n. The 12,800-square-foot mansion, with seven bedrooms, 10 bathrooms and three half-bathrooms, was designed by Choeff Levy Fischman Architecture + Design.\nUltra-luxury home sales have increased in Miami Beach in recent weeks, including on\nNorth Bay Road\n.\nIn February, a longtime Miami Beach resident sold her waterfront home, likely a teardown, at 5060 North Bay Road\nfor $25.5 million\n. Also last month, developer Todd Glaser went into contract to purchase Sonny Kahn’s 2.3-acre waterfront estate at  5940 North Bay Road for\n$105 million\n. Glaser plans to either flip the compound for more than $150 million or build a spec mansion asking $250 million.\nThe biggest recent trade was on Miami Beach’s Star Island, where billionaire developer Vlad Doronin sold his waterfront estate\nfor $120 million\n, setting a new record for home sales in Miami-Dade County.\n",
    "related_links": [
      "https://therealdeal.com/miami/2021/02/11/michelle-simkins-picks-up-waterfront-north-bay-road-teardown-for-10m/",
      "https://therealdeal.com/miami/2024/06/13/aquablue-sells-one-of-miami-beachs-priciest-mansions-for-63m/",
      "https://therealdeal.com/tag/north-bay-road/",
      "https://therealdeal.com/miami/2025/02/14/waterfront-north-bay-road-teardown-sells-for-26m/",
      "https://therealdeal.com/miami/2025/02/10/todd-glaser-and-partners-spending-105m-on-miami-beach-home/",
      "https://therealdeal.com/miami/2025/03/07/vlad-doronin-sells-waterfront-star-island-estate-for-120m/",
      "https://therealdeal.com/miami/2024/06/13/aquablue-sells-one-of-miami-beachs-priciest-mansions-for-63m/",
      "https://therealdeal.com/miami/2025/02/10/todd-glaser-and-partners-spending-105m-on-miami-beach-home/",
      "https://therealdeal.com/miami/2025/01/23/billionaire-jamie-salter-sells-miami-beach-home-to-khubani/"
    ],
    "market": "South Florida",
    "published": "Thu, 20 Mar 2025 17:30:00 +0000",
    "published_dt": "2025-03-20T17:30:00+00:00",
    "author": "Katherine Kallergis"
  },
  {
    "url": "https://therealdeal.com/texas/2025/03/20/forever-21-bankruptcy-leaves-mall-vacancies-across-texas/",
    "title": "Texas retail is fire, but not Forever 21",
    "subhead": "Fast-fashion store’s bankruptcy leaving mall vacancies across the state",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 20, 2025, 1:07 PM",
    "pub_date_dt": "2025-03-20T13:07:00",
    "content": "A fast-fashion retailer’s bankruptcy is leaving vacancies in 32 malls across Texas.\nForever 21 filed for bankruptcy for the second time in six years, citing rising costs and increased competition from overseas brands. The company’s operator, F21 OpCo, voluntarily filed in the U.S. Bankruptcy Court for the District of Delaware on Sunday, the Austin American-Statesman\nreported\n.\nAs part of the restructuring, Forever 21 will begin winding down its U.S. operations while searching for a buyer for its remaining assets. The retailer’s stores and website will remain operational during the process. The company is seeking court approval to use cash collateral to continue paying employee wages and benefits.\nForever 21 has struggled to keep pace with low-cost competitors such as Shein and Temu, which have attracted consumers with trendy fashion at lower prices. While Forever 21 sells T-shirts for around $10, Temu offers similar items for as little as $5, for example. The growing dominance of these online retailers, coupled with economic pressures, has made it difficult for Forever 21 to maintain its market position.\nThe brand first filed for bankruptcy in 2019 before being acquired by a consortium that included Authentic Brands Group and Simon Property Group.\n\nBuying Forever 21 “was probably the biggest mistake I made,” Authentic Brands CEO Jamie Salter said at a conference last year, Retail Dive\nreported\n.\nBut the brand is seeking buyers to salvage the business.\n“Retail is changing, and like many brands, Forever 21 is adapting to create the right balance across stores, e-commerce and wholesale,” Jarrod Weber, global president of lifestyle at Authentic Brands,\ntold\nFox Business.\nHigh occupancy, historic demand and stagnant development have defined the retail market across the Texas Triangle for the past couple of years. While big-box stores such as Conn’s, Big Lots and Party City are shutting down, their spaces are often backfilled by retailers including Burlington and Ollie’s Bargain Outlets, as well as various fitness concepts and specialty grocers, according to Weitzman.\nTexas’ regional shopping malls are healthier after decades of decline and redevelopment. Occupancy was 93.4 percent among Dallas-Fort Worth malls at the end of last year, for example, up from 91.3 percent a year earlier, Weitzman said.\n",
    "related_links": [
      "https://www.statesman.com/story/news/state/2025/03/18/forever-21-liquidation-sale-texas-stores-closing-near-me/82511628007/",
      "https://www.retaildive.com/news/shein-thirty-billion-revenue-authentic-forever-21-ipo/704121/",
      "https://www.foxbusiness.com/economy/retailer-forever-21-files-bankruptcy-second-time-6-years",
      "https://therealdeal.com/texas/dallas/2023/12/11/wanted-retail-real-estate-in-texas/",
      "https://therealdeal.com/texas/dallas/2023/11/27/investors-spent-1-3b-on-dfw-retail-in-nine-months/",
      "https://therealdeal.com/texas/dallas/2025/01/22/home-depot-to-open-in-fast-growing-town-with-sales-tax-grant/"
    ],
    "market": "Texas",
    "published": "Thu, 20 Mar 2025 17:07:03 +0000",
    "published_dt": "2025-03-20T17:07:03+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/20/kbra-warns-of-potential-default-at-harlem-shopping-center/",
    "title": "KBRA warns of potential default at Harlem shopping center",
    "subhead": "Complex’s co-owner says he’s “not the least bit worried”",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 20, 2025, 1:02 PM",
    "pub_date_dt": "2025-03-20T13:02:00",
    "content": "A 250,000-square-foot shopping center in Harlem may be on the verge of defaulting on its debt. Grid Properties principal Drew Greenwald isn’t sweating it.\nCo-owners Grid and the Gotham Organization could default on a $108 million mortgage backing Harlem USA at 300 West 125th Street, according to an analysis by credit rating agency KBRA\nreported\nby Crain’s. Investors could take a $26 million hit on the “loan of concern,” according to KBRA.\nThe root of concern appears to be the 26 percent vacancy rate, which is 10 percentage points higher than the neighborhood average, according to the Department of City Planning. Modell’s Sporting Goods, Chuck E. Cheese, and\nBuffalo Wild Wings closed\nduring the pandemic, but none have been replaced so far and 50,000 square feet are left empty. The vacancy rate was only 5 percent the year before the onset of the pandemic.\nThe loan is slated to come due next year, when ownership will likely face interest rates above the current 3.3 percent.\nKBRA estimated the property is worth $82 million, well below the value of the most recent mortgage.\n\nDespite long-term vacancies, co-owner Greenwald said he believes the complex will be fully leased in the next 12 months. He claims an unnamed supermarket will arrive soon and the property is generating more than enough cash to pay its bills. The KBRA analysis appears to validate that confidence, as the property is generating 170 percent of the necessary cash for existing debt obligations.\n“I’m not the least bit worried,” Greenwald told the outlet of KBRA’s analysis.\nHarlem USA, located across the street from the famed Apollo Theater, was the first property in the neighborhood to host national chains. Tenants include Old Navy, which is on a lease for 35,000 square feet set to expire in 2028, and the nine-screen AMC Magic Johnson movie theater, set to continue occupying nearly 70,000 square feet until at least 2030.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.crainsnewyork.com/real-estate/harlem-shopping-center-anchored-amc-movie-theater-trouble-analyst-says",
      "https://therealdeal.com/new-york/2021/04/14/buffalo-wild-wings-chickens-out-on-harlem-lease/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/2021/04/14/buffalo-wild-wings-chickens-out-on-harlem-lease/",
      "https://therealdeal.com/magazine/new-york-february-2011/clans-with-plans/",
      "https://therealdeal.com/magazine/new-york-april-2006/the-real-deal-podcast-david-picket/"
    ],
    "market": "New York",
    "published": "Thu, 20 Mar 2025 17:02:26 +0000",
    "published_dt": "2025-03-20T17:02:26+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/20/baron-property-group-nabs-hialeah-rentals-construction-loan/",
    "title": "Baron scores $206M construction loan for 661-unit apartment project in Hialeah",
    "subhead": "Firm bought out its partner on development, MG Developer, last year",
    "authors": "ByLidia Dinkova",
    "pub_date": "Mar 20, 2025, 12:30 PM",
    "pub_date_dt": "2025-03-20T12:30:00",
    "content": "Baron Property Group scored a $206 million construction loan for the Metro Parc North apartment project in Hialeah.\nThe New York-based firm is building the eight-story building with 661 units at 901 East 26th Street, according to a Baron news release. Construction started last month, and is expected to be completed in late 2027.\nStamford, Connecticut-based Post Road Group is the lender, the release says. Ayush Kapahi of HKS Real Estate Advisors represented the borrower and lender.\nDesigned by Modis Architects, Metro Parc North will offer studios and one-bedroom to three-bedroom units.\n\nBaron, led by Matthew Baron, originally had partnered with Coral Gables-based MG Developer on the project. In December, Baron bought out MG Developer’s 50 percent stake in the project for an undisclosed amount.\nBaron and MG Developer, led by Alirio Torrealba, partnered on the 10-story, 559-unit Metro Parc apartment building completed this year near Metro Parc North. The duo scored a\n$148 million\nconstruction loan for the project in 2022.\nOn its own, MG Developer plans the 10-story, 347-unit\nMetro Parc South\non an assemblage at 965, 975, 981, 991 and 997 East 24th Street, as well as at 934 and 954 East 25th Street, in Hialeah.\nSouth Florida\nconstruction financing\nhas flowed, despite elevated interest rates. This month, 13th Floor Investments and JSB Capital Group scored\n$67.5 million\nto build the five-story, 383-unit Parks at Davie apartment complex with some workforce apartments on the northwest corner of Davie Road and Southwest 37th Street near Broward College in Davie. That came on the heels of TM Real Estate scoring a\n$53.5 million\nconstruction loan for the 250-unit Shalimar at Boynton Beach rental complex with 10 three-story and four-story buildings at 3570 West Boynton Beach Boulevard in Boynton Beach.",
    "related_links": [
      "https://therealdeal.com/miami/2022/09/23/mg-developer-partner-score-148m-loan-for-hialeah-apartments/",
      "https://therealdeal.com/miami/2024/01/24/mg-developer-buys-hialeah-dev-sites-for-metro-parc-south/",
      "https://therealdeal.com/tag/construction-loans/",
      "https://therealdeal.com/miami/2025/03/18/13th-floor-jsb-nab-68m-davie-rentals-construction-loan/",
      "https://therealdeal.com/miami/2025/03/13/tm-real-estate-nabs-construction-loan-for-boynton-rentals/"
    ],
    "market": "South Florida",
    "published": "Thu, 20 Mar 2025 16:30:38 +0000",
    "published_dt": "2025-03-20T16:30:38+00:00",
    "author": "Lidia Dinkova"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/20/council-puts-forth-bills-to-fight-voucher-discrimination/",
    "title": "City Council weighs sharpening teeth against voucher discriminators",
    "subhead": "Package includes stiffer penalties for landlords who defy city orders",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 20, 2025, 12:14 PM",
    "pub_date_dt": "2025-03-20T12:14:00",
    "content": "New York City legislators are trying to make source of income discrimination less prevalent.\nCouncil member Shekar Krishnan — a one-time housing lawyer — sponsored a package of six bills targeting landlords who discriminate against prospective tenants who use rental subsidies, City Limits\nreported\n. Discrimination against voucher holders has been illegal since 2008 but is still one of the most common types of housing discrimination, according to the city’s Commission on Human Rights.\nThe half-dozen bills the City Council is weighing would stiffen penalties against both landlords and brokers for voucher discrimination.\n“We know the stories too well of tenants who are turned away from apartments because they are on a voucher, because they have Section 8, because they have a public benefit,” said Krishnan.\nOne proposal would add source of income discrimination to a list covered by the Certificate of No Harassment program, potentially allowing the city to deny building or construction permits. Another proposal would increase the maximum civil penalty for those who defy Commission on Human Rights orders.\n\nThe other proposals:\nBase landlord fines on the number of buildings they own, increasing penalties for large corporate landlords, a common denominator in source of income complaints\nProhibit credit history requirements for voucher holders\nRequire applicant notification if denial is based on a tenant screening report\nPublic disclosure of landlords found guilty of source of income discrimination\nRental vouchers are one option to help propel households from the city’s shelter system to permanent housing. As of the end of last year, nearly 52,000 households were taking advantage of CityFHEPS vouchers alone, according to city officials.\nOpen discrimination against holders of Section 8 vouchers is\non the decline\n, Housing Rights Initiative founder Aaron Carr told\nThe Real Deal\nlast year, but prospective renters still have horror stories about being ghosted or deterred from using their subsidies.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://citylimits.org/i-was-ghosted-degraded-bills-seek-to-combat-discrimination-against-rental-vouchers/",
      "https://therealdeal.com/new-york/2024/02/13/open-discrimination-against-section-8-voucher-users-drops/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/2024/08/22/bronx-landlord-hit-with-big-fine-for-housing-discrimination/",
      "https://therealdeal.com/new-york/2024/03/15/city-settles-lawsuit-regarding-housing-voucher-issues/",
      "https://therealdeal.com/new-york/2024/02/13/open-discrimination-against-section-8-voucher-users-drops/"
    ],
    "market": "New York",
    "published": "Thu, 20 Mar 2025 16:14:19 +0000",
    "published_dt": "2025-03-20T16:14:19+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/20/aman-looking-to-raise-up-to-2b-for-global-expansion/",
    "title": "Aman looking to raise up to $2B for global expansion",
    "subhead": "Vlad Doronin’s luxury hotel group has 23 projects in the works",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 20, 2025, 11:30 AM",
    "pub_date_dt": "2025-03-20T11:30:00",
    "content": "Vlad Doronin is on the hunt for as much as $2 billion as he seeks to expand the Aman Group’s global reach.\nAman is in discussions with its bankers over how to structure its latest fundraising campaign, Bloomberg\nreported\n. Aman is hoping to secure funds from both institutional investors and wealthy individuals.\nThe fundraising campaign is not expected to end until early next year. Doronin will use the funds to support the 23 hotel projects already underway across the world, as well as expand the luxury Aman Residences brand.\n“We are working to expand the brand and we’re working with different investment funds and in negotiation with a few different groups,” Doronin said in an interview. “We’re looking for good, solid partners.”\nAmong the projects Doronin has in the works are $39 million mansions in Saudi Arabia’s Riyadh, a pair of luxury buildings in Dubai with 39 apartments each and a 150-key hotel in Dubai’s financial district. There are another 39 projects in the pre-development phase, which are yet to be officially announced.\nDoronin is aiming to expand further into the Middle East and Africa, in addition to creating more hotels under the Janu brand, which caters to younger customers by taking away some of the seclusion aspects of the Aman brand.\n\nThree years ago, Aman raised $900 million from Saudi Arabia’s Public Investment Fund and London-based Cain International. That gave the company a $3 billion valuation, at the time. Mubadala Capital and Alpha Wave Ventures — a joint venture of Alpha Wave Capital and Chimera Capital — chipping in $360 million a year later.\nAman Residences has sold $5.7 billion worth of properties in the past three years. At the start of the year, Doronin traded the final unit at his luxury hotel-condo conversion known as Aman New York for more than $11,400 per square foot.\nWhile the\n$66 million sale\nwas down from the $79 million asking price specified on the developer’s offering plan, it still marked a sellout for the property.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.bloomberg.com/news/articles/2025-03-19/ultra-luxury-hotel-group-aman-seeks-2-billion-for-global-push?srnd=phx-industries-real-estate",
      "https://therealdeal.com/new-york/2025/01/09/aman-new-yorks-final-closing-breaks-manhattan-record/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/2025/01/09/aman-new-yorks-final-closing-breaks-manhattan-record/",
      "https://therealdeal.com/miami/2025/03/07/vlad-doronin-sells-waterfront-star-island-estate-for-120m/",
      "https://therealdeal.com/new-york/2024/07/10/135m-aman-penthouse-tops-manhattan-sales/"
    ],
    "market": "National",
    "published": "Thu, 20 Mar 2025 15:30:00 +0000",
    "published_dt": "2025-03-20T15:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/tristate/2025/03/20/lloyd-goldmans-gurneys-montauk-value-jumps-after-extension/",
    "title": "Lloyd Goldman’s Montauk resort nabs higher valuation after special servicing",
    "subhead": "BLDG currently renovating struggling Montauk resort and hotel",
    "authors": "BySuzannah Cavanaugh",
    "pub_date": "Mar 20, 2025, 11:02 AM",
    "pub_date_dt": "2025-03-20T11:02:00",
    "content": "In a rarity for commercial real estate these days, the value of a Montauk asset jumped after a short stay in special servicing.\nGurney’s Montauk Resort &amp; Seawater Spa\n— owned by Lloyd Goldman’s BLDG Management – was recently reappraised at $280 million, a 15 percent increase from its $244 million value when the loan was made in 2021.\nA spokesperson for BLDG did not immediately comment.\nWhen the loan was first issued, the high-end resort was the toast of the island. DBRS Morningstar said the hotel “performed extremely well” during the early days of Covid as wealthy New Yorkers flocked to it for a close-to-home oceanside sojourn. But the $271 million loan ultimately landed in special servicing for maturity default in\nlate 2024\n, a transfer BLDG chalked up to an administrative hiccup that delayed the loan extension.\nDespite loan data showing a years-long trend of declining occupancy and revenue that could not cover monthly mortgage payments, the BLDG team stressed that the deal was in good shape.\n“The hotel continues to thrive and remains an outstanding asset in the portfolio,” BLDG COO Justin Kleinman said in January.\n\nAround that time, Gurney’s was shuttered for renovations.\nIn February, the resort reopened and BLDG scored another year to pay off the debt. The trade-off: a $9.4 million\npaydown\nof the loan and a $3.1 million personal guarantee.\nThrough the paydown, BLDG was able to hit a debt yield hurdle — a means to measure asset health by weighing revenue against the loan amount. The $3 million served as an extra cushion if income slipped.\nAny time an asset transfers to special servicing, it typically receives an updated appraisal.\nThe resort’s facelift, which is ongoing, likely drove the value bump. Gurney’s soft-launched The Dune Café &amp; Lounge earlier this winter, according to the\nNew York Post\n. Two other restaurants, Gigi’s Montauk and Gigi’s Café, are set to open this spring, according to\nDan’s Papers\n.\nWhen BLDG and partner Metrovest Equities bought Gurney’s in 2014, the team pumped $54 million into refreshing guest rooms, common areas, amenities and restaurants and building out a $16.4 million spa that draws on ocean water to fill a full-size swimming pool.\n",
    "related_links": [
      "https://therealdeal.com/new-york/tristate/2022/03/15/the-hamptons-hotel-that-conquered-covid/",
      "https://therealdeal.com/new-york/tristate/2025/01/21/lloyd-goldman-defaults-on-217m-montauk-resort-loan/",
      "https://therealdeal.com/new-york/tristate/2025/02/21/lloyd-goldman-extends-gurneys-montauk-loan/",
      "https://nypost.com/2025/02/06/business/gurneys-montauk-reopens-following-renovations-prepares-to-launch-new-restaurant/",
      "https://www.danspapers.com/2024/12/gurneys-montauk-closed-until-february/",
      "https://therealdeal.com/new-york/tristate/2025/01/21/lloyd-goldman-defaults-on-217m-montauk-resort-loan/",
      "https://therealdeal.com/new-york/tristate/2025/02/21/lloyd-goldman-extends-gurneys-montauk-loan/",
      "https://therealdeal.com/new-york/tristate/2022/03/15/the-hamptons-hotel-that-conquered-covid/"
    ],
    "market": "New York",
    "published": "Thu, 20 Mar 2025 15:02:28 +0000",
    "published_dt": "2025-03-20T15:02:28+00:00",
    "author": "Suzannah Cavanaugh"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/20/map-of-canceled-delayed-south-florida-office-projects/",
    "title": "Map: Here are South Florida’s canceled or delayed office projects",
    "subhead": "Some developers couldn’t get enough preleasing, others nixed plans due to tariffs",
    "authors": "ByLidia Dinkova",
    "pub_date": "Mar 20, 2025, 10:30 AM",
    "pub_date_dt": "2025-03-20T10:30:00",
    "content": "In recent years, South Florida’s office market appeared resilient to financial woes experienced elsewhere in the U.S. Major companies leased across the tri-county region, making brokers giddy. Developers announced plans for new South Florida office projects, offering flashy renderings.\nYet by now, some of these projects are canceled or paused. The progress and success of others remain in doubt due to a lack of preleasing.\nThe market “was a little bit bullish early on because you saw so many companies coming into town, lots of law firms, lots of financial firms,” said Lisa Colon, a real estate development attorney at Saul Ewing. “That has definitely slowed a little bit … lenders are just requiring more.”\nIndeed, while companies never preleased office space years in advance in South Florida before, this has changed. Financiers generally want to see 30 percent to 40 percent of space preleased before providing a loan for a large project. Brokers said they are seeing a revival of demand in the past three months, which they attribute to the end of uncertainty after the presidential election. But most tenants are looking for small to medium-sized offices and not big headquarter spaces, meaning the uptick in demand isn’t enough to secure the preleasing necessary for major office projects.\n“The majority of the demand I am seeing right now is 5,000 square feet to 10,000 square feet or less,” said Cyril Bijaoui of Longstead at Corcoran. “And that’s why it’s more entry level sort of sizes, and to lease-up a mega floor plate [project], especially prelease it, that’s tough.”\nThe Real Deal’s\nanalysis of the status of office projects proposed from 2021 to 2023 shows that the larger towers are either canceled or paused. One developer put an office project on hold to focus on a smaller one.\nSkyrocketing insurance and elevated interest rates have also played a role. Although the Federal Reserve lowered the benchmark rate three times last year, after 11 aggressive hikes in 2022 and 2023, hopes for more decreases this year are dwindling. The Secured Overnight Financing Rate remains at over 4 percent, though developers tend to pay more than this to cover lenders’ spread.\nPlus, the Trump administration’s tariffs on Canada and Mexico, as well as its deportation policies also are expected to boost construction costs. The U.S. construction industry procures most of its lumber from Canada and aluminum and steel from Canada and Mexico, according to Colon.\nHere are the South Florida\noffice\nprojects that developers are canceling and pausing, as well as those that remain in question.\nOne Brickell City Centre\nIn 2022, Swire Properties and Related Companies revealed plans for One Brickell City Centre supertall, marking likely the biggest office project ever envisioned for Miami.\nThe roughly 1,000-foot tall tower would have 1.4 million square feet of offices, with floor plates ranging from 40,000 square feet on upper floors to 60,000 square feet on lower floors. It was slated to rise at Swire’s Brickell City Centre mixed use complex.\nBut in January, Swire nixed One Brickell City Centre, with President Henry Bott\ntelling\nBloomberg “the pre-leasing for that specific scheme has not materialized in the way that we had hoped.” (Related wasn’t involved in the project by then.)\nTo meet lenders’ pre-leasing requirements, the developer would have had to secure tenants for 420,000 square feet to 560,000 square feet of the space before securing construction financing.\nWhile interest in One Brickell City Centre was strong, demand ultimately didn’t meet the needed threshold, according to a source familiar with the project.\nThe 2.8-acre site at 700 Brickell Avenue and 799 Brickell Plaza is for sale. An asking price hasn’t been disclosed.\nGateway Group’s Mid-Beach offices\nLast year, the Giller family jumped on Miami Beach’s office trend with plans for a seven-story building near Mount Sinai Medical Center.\nThe seven-story building at 976 Arthur Godfrey Road and 3915-3925 Alton Road would have had 28,200 square feet of offices on the top three levels. The family’s Gateway Group was betting on both new-to-market and longtime South Florida tenants, as well as medical office demand, Ira Giller said last year.\nConstruction was supposed to start in January. Instead, the Gillers\nsold the site\nlast month.\nThey had budgeted for elevated interest rates and other economic headwinds. But once the Trump administration imposed tariffs and deportation policies, the equation changed, Giller said.\n“\nThat would have a direct impact on the cost of construction. We bring in a lot of construction materials from Canada and Mexico [such as] steel and aluminum,” he said. “My assessment of my cost to build didn’t take into account the implementation of those elements. With 20 [percent] to 30 percent of tariffs and [deporting] 10 million people in labor, I felt like costs were going to go up significantly.”\nOne Thousand Group’s office-to-condos switcheroo\nOne Thousand Group –– led by Louis Birdman, Kevin Venger and Michael Konig\n––\nproposed a 47-story tower with 312,000 square feet of offices in Miami’s Edgewater in 2023.\nIn December, One Thousand Group paid\n$53 million\nfor the 1.6-acre development site at 3601 Biscayne Boulevard and 345 and 409 Northeast 36th Street.\nYet, this time its plans are for a mixed-use branded condo tower with a helipad.\nThe move is in line with South Florida market trends. Last year, offices already experienced less interest from out-of-state firms, more\nsublease availability\nand higher interest rates, prompting some tenants to pause leasing plans. The condo market remains more resilient, with demand from out-of-state buyers continuing.\n\nIn a statement, Venger said One Thousand Group didn’t switch to condos due to any issues with Miami’s office market, arguing the asset class “remains strong.”\nThe development firm “still considers office use within its commercial programming [at the tower], but with tenants re-leasing close to lease end, preleasing is limited,” Venger said.\nOne Thousand Group is best known for completing the Zaha Hadid-designed\nOne Thousand Museum\ncondo tower at 1000 Biscayne Boulevard in downtown Miami.\nAbbhi Capital hits brakes on Miami Worldcenter offices\nIn 2023, Abbhi Capital wanted to bring offices to the massive Miami Worldcenter mixed-use complex, mostly home to condos, apartments and retail.\nThe Coral Gables-based firm proposed a 33-story tower with nearly 370,000 square feet of offices, as part of a larger project that included a 59-story, 558-unit residential building.\nPlans are currently on hold, according to a source familiar with the project, declining to elaborate on the reason.\nGoldman’s Core Wynwood\nGoldman Properties’ Core was supposed to be an eight-story building with 99,400 square feet of offices in Miami’s Wynwood.\nIn 2022, Goldman –– founded by the late Tony Goldman, a pioneer developer in the neighborhood –– scored approval for Core on the 0.6-acre site at 373-391 Northwest 24th Street and 376 and 390 Northwest 25th Street.\nBut construction never started.\n“We are putting it on hold because of rising construction costs and interest rates,” Goldman CEO Scott Srebnick said, adding that Core is paused for about three to five years.\nYet, the firm is still betting on Wynwood’s office market. This year, the city approved Goldman’s five-story 2400 building with 10,000 square feet of retail and 38,000 square feet of offices. It is planned for 2400-2500 Northwest Second Avenue.\nSo how is the 2400 building a better investment now than Core? It will offer smaller suites, ranging from 1,600 square feet to 2,000 square feet, which are in high demand in Wynwood, Srebnick said.\n“Wynwood in particular attracts the entrepreneur, the creative user, the startup. They typically require a smaller office plate,” Srebnick said. It “is very much an entrepreneurial culture with small VCs, small companies, architecture firms, designers.”\nConstruction is expected to start in July, he said.\nBancroft Hotel\nA hotel-to-office conversion on South Beach was first announced in 2021.\nAt the time, Boca Raton-based Pebb Capital, Coconut Grove-based Maxwelle Real Estate Group and Russell Galbut bought the shuttered five-story hotel at 1501 Collins Avenue and a building next door for $47 million from a Galbut affiliate. They announced plans to convert about half the 100,000-square-foot hotel into offices.\nThe project is paused, with other development options under review, Pebb said in a statement.\nKey International’s 848 Brickell\nThe\nArdid family’s\nKey International seized on Brickell’s office boom in 2023 with a proposal for a 51-story, 750,000-square-foot office tower.\nThe project, called 848 Brickell, would replace Key International’s existing 13-story office building on the site at 848 Brickell Avenue in Miami. The firm has its headquarters there.\nKey International, founded by patriarch Jose Ardid and led by his sons, Inigo and Diego Ardid, didn’t immediately return a request for comment. The firm hasn’t formally canceled or announced delays of the project.\nThe Ardids aim to prelease 40 percent to 50 percent of space before pursuing construction financing, Inigo and Diego Ardid told\nTRD\nlast year.\nThe plans also come as Santander Bank and billionaire Ken Griffin pursue their own office towers in Brickell. While most of the space in each will be owner occupied, they also may offer space for lease, posing competition for 848 Brickell, amid less activity from out-of-state firms.\nSantander plans to convert its 14-story building at 1401 Brickell Avenue into a\n41-story tower\nwith about 800,000 square feet of offices. The Spanish bank has its offices at the existing building and will occupy part of the space in the new building.\nGriffin\nfiled plans\nlast summer for a supertall that will serve as headquarters for his Citadel and Citadel Securities. The tower at 1201 Brickell Bay Drive, 1221 Brickell Avenue and 1250-1260 Brickell Bay Drive also will have a luxury hotel, retail and restaurants.",
    "related_links": [
      "https://therealdeal.com/tag/south-florida-office-market/",
      "https://therealdeal.com/miami/2025/01/27/swire-nixes-one-brickell-city-centre-office-supertall/",
      "https://www.bloomberg.com/news/articles/2025-01-27/supertall-miami-tower-scrapped-in-a-sign-of-weaker-office-demand?utm_medium=email&utm_source=author_alert&utm_term=250127&utm_campaign=author_20216875",
      "https://therealdeal.com/miami/2024/06/05/ira-giller-planning-miami-beach-mixed-use-project/",
      "https://therealdeal.com/miami/2025/02/04/jewelers-assembling-land-buy-ira-gillers-miami-beach-site/",
      "https://therealdeal.com/miami/2023/10/17/one-thousand-group-proposes-edgewater-office-tower/",
      "https://therealdeal.com/miami/2024/12/10/one-thousand-group-pays-53m-for-site-in-miamis-edgewater/",
      "https://therealdeal.com/miami/2023/07/07/resilient-office-market-not-quite-south-florida-sublease-availability-soars/",
      "https://therealdeal.com/tag/one-thousand-museum/",
      "https://therealdeal.com/miami/2023/09/19/abbhi-capital-plans-resi-office-project-at-miami-worldcenter/",
      "https://therealdeal.com/miami/2022/06/09/goldman-properties-jv-of-scott-robins-and-philip-levine-propose-wynwood-projects/",
      "https://therealdeal.com/miami/2021/09/07/jv-plans-high-end-offices-at-old-bancroft-hotel-in-south-beach/",
      "https://therealdeal.com/miami/2023/08/09/ardids-key-international-proposes-brickell-office-tower/",
      "https://therealdeal.com/magazine/march-2024/inigo-and-diego-ardid-banking-on-brickell-office-tower/",
      "https://therealdeal.com/miami/2024/02/16/banco-santander-proposes-40-story-brickell-office-tower/",
      "https://therealdeal.com/miami/2024/07/24/billionaire-ken-griffin-submits-plans-for-miami-supertall/"
    ],
    "market": "South Florida",
    "published": "Thu, 20 Mar 2025 14:30:00 +0000",
    "published_dt": "2025-03-20T14:30:00+00:00",
    "author": "Lidia Dinkova"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/20/broward-county-weekly-condo-report-23/",
    "title": "Adagio closing tops Broward weekly condo sales",
    "subhead": "Top 10 sales ranged from $670K to $3.1M",
    "authors": "ByKate HinscheResearch byAdam Farence",
    "pub_date": "Mar 20, 2025, 9:45 AM",
    "pub_date_dt": "2025-03-20T09:45:00",
    "content": "Broward County’s condo dollar volume fell in the second week of March.\nBrokers closed 132 condo sales totaling $42.7 million from Mar. 9 to Mar. 16. The previous week, brokers closed 128 condo sales totaling\n$46 million\n.\nLast week’s units sold for an average of $323,436, lower than the $359,456 average price from the previous week. The average price per square foot fell to $283 from $289, according to data from Redfin.\nFor the top 10 sales, prices ranged from $670,000 to $3.1 million.\nUnit 501 at Adagio Fort Lauderdale Beach, at 435 Bayshore Drive in Fort Lauderdale, took the top spot with a $3.1 million closing. The sale closed at $1,292 per square foot after 149 days on market.\nGrace Appleton with Coldwell Banker Realty had the listing, and Elaine Tatum with Douglas Elliman represented the buyer.\nUnit 2507 at Las Olas Beach Club, at 101 South Fort Lauderdale Beach Boulevard in Fort Lauderdale, closed for the second highest amount, $1.6 million, or $840 per square foot after 57 days on market.\nSandy Sonkin with Keller Williams Realty Professionals had the listing, and Gianpierre Giusti with Coldwell Banker Realty brought the buyer.\nHere’s a breakdown of the top 10 sales from Mar. 9 to Mar. 16:\nMost Expensive\n\nAdagio Fort Lauderdale Beach, 435 Bayshore Drive, unit 501, in Fort Lauderdale | Price: $3,100,000 | $1,292 psf | Listing agent: Grace Appleton with Coldwell Banker Realty | Buyer’s agent: Elaine Tatum with Douglas Elliman\nLeast Expensive\nFountainhead, 3900 North Ocean Drive, unit 4E, in Fort Lauderdale | Price: $670,000 | $364 psf | Listing agent: Marlene Katkin with Compass | Buyer’s agent: Helene Cohen with Galt Ocean Realty\nHighest Price Per Square Foot\nAdagio Fort Lauderdale Beach, 435 Bayshore Drive, unit 501, in Fort Lauderdale | Price: $3,100,000 | $1,292 psf | Listing agent: Grace Appleton with Coldwell Banker Realty | Buyer’s agent: Elaine Tatum with Douglas Elliman\nLowest Price Per Square Foot\nFountainhead, 3900 North Ocean Drive, unit 4E, in Fort Lauderdale | Price: $670,000 | $364 psf | Listing agent: Marlene Katkin with Compass | Buyer’s agent: Helene Cohen with Galt Ocean Realty",
    "related_links": [
      "https://therealdeal.com/miami/2025/03/13/broward-county-weekly-condo-report-22/"
    ],
    "market": "South Florida",
    "published": "Thu, 20 Mar 2025 13:45:00 +0000",
    "published_dt": "2025-03-20T13:45:00+00:00",
    "author": "Kate Hinsche, Adam Farence"
  },
  {
    "url": "https://therealdeal.com/new-york/tristate/2025/03/20/elliman-honors-top-hamptons-long-island-agents/",
    "title": "Elliman doles 2025 Ellie awards to top Hamptons, Long Island agents",
    "subhead": "Thomas Cavallo, Enzo Morabito Team nab 2025 Ellies",
    "authors": "BySheridan Wall",
    "pub_date": "Mar 20, 2025, 8:00 AM",
    "pub_date_dt": "2025-03-20T08:00:00",
    "content": "Douglas Elliman honored its top-performing brokers Out East before the summer crowds descend on their turf.\nThe firm announced the winners of its annual Ellie awards on Wednesday, with veteran recipients returning to the top spots on Long Island’s East End. Brokers in the Hamptons\njoined others\nin markets across the country tapped for accolades based on their sales volume, number of transactions and gross commission income in 2024.\nDouglas Elliman claimed the title of the top brokerage in the Hamptons in\nThe Real Deal’s\nlatest ranking\n. The brokerage closed nearly $1.5 billion in sales across more than 430 deals between June 2023 and June 2024.\n“I am incredibly proud of this continued success,” Todd Bourgard, head of Elliman’s operations across Long Island, wrote in a statement.\nThomas Cavallo took home the prize for the most sales and commissions earned last year by an individual agent. Though the Sag Harbor-based broker didn’t land the leading post in 2023, has\npreviously ranked\namong the firm’s top producers in the region.\nSecond place went to Martha Gundersen, who was one of the three top finishers in the categories last year. Gundersen, alongside the No. 3 agent by GCI and sales volume Paul Brennan, was the listing agent for an East Hampton property that landed among the\ntop 10 most expensive\ndeals in the hamlet in 2024. The mansion at 253 Cove Hollow Road sold for $19.2 million.\n\nGundersen placed 17th among\nTRD’s ranking\nof the top-producing agents and teams in the Hamptons between June 2023 and June 2024 with nearly $91 million in sales.\nKristy Naddell on the North Fork closed the highest number of transactions for the fourth consecutive year.\nThe Enzo Morabito Team scored the No. 1 spot by sales volume, transactions and GCI. The team also snagged fourth place in\nTRD’s\nlatest ranking with roughly $150 million in sales across 46 deals.\nAlso notable among the teams honored in the Ellies was Noble Black &amp; Partners, who landed among the 10 groups with the largest sales volume last year. The cohort, which was the No. 2 megateam companywide, only officially\nexpanded to the Hamptons\nin May.\nOn the rest of Long Island, Maggie Keats was the top agent by GCI and sales volume, while Barbara Leogrande was the No. 1 in transactions. The Maria Babaev Team was the top-producing team by GCI and sales volume, with the Lina Lopes Team notching the highest number of transactions.\nThis article has been updated to correct the name of Todd Bourgard, head of Elliman’s operations across Long Island.\n",
    "related_links": [
      "https://therealdeal.com/new-york/2025/03/19/elliman-celebrates-top-nyc-agents-in-2025-ellies/",
      "https://therealdeal.com/magazine/august-2024/hamptonss-legacy-residential-brokerages-hang-on-to-the-top/",
      "https://therealdeal.com/new-york/tristate/2020/03/06/enzo-morabito-team-scores-hamptons-honor-at-douglas-ellimans-internal-awards-ceremony/",
      "https://therealdeal.com/new-york/tristate/2024/12/13/the-top-10-hamptons-residential-sales-of-2024/",
      "https://therealdeal.com/magazine/september-2024/top-dealmakers-go-big-game-fishing-in-the-hamptons/",
      "https://therealdeal.com/new-york/tristate/2024/05/16/top-douglas-elliman-team-moves-to-the-hamptons/",
      "https://therealdeal.com/national/2025/03/11/elliman-closed-bumpy-2024-with-narrowed-losses/",
      "https://therealdeal.com/new-york/2025/03/19/elliman-celebrates-top-nyc-agents-in-2025-ellies/",
      "https://therealdeal.com/magazine/september-2024/top-dealmakers-go-big-game-fishing-in-the-hamptons/"
    ],
    "market": "New York",
    "published": "Thu, 20 Mar 2025 12:00:00 +0000",
    "published_dt": "2025-03-20T12:00:00+00:00",
    "author": "Sheridan Wall"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/20/new-york-citys-top-cre-loans-of-february-2025/",
    "title": "What office meltdown? Three Midtown landlords score 10-figure CMBS deals",
    "subhead": "Bond issuances surged in February, signaling strong lending market",
    "authors": "ByElizabeth CryanResearch byMatthew Elo",
    "pub_date": "Mar 20, 2025, 8:00 AM",
    "pub_date_dt": "2025-03-20T08:00:00",
    "content": "A trio of Manhattan office buildings scored 10-figure CMBS deals in February, another sign of a post-pandemic recovery for trophy commercial properties.\nThe blockbuster refinancings come amid an overall surge in issuance of commercial mortgage-backed securities. CMBS issuances totaled $18.3 billion nationwide last month, more than double January’s total of $7.9 billion, according to KBRA. That’s up 196 percent year-over-year, and the bond ratings association predicted “no likely slowdown on the horizon.”\nThe CMBS market is often considered a bellwether for the overall lending market and the broader commercial real estate market.\nIrvine Company’s famed\nMetLife Building\nlanded the largest CMBS deal, a $1.5 billion loan issued by Bank of America and Wells Fargo.\nAnd Aby Rosen’s RFR Holding got some good news for a change, scoring a $1.2 billion refinancing of the\nSeagram Building\n.\nIvanhoé Cambridge’s trophy office tower,\n3 Bryant Park\n, grabbed another massive $1.1 billion CMBS loan.\n“The volumes have been fantastic,” Trepp’s Stephen Buschbom said of bond issuance on The TreppWire podcast. “I’m looking ahead at what’s scheduled into April and we’re just a stone’s throw from hitting $35 billion.”\nThe Real Deal\nbroke down February’s five largest loans in Manhattan and the top five in the outer boroughs:\nNew life for MetLife | $1.5B | Midtown\nBank of America and Wells Fargo\noriginated a $1.5 billion CMBS loan for the Irvine Company’s famed MetLife Building. The loan carries an interest rate of 6.25 percent over 10 years, a sizable jump from the 3.6 percent interest rate Donald Bren’s firm previously faced. The debt-serving costs will double to approximately $100 million a year. The 58-story, 3 million-square-foot building is 94 percent occupied and generates $170 million in net operating income. Ownership, which included Tishman Speyer until it was bought out last year for an unknown price, has invested $180 million in the property dating back to the year before the pandemic.\nRosen refi | $1.2B | Midtown\nMorgan Stanley, Citi Real Estate Funding and JPMorgan Chase\noriginated a $1.2 billion CMBS loan to refinance RFR Holding’s Seagram Building at 375 Park Avenue. The four-year, fixed-rate loan will carry a 6.25 percent interest rate, nearly double the 3.53 percent rate on the existing debt, according to Morningstar Credit. The refinancing package retires $1.15 billion in existing debt, utilizing $24.6 million from existing reserves to complete the payment. The loan structure will fund significant reserves, including a $26 million escrow for contractual free rent and $21.3 million for outstanding landlord obligations. Newmark recently appraised the 38-story, 860,000-square-foot property at more than $1.8 billion. The trophy office tower boasts a 96 percent occupancy rate.\nBryant Park boon | $1.1B | Midtown\nWells Fargo, Bank of America and Bank of Montreal\nprovided a $1.13 billion CMBS loan for Ivanhoé Cambridge’s trophy office tower, 3 Bryant Park. The loan for the 1.2-million-square-foot tower at 1095 Sixth Avenue — located between West 41st and 42nd streets — replaces a CMBS loan\nof the same amount.\nThe fresh financing is an encouraging sign for the Canadian investor, which has\nalmost $5 billion worth of loans\nset to mature in the next year. The real estate arm of Quebec’s $300 billion pension fund tore through U.S. cities over the past decade, paying top dollar to buy top-tier properties.\n\nPark Avenue payday | $500M | Midtown\nCiti Group and JPMorgan\nprovided a $500 million loan to refinance Fisher Brothers’\n299 Park Avenue\n. The fresh financing replaces a $325 million loan from a group of lenders. The landlord recently spent $20 million on a capital improvement project at the 42-story, 1.2 million-square-foot tower, which is 95 percent leased. Capital One and UBS combine to take up 30 percent of the rentable square footage in the building and are in place through 2031. Lease expirations are minimal for the next few years.\nWall Street windfall | $275M | Financial District\nApollo Global Management\nprovided a $275 million loan for\nRockpoint and Brooksville Company’s\nresidential tower at 63-67 Wall Street. The two buildings are converted offices with more than 800 total units. The partners purchased the adjacent buildings from DTH Capital and Metro Loft Management in 2016 for $421.5 million, utilizing a\n$280 million loan\nfrom Wells Fargo. Since then, ownership has renovated the properties, upgrading common areas and amenity spaces.\nLogistics loot | $235M | Maspeth\nNew York Life Insurance Company\nprovided a $235 million loan for RXR Realty and LBA Logistics’ vertical warehouse at\n55-15 Grand Avenue\nin Maspeth, Queens. The fresh financing replaces a $316 million loan from JPMorgan Chase.  The partners\nspent $72 million in January 2018 on parcels\nfor the\nfive-story warehouse\nand\nAmazon agreed to lease the space\nfor its network of last-mile delivery warehouses.\nStorage swag  | $143M | Long Island City\nBank of Montreal\nprovided a $143 million loan to Storage Deluxe for two industrial buildings on 21st and 22nd streets in Long Island City, Queens. The fresh financing replaces an $87 million CMBS loan. The properties at 41-45 21st Street and 41-54 22nd Street span a total of 277,601 square feet.\nRabsky refi | $140M | Fort Greene\nMadison Realty Capital\nprovided a $140 million loan for Rabsky Group’s nearly-completed residential tower at\n240 Willoughby Street\n. The\nsecretive developer led by Simon Dushinsky\nis building a 30-story, 300-unit multifamily building near Fort Greene Park. It also plans to renovate an existing 21-story apartment project with 189 units. Rabsky secured a $72 million construction loan in 2022 from SCALE, the lending arm of Slate Property Group.\nFlatbush funds | $98M | Park Slope, Prospect Heights\nDerby Copeland Capital\nprovided a $98 million loan to Ed and Michael Ostad for their purchase of\na large portfolio of properties\nalong Flatbush Avenue. The Ostads bought the 26-building portfolio of mixed-use properties from Brooklyn’s Pintchik family for $102.5 million.\nShelling out cash | $75M | Coney Island\nGoldman Sachs\nprovided a $74.8 million loan for Elie Fouerti’s multifamily development at 2971 Shell Road in Coney Island. Fouerti Realty and Rybak Development wrapped up construction last year on the eight-story, 189-unit rental building, according to\nNew York YIMBY\n. The fresh financing replaced a $74.8 million construction loan from Popular Bank.",
    "related_links": [
      "https://therealdeal.com/new-york/2025/02/05/irvine-closing-in-on-1-5b-refinancing-of-metlife-building/",
      "https://therealdeal.com/new-york/2025/02/13/aby-rosen-nears-1-2b-refi-of-seagram-building/",
      "https://therealdeal.com/new-york/2025/02/10/ivanhoe-cambridge-lands-1-1b-refi-at-midtown-office-tower/",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025021101096003",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025022500581004",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025021200649002",
      "https://therealdeal.com/new-york/2015/01/16/ivanhoe-cambridge-closes-on-2-2b-acquisition-of-1095-sixth/",
      "https://therealdeal.com/new-york/2024/07/09/ivanhoe-cambridge-has-office-exposure/",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025021200466008",
      "https://therealdeal.com/new-york/2025/02/11/fisher-brothers-finagle-500m-refi-of-299-park-avenue/",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025020500118006",
      "https://therealdeal.com/new-york/2025/03/04/rockpoint-brooksville-refinance-wall-street-rentals/",
      "https://therealdeal.com/new-york/2016/10/17/rockpoint-lands-280m-wells-fargo-loan-to-buy-two-wall-street-rental-towers/",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025013000493005",
      "https://therealdeal.com/new-york/2020/12/03/lba-lands-316m-loan-for-amazon-warehouse-in-maspeth/",
      "https://therealdeal.com/new-york/2018/03/20/rxr-partners-with-california-firm-to-buy-queens-dev-sites/",
      "https://therealdeal.com/new-york/2020/06/08/amazons-future-queens-warehouse-robert-deniros-film-studio-among-top-nyc-projects/",
      "https://nypost.com/2020/06/23/amazon-signs-lease-for-nycs-biggest-ever-warehouse-report/",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025020500816005",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025022400810004",
      "https://therealdeal.com/new-york/2022/01/05/scale-lends-rabsky-75m-for-fort-greene-multifamily-dev/",
      "https://therealdeal.com/issues_articles/the-rabsky-riddle/",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025013000246011",
      "https://therealdeal.com/new-york/2025/01/10/pintchik-family-sells-100m-prospect-heights-portfolio/",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025022500087004",
      "https://newyorkyimby.com/2024/05/the-bay-nears-completion-at-2971-shell-road-in-coney-island-brooklyn.html"
    ],
    "market": "New York",
    "published": "Thu, 20 Mar 2025 12:00:00 +0000",
    "published_dt": "2025-03-20T12:00:00+00:00",
    "author": "Elizabeth Cryan, Matthew Elo"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/20/city-to-rezone-jamaica-queens/",
    "title": "The Daily Dirt: Next up, rezoning Jamaica",
    "subhead": "City to certify plan to build 12K-plus homes",
    "authors": "ByKathryn Brenzel",
    "pub_date": "Mar 20, 2025, 7:30 AM",
    "pub_date_dt": "2025-03-20T07:30:00",
    "content": "The city is gearing up for a rezoning that could bring 12,000 homes to Jamaica, Queens.\nWith nine months left of the first (and possibly last) term of the Adams administration, one neighborhood rezoning is on the cusp of being approved by the City Council, one just started public review and another is about to do the same on Thursday.\nCity Planning will certify the plan to rezone a swath of Jamaica to allow for the construction of more than 12,000 homes in the Queens neighborhood, of which 4,000 would be income-restricted through the city’s Mandatory Inclusionary Housing program. In fact, this would be the largest MIH area ever mapped, according to City Planning. The administration also projects that the rezoning could net 2 million square feet of commercial space.\nThe certification kickstarts the monthslong land use review process, known as the Uniform Land Use Review Procedure. The plan covers more than 300 blocks in and around Downtown Jamaica and will ultimately need buy-in from local Council members Nantasha Williams and James Gennaro, as well as City Council Speaker Adrienne Adams, all of whose districts will be affected by the rezoning.\nHere’s a quick recap of where the Adams administration’s neighborhood rezonings stand:\n— The\nAtlantic Avenue rezoning\nis in the home stretch. On Wednesday, City Planning approved the plan, affecting a 21-block stretch in Central Brooklyn, which the city expects 4,600 new homes will be built. The plan now heads to the City Council.\n— In August, the City Council\napproved\nthe rezoning of 46 blocks in the Bronx, where a projected 7,000 homes are expected to be built over the next 10 years.\n— City Planning\nkicked off public review\nof the Midtown South rezoning in January, which would bring 9,700 units to the area.\n— The city released a draft for the planned Long Island City rezoning\nlast June\n, which could create 14,000 units.\nOf course the unit projections depend on developers having the appetite to build said units. Right now, the environment for ground-up development isn’t, shall we say, great. Developers have bemoaned interest rates, high construction costs, the threat of tariffs and the wage requirements for projects looking to receive the property tax break 485x.\nWhat we’re thinking abou\nt: What would it take for one of the mayoral candidates to overtake Andrew Cuomo as the presumptive frontrunner before the June primary? Send a note to\nkathryn@therealdeal.com\n.\nA thing we’ve learned:\nJamaica, Queens, is named after… beavers? The neighborhood is not named after the Caribbean island but is believed to instead derive from “jameco,” the Algonquin word for “beaver,”\naccording to the New York Times\n.\n\nElsewhere in New York…\n—\nA fourth person in New York has been diagnosed with measles, Gov. Kathy Hochul confirmed on Wednesday. About 81 percent of 2-year-olds in New York have received their first dose of the MMR vaccine, despite federal recommendations that children get the shot between 12 and 15 months old,\nGothamist reports\n. Three of the confirmed cases were in NYC, with one reported out of Suffolk County.\n—\nIt is the end of an era. The MTA will stop selling MetroCards at the end of the year\n,\nthe New York Times reports\n.\n— Former First Deputy Mayor Maria-Torres Springer has a new gig,\nCity &amp; State reports\n. She is starting a fellowship at the Ford Foundation.\nClosing Time\nResidential:\nThe priciest residential sale Wednesday was\n$6 million\nfor a 1,264-square-foot, sponsor-sale condominium unit at 685 Fifth Avenue in the Plaza District. McKenzie Ryan, Jade Chan and Alexander Boriskin of Douglas Elliman\nhad the listing\n.\nCommercial:\nThe most expensive commercial closing of the day was\n$68.5 million\nfor a 92,722-square-foot, 105-unit apartment building at 237 11th Street in Park Slope. Davidson Kempner sold the property to Living, N.Y.\nNew to the Market:\nThe highest price for a residential property hitting the market was\n$18.7 million\nfor a 3,851-square-foot condo at 33 East 74th Street in Lenox Hill. Kevin B. Brown and Craig George of Sotheby’s International Realty have the listing.\nBreaking Ground:\nThe largest new building application filed was for a 60,702-square-foot, five-story school building at 1472 Boston Road in Crotona Park East. Matthew McChesney of KSS Architects filed the permit on behalf of Civic Builders.\n— Matthew Elo",
    "related_links": [
      "https://therealdeal.com/new-york/2024/10/15/city-planning-begins-atlantic-avenue-rezoning/",
      "https://therealdeal.com/new-york/2024/08/15/city-council-approves-bronx-rezoning/",
      "https://therealdeal.com/new-york/2024/11/01/new-york-city-to-supersize-midtown-rezoning/",
      "https://www.nyc.gov/site/planning/about/press-releases/pr-20240625.page",
      "mailto:kathryn@therealdeal.com",
      "https://www.nytimes.com/2014/07/06/nyregion/what-is-jamaica-queens-named-after.html",
      "https://gothamist.com/news/4th-measles-case-confirmed-in-ny-gov-hochul-asks-for-help-promoting-vaccination",
      "https://www.nytimes.com/2025/03/19/nyregion/nyc-subway-metro-card.html",
      "https://www.cityandstateny.com/politics/2025/03/maria-torres-springer-has-new-job/403902/?oref=csny-homepage-river",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025020400526001",
      "https://www.elliman.com/newyorkcity/sales/detail/527-l-552-17_23126494/685-fifth-ave-12a-midtown-east-new-york-ny-10022",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025031800959001",
      "https://www.sothebysrealty.com/eng/sales/detail/180-l-1182-z54ctn/33-east-74th-street-5a-upper-east-side-new-york-ny-10021"
    ],
    "market": "New York",
    "published": "Thu, 20 Mar 2025 11:30:00 +0000",
    "published_dt": "2025-03-20T11:30:00+00:00",
    "author": "Kathryn Brenzel"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/20/real-estate-donated-to-these-nyc-mayoral-candidates/",
    "title": "Here’s who real estate is backing in the mayoral race",
    "subhead": "Industry donated to Cuomo, Whitney and others",
    "authors": "ByKathryn Brenzel",
    "pub_date": "Mar 20, 2025, 7:00 AM",
    "pub_date_dt": "2025-03-20T07:00:00",
    "content": "The New York mayoral race is very crowded, and newly released campaign filings show where real estate high-ups are placing their bets.\nAfter much speculation, former Gov. Andrew Cuomo\nlaunched\nhis campaign this month and quickly became the frontrunner. Despite the industry’s complicated relationship with the politician, it was clear that many real estate professionals would back his campaign.\nDonations over the last two months\nbore that out\n.\nRXR Realty CEO Scott Rechler, a longtime supporter of Cuomo, gave Fix the City, a super PAC backing the former governor, $250,000. Rechler also donated $2,100 directly to Cuomo’s campaign, the maximum amount permitted for an individual donor.\nLightstone executives gave the PAC $100,000, and A&amp;E’s Douglas Eisenberg chipped in $125,000. Anthony Scarmucci’s Skybridge Capital threw the PAC $100,000. Scarmucci and his wife also each gave $2,100 to Cuomo’s campaign.\nOther industry donors to Cuomo’s campaign include Cammeby’s Avi Schron, KRE Group’s Jonathan Kushner, Capstone Equities’ Daniel Ghadamian, Ruben Companies’ Andrew and Richard Ruben, Somerset’s Keith Rubenstein, GFP’s Jeff Gural and BFC Partners’ Winthrop Wharton, each giving $2,100.\nNotably, some employees of New York-based title insurance companies also gave to Cuomo,\ndespite the state’s attempts\nto reel in the industry’s practice of wining and dining its clients during his time as governor.\nIn just two weeks, Cuomo raked in a total of $1.5 million, the most of any mayoral candidate (excluding public matching funds). Assembly member Zohran Mamdani raised the second-highest amount, taking in roughly $847,000 between Jan. 12 and March 13. Whitney Tilson received $310,000 during that time, and Comptroller Brad Lander raised nearly $228,000.\nAs for the others: Sen. Zellnor Myrie took in $136,000; Comptroller Scott Stringer, $188,000; Sen. Jessica Ramos, $70,000; and Republican Curtis Sliwa, $76,000 (which is also the total he has raised to date).\nCity Council Speaker Adrienne Adams, who recently jumped into the race and lost out on more than a month of fundraising during this filing period, managed to bring in $128,000 over a few days. Mayor Eric Adams took in a paltry $36,000 over the last two months, though he brushed off the totals raised by his rivals, telling reporters on Monday that “everyone is catching up to me,”\nThe City reported\n.\nThe real estate industry, however, didn’t just donate to Cuomo. Between Jan. 12 and March 13, real estate professionals, including veterans and lesser-known operators, contributed to Democratic mayoral candidates, with a few even throwing money to Sliwa.\nGeorgetown Companies’ Adam Flatto, for example, gave $2,100 to former hedge fund manager Whitney Tilson in January. Flatto was joined by John Zeiler, founder and managing member of Hudson Housing Capital, who donated $1,000 to Tilson’s campaign.\nTilson also drew $400 from GFP Real Estate co-CEO Brian Steinwurtzel and $250 from Cayre Group’s Robert Cayre. Two Trees Managements’ Jed Walentas, who also chairs the Real Estate Board of New York, gave $250 to Tilson, the same amount he donated to Cuomo’s campaign. During the last filing period, Walentas contributed $400 to Sen. Zellnor Myrie.\n\nDespite being one of the top money-raising candidates, Assembly member Mamdani, a democratic socialist who has pledged to freeze rents for tenants living in stabilized apartments, didn’t woo any large real estate donors. Instead, he received small donations, ranging from $5 to $100, from roughly a dozen residential and commercial brokers.\nCity Council Speaker Adrienne Adams officially launched her campaign a week after Cuomo, giving her the shortest time to raise funds. Even with the passage of the Fairness in Apartment Rental Expenses, or FARE Act, the Real Estate Board of New York showed Adams some support in her first fundraising haul.\nREBNY, through the PAC Taxpayers for an Affordable New York, gave Adams $2,100.\n“Adrienne Adams has advanced a pro-growth agenda as Speaker, most notably in her support for City of Yes,” REBNY President Jim Whelan said in a statement. He noted the passage of the broker fee bill, which requires landlords to pay the rental brokers they hire rather than forcing tenants to cover the cost, during her tenure was “deeply disappointing” but said she is an “important voice to the Mayor’s race.” REBNY has\nfiled a lawsuit\nto repeal the law.\nSignature Urban Properties’ Alan Miller gave Adams $400, as did Taconic Partners’ Paul Pariser and Andy Zlotnick. GFP’s Jeffrey Gural donated $250.\nEven if she doesn’t win the primary in June, Adams will continue to serve as City Council Speaker through the end of the year, meaning that she has considerable sway over legislation and land use actions that come before her members.\nSen. Zellnor Myrie was the first of the mayoral candidates to roll out an extensive housing plan, which has earned him\nsome points with developers\n. Haussmann Development founder Josef Goodman gave Myrie $1,800. L+M Development Partners’ Ron Moelis contributed $400, the same amount he donated to Cuomo’s campaign.\nGilbert Winn of Boston-based Winn Companies gave Sen. Jessica Ramos $2,100 in January and then gave the same amount to Cuomo in March. Hudson Companies’ Joe Riggs donated $150 to her campaign, the same amount he gave Comptroller Brad Lander in January.\nLander, meanwhile, received $2,100 from Millennium Partners Management’s Philip Lovett. He also brought in donations from residential agents and nonprofit housing groups.\nBenjamin Companies’ Kenneth Coyle contributed $2,100 to former Comptroller Scott Stringer, and Coldwell Banker kicked in $500.\nCory Zelnik of the commercial brokerage Zelnik &amp; Company gave Republican Curtis Sliwa $250. Marcus &amp; Millichap’s Eric Anton donated $100.\nMayor Eric Adams, meanwhile, only took in a little more than $36,000 over the last two months, with a couple of donations from smaller real estate players. Once a favorite of the industry, some in real estate\nbacked off\ngiving to his campaign after he was\nindicted\nin September.\nThough many candidates have announced what they expect to receive in public matching funds based on this latest filing period, the city’s Campaign Finance Board will determine those amounts on April 15.\n",
    "related_links": [
      "https://therealdeal.com/new-york/2025/03/03/new-york-city-district-council-of-carpenters-endorses-andrew-cuomo/",
      "https://therealdeal.com/new-york/2025/03/19/real-estate-donates-to-andrew-cuomos-mayoral-campaign/",
      "https://therealdeal.com/new-york/2025/03/14/title-insurance-industry-remembers-cuomos-crackdown/",
      "http://thecity.nyc/2025/03/17/matching-funds-haul-andrew-cuomo-zohran-mamdani-adreinne-eric-adams/",
      "https://therealdeal.com/new-york/2025/01/13/rebny-seeks-to-block-fare-act/",
      "https://therealdeal.com/new-york/2025/01/18/real-estate-donates-to-eric-adams-in-a-stream-not-a-flood/",
      "https://therealdeal.com/new-york/2025/01/18/real-estate-donates-to-eric-adams-in-a-stream-not-a-flood/",
      "https://therealdeal.com/new-york/2024/09/26/mayor-eric-adams-indicted-on-corruption-charges/",
      "https://therealdeal.com/new-york/2025/03/19/real-estate-donates-to-andrew-cuomos-mayoral-campaign/",
      "https://therealdeal.com/new-york/2025/03/07/attorney-paul-clement-says-drop-case-against-eric-adams/",
      "https://therealdeal.com/new-york/2025/03/03/new-york-city-district-council-of-carpenters-endorses-andrew-cuomo/"
    ],
    "market": "New York",
    "published": "Thu, 20 Mar 2025 11:00:00 +0000",
    "published_dt": "2025-03-20T11:00:00+00:00",
    "author": "Kathryn Brenzel"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/19/4-years-after-ramans-motion-la-considers-airbnb-crackdown/",
    "title": "4 years after Nithya Raman’s motion, LA considers illegal Airbnb crackdown",
    "subhead": "City Council votes to explore increasing enforcement of home-sharing ordinance, residential hotel rules",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 19, 2025, 8:00 PM",
    "pub_date_dt": "2025-03-19T20:00:00",
    "content": "Four years after Los Angeles Council member Nithya Raman introduced a motion to clear out\nillegal, unregistered Airbnb and other short-term rental operations\n, the city may finally be cracking down.\nThe City Council unanimously voted Tuesday to explore how to increase enforcement of its home-sharing ordinance and residential hotel rules,\nCity News Service reported\n.\nThe council directed city departments to report on how much money and people they would need to take action.\nWhat’s not clear is why it took four years for Los Angeles to consider addressing the problem.\nIn 2021, Raman, a Democrat, introduced a motion seeking to address problems with cracking down on illegal home sharing, which she said were “destabilizing” neighborhoods. It was backed by fellow Democrats — Council member Bob Blumenfield and former Council members Mike Bonin, Paul Koretz and Kevin de León.\nThe reason: illegal home-sharing had ushered in party houses, unauthorized events, and large yoga retreats, clothing boutiques and other commercial ventures, according to Raman. They  also led to violent crime and homicides.\nIllegal home-sharing operations also buck up against legal brick-and-mortar businesses, allowing illegal advantages against tenants who rent commercial storefronts, from yoga studios to banquet halls.\nIllegal rentals “take your neighbors away and they remove affordable and protected rent-stabilized units from the long-term housing market, which is bad for L.A.,” Raman stated in her motion.\nRaman said her constituents have been “particularly impacted.” The Fourth District, which she represents, had the highest volume of both permitted and illegal home-sharing, putting a dent in its quality of life.\n\nSince the Home-Sharing Ordinance took effect in 2019\n, there have been problems with enforcement because of poor communication between departments and weak guardrails against bad landlords, Raman said.\nThe law regulates home-sharing through Airbnb, among other platforms.\n“Good hosts go to extraordinary lengths to ensure they’re in compliance with our laws,” Raman said. “We should reward them and make sure that bad-faith hosts are treated with the appropriate enforcement actions.”\nA property owner with a home of 2,500 to 5,000 square feet who has violated the ordinance would face a $3,000 penalty. Subsequent fines would be doubled.\nThe city may increase fines based on square footage of a rental in use during a violation.\nAmong the proposals to beef up enforcement is a public database for permit and citation information, making it easier to file complaints and submit evidence.\nThe Los Angeles Housing Department requested 18 new positions to help with investigations and issuing citations. As of October, about 300 administrative citations were referred to housing regulators, out of an estimated 7,500 home-sharing violators, according to a report.\nCity officials requested more staff to aid the City Attorney’s Office with hearings and nuisance cases, which could lead to more revenue for enforcement.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.dailynews.com/2022/04/29/la-city-council-seeks-enforcement-against-illegal-short-term-rentals/",
      "https://www.dailynews.com/2025/03/18/la-city-council-will-consider-a-plan-to-boost-enforcement-of-home-sharing-law/",
      "https://www.dailynews.com/2019/10/30/los-angeles-creating-program-for-home-sharing-at-rent-stabilized-units/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2025/02/05/blueground-charged-with-price-gauging-short-term-rentals/",
      "https://therealdeal.com/la/2024/07/18/la-sues-airbnb-influencer-over-short-term-rental-scheme/",
      "https://therealdeal.com/la/2023/02/28/illegal-vacation-rentals-surge-in-los-angeles/"
    ],
    "market": "Los Angeles",
    "published": "Thu, 20 Mar 2025 00:00:00 +0000",
    "published_dt": "2025-03-20T00:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/19/las-azria-estate-returns-to-market-with-39m-ask/",
    "title": "Azria Estate tries again for buyer with $39M ask",
    "subhead": "Holmby Hills estate’s latest list a haircut from $88M high",
    "authors": "ByKari Hamanaka",
    "pub_date": "Mar 19, 2025, 7:30 PM",
    "pub_date_dt": "2025-03-19T19:30:00",
    "content": "A Holmby Hills mansion tied to one of Los Angeles fashion’s most prominent families is back on the market as it tries another price on for size.\nThe Azria Estate at 10250 West Sunset Boulevard, which has been\non and off the market\nfor the better part of a decade, once asked for as much as $88 million. It more recently reentered the Los Angeles real estate market with a $39 million asking price, after last being listed for $55 million in 2023.\nThe re-list comes after seller Lubov Azria, who owned the property with her late husband and BCBG founder Max Azria, placed the home on the auction block last May. Auctioneer Concierge Auctions estimated in the lead up to the sale the starting price could be as much as $38 million.\nLubov Azria did not immediately respond to a request for comment Wednesday on the listing.\nA legal tussle arising after the auction’s close has since stymied any movement on a sale of the property, which even\nJennifer Lopez\nhad been reportedly eyeing in the fall.\nRon Burkle\n, founder of private equity firm Yucaipa Companies, claimed in a Los Angeles Superior Court lawsuit last June that his $30 million offer was the highest bid, but Azria “refused to complete the sale except on additional terms.”\nAaron Gordon, general counsel for Concierge Auctions, confirmed in a declaration filed in court Burkle had the winning bid but did not sign the sale agreement or pay the 12 percent escrow deposit within the two-business-day deadline. The tardiness caused Burkle to be in default.\n\nBurkle is now on the hook to pay a little over $36,000 for Azria’s attorney fees and other lawsuit-related costs, a judge ordered in September. Three months later, Burkle filed to drop his lawsuit.\nWith the legal row out of the way, Azria will now try her hand once again at finding a buyer. She tapped The Beverly Hills Estates’ Branden Williams and Rayni Williams to market the property, which sits on a nearly 3-acre lot.\nThe agents did not respond to a request for comment Wednesday on the re-listing or the new price.\nThe Azria Estate counts a total of 60 rooms, including 14 bedrooms and 25 bathrooms.\nThe sizable property has been used to host Oscar parties, charity gatherings and other events.\nBuilt in 1939, the Paul Williams-designed Colonial consists of a main house and a separate 5,500-square-foot theater and game room. Outdoors is a tennis court, infinity pool, sauna, gardens, team room and greenhouse.\n",
    "related_links": [
      "https://therealdeal.com/la/2022/01/14/label-this-a-bargain-price-cut-on-late-designers-estate/",
      "https://therealdeal.com/la/2024/09/18/j-lo-talks-with-lubov-azria-and-ron-burkle-to-buy-la-mansion/",
      "https://therealdeal.com/la/2024/09/05/azria-estate-at-center-of-ron-burkle-lubov-azria-legal-row/",
      "https://therealdeal.com/la/2024/09/18/j-lo-talks-with-lubov-azria-and-ron-burkle-to-buy-la-mansion/",
      "https://therealdeal.com/la/2024/09/05/azria-estate-at-center-of-ron-burkle-lubov-azria-legal-row/",
      "https://therealdeal.com/la/2022/01/14/label-this-a-bargain-price-cut-on-late-designers-estate/"
    ],
    "market": "Los Angeles",
    "published": "Wed, 19 Mar 2025 23:30:00 +0000",
    "published_dt": "2025-03-19T23:30:00+00:00",
    "author": "Kari Hamanaka"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/19/sixth-street-firm-buys-cut-of-sf-giants-and-mission-rock-development/",
    "title": "Private equity firm scores stake in SF Giants, Mission Rock",
    "subhead": "Sixth Street acquires 10% of team and its 28-acre office and residential development",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 19, 2025, 7:30 PM",
    "pub_date_dt": "2025-03-19T19:30:00",
    "content": "Sixth Street has paid an undisclosed price for a slice of the San Francisco Giants and its 2.7 million-square-foot Mission Rock mixed-use development.\nThe locally based global private equity firm bought a 10 percent stake of the MLB baseball team and the 28-acre office and residential development across from Oracle Park in Mission Bay,\nSportico reported\n.\nTerms of the deal with the Giants and New York-based Tishman Speyer, developers of the waterfront neighborhood, were not disclosed.\nThe Raine Group handled the sale, while PJT Partners advised Sixth Street, which bought equity from a minority partner, an unidentified source told Sportico.\nSportico\nplaced a $4.2 billion value on the Major League Baseball team and its team-related holdings, the fourth highest in the league.\nIt’s more difficult to quantify the value of Mission Rock, being built on a former parking lot for the Giants on land owned by the Port of San Francisco.\nThe developers are completing Mission Rock’s first phase with two office towers, two apartment buildings with 537 units and a waterfront park at a cost of\n$1.5 billion\n, according to the San Francisco Chronicle.\n\nTenants include Visa, which leased 300,000 square feet for its headquarters, the\nGolden Gate Warriors\n,\nBlue Bottle Coffee and Sweet Green\n.\nWhen fully developed, Mission Rock will contain 2.7 million square feet of lab-ready offices, shops and restaurants and up to 1,200 homes, with 8 acres of parks plus a plaza,\naccording to the port\n.\nReal estate has become a primary way for sports teams to leverage their popularity, with mixed-use developments serving as year-round income and ancillary revenue streams, according to Sportico.\nSuch real estate investments have been especially attractive to the private equity firms, now sinking millions into sports team ownership.\nArctos Partners, the most aggressive firm over the last few years, has bought into the Cubs, Red Sox and Dodgers — all of which have significant real estate holdings. Arctos also previously invested in the Giants, according to Sportico.\nSixth Street’s other sports holdings include Legends and NWSL club Bay FC, plus minority investments in the San Antonio Spurs, Real Madrid and FC Barcelona.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.sportico.com/business/team-sales/2025/giants-sixth-street-mission-rock-1234843579/",
      "https://www.sfchronicle.com/sf/article/giants-real-estate-free-agents-20198462.php",
      "https://therealdeal.com/san-francisco/2024/10/17/golden-state-warriors-lease-offices-at-sfs-mission-rock/",
      "https://therealdeal.com/san-francisco/2025/03/11/blue-bottle-sweetgreen-sign-leases-in-sfs-mission-rock/",
      "https://www.sfport.com/projects-programs/mission-rock",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/03/11/blue-bottle-sweetgreen-sign-leases-in-sfs-mission-rock/",
      "https://therealdeal.com/san-francisco/2024/10/17/golden-state-warriors-lease-offices-at-sfs-mission-rock/",
      "https://therealdeal.com/san-francisco/2023/05/01/visa-puts-190k-sf-headquarter-in-san-francisco-on-sublease-market/"
    ],
    "market": "San Francisco",
    "published": "Wed, 19 Mar 2025 23:30:00 +0000",
    "published_dt": "2025-03-19T23:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/19/aquinnah-investment-trust-proposes-hotel-near-obama-center/",
    "title": "Obama center halo attracts South Side hotel proposal",
    "subhead": "Aquinnah Investment Trust submitted plans for 28-story building near presidential library set to open next year",
    "authors": "ByEmma Whalen",
    "pub_date": "Mar 19, 2025, 6:30 PM",
    "pub_date_dt": "2025-03-19T18:30:00",
    "content": "A hotel proposal is popping up amid a wave of development interest around the forthcoming Barack Obama Presidential Center.\nPlans for a 28-story, 250-key hotel were submitted to the City of Chicago by Aquinnah Investment Trust, a little-known investment group, Urbanize Chicago\nreported.\nThe building, designed by Stantec, is proposed for 6402 South Stony Island, a vacant lot near the Obama center on Chicago’s South Side.\nThe proposal includes retail, office, a 5th floor pool deck and a 13th floor amenity deck. To move forward, approvals will be needed from the Chicago Plan Commission, Committee on Zoning, and City Council.\n\nThe area has seen\nan influx of interest from developers and real estate investors\nahead of the presidential center’s planned spring 2026 completion. It has also stoked fears of gentrification in the surrounding Woodlawn Neighborhood.\nNeighborhood leaders have proposed various anti-gentrification efforts in the area, including the Woodlawn Housing Preservation Ordinance. The ordinance established affordability requirements on all rental and for-sale housing developed on city-owned residential land and gave tenants the\nright of first refusal\nwhen a rental property is sold.\nThe right of first refusal is meant to prevent the area’s naturally occurring affordable housing — particularly two- to four-flats — from being replaced with pricey residential developments. The provision requires landlords to notify tenants when they intend to sell and give them time to match the bid of a third-party buyer.\nChicago’s hotel development pipeline has fallen to the lowest level in recent years as construction lending froze up, with fewer than 1,500 rooms under construction in the fourth quarter, CoStar\nreported\n.",
    "related_links": [
      "https://chicago.urbanize.city/post/hotel-tower-development-proposed-6402-s-stony-island",
      "https://therealdeal.com/chicago/2019/11/07/presidential-power-obama-center-attracts-wave-of-multifamily-investors-from-across-us/",
      "https://therealdeal.com/chicago/2025/03/19/chicago-landlords-push-back-on-anti-gentrification-ordinance/",
      "https://www.costar.com/article/1060761240/chicago-hotel-development-pipeline-slows-more-than-national-average"
    ],
    "market": "Chicago",
    "published": "Wed, 19 Mar 2025 22:30:00 +0000",
    "published_dt": "2025-03-19T22:30:00+00:00",
    "author": "Emma Whalen"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/19/san-francisco-no-longer-last-in-return-to-office-rankings/",
    "title": "SF out of last place for first time in RTO race",
    "subhead": "City edges out Chicago, data shows, indicating early signs of improvement in office",
    "authors": "ByEmily Landes",
    "pub_date": "Mar 19, 2025, 6:15 PM",
    "pub_date_dt": "2025-03-19T18:15:00",
    "content": "Second-to-last place isn’t usually something to crow about, but when it comes to San Francisco and return-to-office trends, the small victory could be an indication that the city’s commercial market is past the bottom as well.\nFor the first time since\nPlacer.ai began tracking office visits\nin the early days of the pandemic, San Francisco has bested another major U.S. city in RTO figures. The city had 47.5 percent fewer office visits in February 2025, compared with the pre-Covid month of February 2019, while Chicago saw a 48.5 percent decline in the same time period.\nThe nationwide figure is off 36.3 percent, with top markets like New York and Miami only 17 percent and 20 percent behind their respective 2019 office visits. The figures are based on cell phone data from about 1,000 office buildings across the country, typically about 100 buildings per market, and do not include government properties for privacy and security reasons.\nChicago and San Francisco have been the bottom two markets for RTO while New York City and Miami have been at the top since the location analytics company began tracking office visit data in early 2021, according to R.J. Hottovy, head of analytical research at Placer.ai. The Windy City’s freezing February and the commute-snarling construction on its roadways, along with tech employers pushing more days in office, may have finally lifted San Francisco out of last place, said Hottovy, who is based in Chicago.\n“Congratulations San Francisco!” Hottovy joked of the second-to-last victory. “It’s been a horse race between these two markets for some time now.”\nIn addition, while Placer.ai data shows that RTO appears to be stalling out in many cities, San Francisco is still improving. Nationwide, there was a 6.3 percent drop in office visits in February 2025 compared to February 2024, and only 3.5 percent of that drop can be attributed to last year’s extra day for Leap Year. But San Francisco figures were only down 1 percent, the third-best in the nation after Miami and Boston, which were both at about half a percent below last year. Chicago office visits were down 8.2 percent in that same period.\n“There are green shoots everywhere in San Francisco, and these numbers are an early indication that we are moving in the right direction,” Mayor Daniel Luire, who\nrecently set an April 28 deadline\nfor city workers to be in-office four days a week, told\nThe Real Deal\n. “Our administration is leading by example, and many of our partners in the private sector are on the same page, bringing workers back to the office and kickstarting our downtown recovery.”\n\nSan Francisco Chief Economist Ted Egan cautioned that Placer’s office data “shows a lot of volatility” from month to month, and is just one indicator of RTO strength. But combined with other data points, like increased transit ridership and office demand, it adds up to “good news for the city’s continuing economy recovery,” he said.\nHottovy agreed that he’d like to see a few more months of improved office visit data before he could call the RTO improvement a true trend, but that even this first month out of last place is “encouraging.”\nPopulation numbers have recently started to rise in the city, he said, and\ntech mandates on RTO\nwill continue to have a big impact as well.\n“Maybe there’s some hope,” he said. “Maybe this is the first month of more pronounced recovery in terms of return to office, but it really is too soon to say.”\nThere were 2.2 million square feet of office leased in San Francisco in the first quarter of 2025, according to early data from CBRE, slightly less than the fourth quarter of 2024 but 50 percent higher than the full first quarter of 2024. If San Francisco continues on this leasing trajectory, it will exceed the 8 million square feet leased in all of 2024, according to Colin Yasukochi, executive director of data for CBRE.\nThere were about 5 million square feet of office requirements in the first quarter, which is lower than previous quarters, but represents the highest level of company expansions since the pandemic at just over 20 percent of the total. Almost all of that growth demand is coming from the 30\nAI companies\nwhich are seeking a combined 1 million square feet of office space in the city, Yasukochi said.\nInvestors\ncertainly seem to be betting on San Francisco’s recovery, according to Yardi data. San Francisco was the third-priciest market nationally, with office properties trading at $282 per square foot in the first two months of the year, compared with $177 per square foot nationally and $67 per square foot in Chicago.\n",
    "related_links": [
      "https://therealdeal.com/san-francisco/2025/01/21/employers-call-san-francisco-workers-back-to-the-office/",
      "https://therealdeal.com/san-francisco/2025/02/25/lurie-wants-sf-city-workers-back-4-days-a-week/",
      "https://therealdeal.com/san-francisco/2023/08/21/meta-platforms-tells-workers-to-get-back-at-their-desk/",
      "https://therealdeal.com/san-francisco/2025/03/18/two-ai-companies-sign-on-at-swigs-soma-building/",
      "https://therealdeal.com/san-francisco/2025/01/16/investors-buy-more-offices-in-sf-push-up-average-price/",
      "https://therealdeal.com/san-francisco/2025/02/25/lurie-wants-sf-city-workers-back-4-days-a-week/",
      "https://therealdeal.com/san-francisco/2025/01/21/employers-call-san-francisco-workers-back-to-the-office/",
      "https://therealdeal.com/san-francisco/2025/01/16/investors-buy-more-offices-in-sf-push-up-average-price/"
    ],
    "market": "San Francisco",
    "published": "Wed, 19 Mar 2025 22:15:41 +0000",
    "published_dt": "2025-03-19T22:15:41+00:00",
    "author": "Emily Landes"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/19/altitude-capital-buys-chicago-gold-coast-phantom-building/",
    "title": "Altitude Capital pays $10M for Gold Coast “phantom building”",
    "subhead": "Local developer bought long-vacant condominium in prime location",
    "authors": "ByKelli Duncan",
    "pub_date": "Mar 19, 2025, 6:00 PM",
    "pub_date_dt": "2025-03-19T18:00:00",
    "content": "Altitude Capital Partners has paid $10 million for a Gold Coast building that has long bewildered neighbors as it stood largely unoccupied for almost three decades.\nThe four-story building at 1445 North Dearborn Parkway, dubbed Gold Coast’s\n“phantom building,” has drawn interest from people\nwanting to live in the prime location, but no one has been able to contact the owner.\nAltitude Capital, a Chicago-based development firm, plans to build out the building’s eight condo units with luxury finishes and put them up for sale, Crain’s\nreported\n.\nAs a Gold Coast resident, “I walked my dog past it many times” and wondered about the situation, Altitude Managing Partner Brian Dohmen told the outlet.\nThe 45,000-square-foot courtyard building sold for $222 per square foot, or $1.25 million per unit. It was built in 1901 but was renovated and partially reconstructed in 2010 after part of the building collapsed during a condo conversion. The building has been vacant since then.\n\nThe seller was John Brown, a real estate investor tied to the firms Belden Properties, JAB Properties and Ashton Properties. He has held it since the ’90s, and how much he paid isn’t clear in Cook County property records.\nAt least 60 potential buyers toured the property when it went on the market last fall, and others stopped by to ask questions, Interra’s Colin O’Malley, who represented the seller, told the outlet.\nInterra’s Max Grossman represented Altitude in the deal, which closed March 11.\nThe units range from 2,500 to 5,500 square feet and include two-, three- and four-bedroom condos, with some duplexes. There are also 18 indoor parking spaces on the property that Altitude will offer up with the condos when they go to market.\nAltitude plans to transform the units with finishes and floor plans designed to appeal to wealthy buyers looking to downsize with a Gold Coast home. The condos are set to hit the market in the middle of next year. Dohmen declined to specify price points for the units. The building was previously a 50-room long-term-stay hotel called Dearborn Manor, a name that stuck around until at least the 1950s. Later, it was a 27-unit condo building.\n",
    "related_links": [
      "https://therealdeal.com/chicago/2023/01/25/gold-coast-buildings-decades-long-vacancy-bewilders-neighborhood/",
      "https://www.chicagobusiness.com/residential-real-estate/gold-coasts-long-vacant-phantom-building-sold-10m",
      "https://therealdeal.com/chicago/2023/01/25/gold-coast-buildings-decades-long-vacancy-bewilders-neighborhood/"
    ],
    "market": "Chicago",
    "published": "Wed, 19 Mar 2025 22:00:00 +0000",
    "published_dt": "2025-03-19T22:00:00+00:00",
    "author": "Kelli Duncan"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/19/musk-minion-quits-fannie-mae-board-after-only-one-day/",
    "title": "Musk minion quits Fannie Mae board after one day on the job",
    "subhead": "Christopher Stanley stepped down after he was hired to help replace fired board",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 19, 2025, 6:00 PM",
    "pub_date_dt": "2025-03-19T18:00:00",
    "content": "It took one day for Christopher Stanley, appointed to the Fannie Mae board to help replace members fired by the Trump administration, to say “I quit.”\nStanley, a cybersecurity engineer who has worked for two companies owned by billionaire Elon Musk, resigned from the\nFannie Mae\nboard of directors a day after he was named to the post,\nBloomberg reported\n.\nThe engineer with ties to SpaceX, X and the Department of Government Efficiency led by Musk was\namong eight new appointments\nto Fannie’s board of directors, announced Monday.\nThe reason for Stanley’s sudden bolt to the door isn’t clear.\nThe Federal Housing Finance Agency, under its new director, Bill Pulte, on Monday had fired eight members of the Fannie Mae board and six members of the Freddie Mac board.\nFour new members were appointed to each board, including Pulte, who will chair both boards.\nThe moves came only three days after Pulte was sworn in as director of the FHFA. Donald Trump\ntapped the private equity businessman\nto serve as the nation’s top housing regular two months ago.\n\nFannie Mae and Freddie Mac, which support approximately 70 percent of the country’s mortgage market, have been under government control since the housing bubble burst in 2008. Hedge funds and other investors have called for Uncle Sam to release them from conservatorship, but no action has yet been taken.\nStanley’s participation on the Fannie board would have given the Musk ally a key role in deciding the mortgage giant’s future, according to Bloomberg.\nStanley was hired by executive appointment as a temporary “expert” under the director at the Office of Personnel Management, according to documents obtained by Bloomberg through a Freedom of Information Act request.\nHe has trumpeted his involvement with DOGE on social media, but the specifics of his government role are unclear.\nStanley “returned to the private sector last month,” an unidentified spokesperson from OPM told Bloomberg in an email, providing no further details.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.bloomberg.com/quote/FNMA:US",
      "https://www.bloomberg.com/news/articles/2025-03-19/musk-ally-stanley-abruptly-resigns-from-fannie-mae-board?srnd=phx-industries-real-estate",
      "https://therealdeal.com/national/2025/03/18/fhfa-director-overhauls-fannie-mae-freddie-mac-boards/",
      "https://therealdeal.com/national/2025/01/17/trump-taps-bill-pulte-to-lead-federal-housing-finance-agency/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/national/2025/03/18/fhfa-director-overhauls-fannie-mae-freddie-mac-boards/",
      "https://therealdeal.com/national/2025/01/17/trump-taps-bill-pulte-to-lead-federal-housing-finance-agency/",
      "https://therealdeal.com/national/2021/01/15/treasury-quits-bid-to-privatize-fannie-mae-freddie-mac/"
    ],
    "market": "National",
    "published": "Wed, 19 Mar 2025 22:00:00 +0000",
    "published_dt": "2025-03-19T22:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/19/publix-pays-25m-for-fort-lauderdale-store/",
    "title": "Publix picks up another of its South Florida stores for $25M",
    "subhead": "Lakeland-based grocery chain has been on a buying spree since last year",
    "authors": "ByFrancisco Alvarado",
    "pub_date": "Mar 19, 2025, 5:00 PM",
    "pub_date_dt": "2025-03-19T17:00:00",
    "content": "Publix is back at the South Florida retail checkout line, paying $25 million for one of its stores near Galleria Mall in Fort Lauderdale.\nSince last year, the Lakeland-based grocery chain has dropped $273 million for standalone Publix supermarkets and shopping centers anchored by its stores, including its latest purchase.\nAn affiliate of\nPublix\n, led by CEO Kevin Murphy, acquired the store and an outparcel building leased to Starbucks at 2501-2519 East Sunrise Boulevard, records and real estate database Vizzda show. The deal breaks down to $678 a square foot.\nThe seller, a City National Bank of Florida trust, acquired the 2.5-acre property in 1977, according to records. The previous sale price is not listed on the deed. The buildings, spanning 36,822 square feet, were completed in 2011.\n\nThe Fort Lauderdale store purchase comes after Publix picked up a North Miami shopping center with two outparcels and an office building for\n$40 million\nin January. In addition to being anchored by a Publix supermarket, the 11.8-acre property’s tenants include McDonald’s, Elevation Fitness, Wells Fargo Bank, GNC and GoPet Hospital.\nIn August, Publix bought four shopping centers anchored by its stores in Davie,\nLake Worth Beach and Royal Palm Beach\nfor a combined $150 million, including a\n$50.7 million\nacquisition of a 12-acre site with four single-story buildings. It ranked as South Florida’s fifth priciest retail trade of 2024.\nIn May, Publix picked up Ramblewood Square Shopping Center in Coral Springs for\n$58.5 million\n.\nOther investors getting in on the Publix action include Kite Realty Group, led by CEO John Kite. In January, Indianapolis-based Kite acquired Village Commons Shopping Center in West Palm Beach for\n$68 million\n. In addition to Publix, tenants include AT&amp;T, Duffy’s Sports Grill, European Wax Center, Jersey Mike’s, Tenet Health and The UPS store.",
    "related_links": [
      "https://therealdeal.com/tag/publix/",
      "https://therealdeal.com/miami/2025/01/03/publix-pays-40m-for-north-miami-shopping-center/",
      "https://therealdeal.com/miami/2024/09/03/publix-pays-83m-for-two-davie-shopping-centers/",
      "https://therealdeal.com/miami/2024/12/24/here-are-the-top-south-florida-retail-deals-of-2024/",
      "https://therealdeal.com/miami/2024/05/23/publix-expands-south-florida-shopping-center-portfolio/",
      "https://therealdeal.com/miami/2025/01/29/kite-realty-pays-68m-for-west-palm-beach-shopping-center/"
    ],
    "market": "South Florida",
    "published": "Wed, 19 Mar 2025 21:00:00 +0000",
    "published_dt": "2025-03-19T21:00:00+00:00",
    "author": "Francisco Alvarado"
  },
  {
    "url": "https://therealdeal.com/national/nashville/2025/03/19/oracle-subleases-two-floors-as-headquarters-project-is-stalled/",
    "title": "Oracle subleases 2 floors ahead of stalled HQ development",
    "subhead": "Tech giant received largest economic development deal in Tennessee history",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 19, 2025, 5:00 PM",
    "pub_date_dt": "2025-03-19T17:00:00",
    "content": "Oracle is expanding in Nashville after maxing out its office lease ahead of its $1.35 billion headquarters development.\nThe tech giant subleased 60,000 square feet spanning two full floors in a Capitol View office building at 500 11th Ave North from HealthStream, the Nashville Business Journal\nreported\n. HealthStream is offloading space amid a shift toward a hybrid work model; it is downsizing to about 30,000 square feet in the building.\nMemphis-based Boyle Investment Company owns the 300,000-square-foot building.\nOracle filled up the nearby Radius Building, at 601 11th Ave North, where it leases about 150,000 square feet. The company has steadily expanded within that space, adding a full floor last July and another 16,000 square feet earlier this year. With the sublease, Oracle’s office footprint in Nashville now surpasses 200,000 square feet.\nThe building also houses the Nashville Area Chamber of Commerce and CoStar Group, which recently leased 34,000 square feet.\n\nOracle’s expansion comes as construction on its planned $1.35 billion East Bank campus has stalled. Nearly four years after securing incentives tied to its goal of employing 8,500 workers in Nashville by 2031, no start date has been announced. The company had roughly 700 employees in the city at the end of 2023, according to state records.\nOracle’s East Bank project, the largest economic development deal in the history of the city and state, gained even greater significance last year when Chairman Larry Ellison announced the site would become the company’s global headquarters. Nashville approved incentives of $175 million, and the state of Tennessee approved $65 million.\nArchitect Norman Foster has been tapped to design the campus, set on 70 acres that Oracle purchased for $277 million.\nTech sector investment has put Nashville at the top of North American office markets. It led net absorption in the United States and Canada, with a 2.3 percent increase between the third quarter of 2023 through the second quarter of last year, according to CBRE.\n—Rachel Stone\n",
    "related_links": [
      "https://www.bizjournals.com/nashville/news/2025/03/18/oracle-healthstream-sublease-office-expansion.html",
      "https://therealdeal.com/national/nashville/2024/12/31/local-investors-bought-discounted-nashville-office-building/",
      "https://therealdeal.com/national/nashville/2024/12/20/nashville-office-demand-highest-in-nation/",
      "https://therealdeal.com/national/nashville/2025/02/24/tourbineau-real-estate-partners-takes-on-nashville-conversion/"
    ],
    "market": "National",
    "published": "Wed, 19 Mar 2025 21:00:00 +0000",
    "published_dt": "2025-03-19T21:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/19/will-congress-turn-from-trump-on-wildfire-aid/",
    "title": "Will Congress turn from Trump on wildfire aid?",
    "subhead": "Republican members appear to have cooled on conditioning federal aid to California",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 19, 2025, 4:57 PM",
    "pub_date_dt": "2025-03-19T16:57:00",
    "content": "President Donald Trump said he wanted strings attached to billions of dollars in federal aid to  Los Angeles County, where firestorms this year torched 16,000 homes and businesses.\nBut Republicans in Congress appear to have cooled on conditioning federal aid to California — which doesn’t appear on the horizon months after the Jan. 7 fires in Altadena and the Pacific Palisades,\nthe San Francisco Chronicle reported.\nLast month, Gov. Gavin Newsom requested\n$40 billion\nin disaster funding, but there’s little movement on any aid.\n“Congress must receive the formal disaster aid request from the administration,” a spokesperson for House Speaker Mike Johnson, a Republican from Louisiana, said in a statement to the Chronicle.\nThe White House declined to comment on when it might send Congress the request.\nTwo weeks after the fires, Trump\nthreatened to withhold federal aid\nfor the thousands of Los Angeles-area residents who lost their homes unless the state requires voter identification at the polls and opens the water spigot to Southern California.\nDisaster aid will likely get attention from Congress when lawmakers return from district work periods on March 24, Republicans Rep Ken Calvert from Palm Desert, and Rep. Doug LaMalfa from Chico, told the Chronicle.\nCalvert, the most senior California lawmaker and the only California Republican on the House Appropriations Committee, said he suspects there will need to be more than one vote on disaster aid, including one to provide additional funding to the\nFederal Emergency Management Agency\n.\n\n“At some point, we’re going to have to put a little more money in FEMA, I think, because obviously the debris removal was extremely expensive,” Calvert told the newspaper.\nMembers of Congress from California, including all nine Republicans, signed onto a\nMarch 7 letter\nurging congressional leadership to provide additional assistance to Los Angeles County.\n“Just as the federal government has come to the aid of communities impacted by wildfires across the western United States, tornados in the Midwest, ice storms in Texas, or hurricanes in the Southeast, we should once again support the recovery of the impacted families, businesses, and communities in Los Angeles County,” the lawmakers said.\nSeveral projections have estimated that insured losses from the January wildfires in L.A. County could reach $30 billion or more, making it the\ncostliest natural disaster in state history\n.\nSeveral California Republicans said they want to see a clearer accounting of existing liabilities to determine how much federal money is needed.\n“FEMA is going through all the numbers and identifying what the costs are, and we’re trying to determine the liability — who’s liable,” whether it’s Southern California Edison, the insurance companies or other entities, Calvert told the Chronicle.\n“Right now, California is hip-shooting a number. They don’t have what amount is insured versus uninsured,” and whether Southern California Edison will have responsibility for the Eaton Fire, added Republican Rep. Darrell Issa from Escondido. “If they have primary responsibility, that’s a huge difference in the funding — literally billions of dollars. So we’re prepared to offer a bill, but to put a number on it we do need these items done.”\nIn January, several Republicans\nfloated the idea\nof making wildfire aid for California contingent on policy changes, an idea that drew a\nharsh rebuke\nfrom Anaheim Republican Rep. Young Kim.\n“Playing politics with people’s livelihoods is unacceptable and a slap in the face to the Southern California wildfire victims and to our brave first responders,” Kim said in a statement.\n—\nDana Bartholomew",
    "related_links": [
      "https://www.sfchronicle.com/politics/article/california-wildfire-aid-20213765.php",
      "https://www.sfchronicle.com/politics/article/newsom-asks-congress-40b-help-l-a-wildfire-20180963.php",
      "https://therealdeal.com/la/2025/01/24/trump-threatens-to-withhold-disaster-aid-to-los-angeles/",
      "https://www.sfchronicle.com/politics/article/trump-fema-republican-states-20202184.php",
      "https://www.schiff.senate.gov/wp-content/uploads/2025/03/CA-Delegation-Letter-Supporting-States-Disaster-Funding-Needs.pdf",
      "https://www.sfchronicle.com/california-wildfires/article/la-fire-cost-20027488.php",
      "https://www.sfchronicle.com/politics/joegarofoli/article/republicans-wildfire-aid-california-20032087.php",
      "https://apnews.com/article/california-wildfires-conditional-aid-washington-trump-johnson-12c779b96e04d564802d4d06348aa0fc",
      "https://therealdeal.com/author/dana-bartholomew/"
    ],
    "market": "Los Angeles",
    "published": "Wed, 19 Mar 2025 20:57:24 +0000",
    "published_dt": "2025-03-19T20:57:24+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/19/miami-manager-sells-broward-retail-center-for-21m/",
    "title": "Miami Manager cuts fully leased Broward retail center from commercial portfolio",
    "subhead": "Sunrise-based real estate investment firm sold Village Shoppes of Coconut Creek for $21M",
    "authors": "ByFrancisco Alvarado",
    "pub_date": "Mar 19, 2025, 4:32 PM",
    "pub_date_dt": "2025-03-19T16:32:00",
    "content": "Miami Manager is left with three shopping centers in South Florida, after selling Village Shoppes of Coconut Creek for $21.3 million.\nAn affiliate of Sunrise-based Miami Manager, led by Claudio and Milton Mekler, sold the two-building retail site at 4690 North State Road in\nCoconut Creek\nto an entity managed by Dayvana Milano and Lisette Hermoso in Coral Springs, records and real estate database Vizzda show.\n“We view this as a favorable moment to sell high cap rate assets, as they have experienced relatively lower price reductions compared to other segments of the real estate market,” Claudio Mekler said in an email. “This allows us to reinvest in a less risky asset while maintaining similar returns.”\nThe nearly 5-acre property includes a two-story building that includes some office suites on the second floor completed in 2009, as well as an outparcel one-story building built in 2011, according to records and Vizzda. The buildings span 53,709 square feet. Miami Manager sold another outparcel building leased to\nChick-Fil-A\nfor $3.6 million in 2022.\n\nIn 2015, Miami Manager paid $19.6 million for Village Shoppes of Coconut Creek, records show.\nThe fully leased shopping center’s tenants include Hook’s Catch Seafood &amp; Wings, Colella Cosmetic Dentistry, KOA Mart Korean and Asian food store, Belfort Fitness Lifestyle and Pasquale’s Pizza Co. The property generates an annual net operating income of $1.5 million, according to an offering memorandum.\nMiami Manager owns three other shopping centers in Doral, Sunrise and West Palm Beach. In 2022, the firm sold Plantation Marketplace, a shopping center anchored by a Food Fair supermarket in Plantation, for\n$38.4 million\nto Barron Real Estate.\nOutdoor shopping centers like Village Shoppes of Coconut Creek remain safe bets for retail investors at a time when the commercial sector is experiencing headwinds due to recent bankruptcies of big box and national restaurant chains.\nDuring the fourth quarter of last year, Broward County retail landlords slightly increased the average asking rent to $27.84 a square foot, compared to $27.49 a square foot during the same period of the previous year, according to a\nColliers report\n. But Broward’s retail vacancy rate climbed to 4.2 percent, compared to 3.7 percent, year-over-year.",
    "related_links": [
      "https://therealdeal.com/tag/coconut-creek/",
      "https://therealdeal.com/tag/chick-fil-a/",
      "https://therealdeal.com/miami/2022/06/08/grocery-store-anchored-shopping-center-sales-ignite-south-floridas-retail-market/",
      "https://therealdeal.com/miami/2025/01/30/south-florida-retail-asking-rents-rose-in-fourth-quarter-2/"
    ],
    "market": "South Florida",
    "published": "Wed, 19 Mar 2025 20:32:46 +0000",
    "published_dt": "2025-03-19T20:32:46+00:00",
    "author": "Francisco Alvarado"
  },
  {
    "url": "https://therealdeal.com/texas/san-antonio/2025/03/19/port-san-antonio-aims-to-lure-companies-with-trophy-office/",
    "title": "$275M trophy office aims to lure companies to Port San Antonio",
    "subhead": "Innovation Tower is expected to draw higher rents than the larger market",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 19, 2025, 4:30 PM",
    "pub_date_dt": "2025-03-19T16:30:00",
    "content": "Plans are in motion to lure companies to Port San Antonio, the redevelopment of San Antonio’s former Air Force base.\nThe port’s board approved spending $7.5 million to finalize architectural plans for Innovation Tower, a 300,000-square-foot mixed-use development  that would include office space, a hotel, grocery store, restaurants, retail, a childcare facility and “a vertiport with air taxis,” the San Antonio Express-News\nreported\n.\nThe wing-shaped building would rise 12 stories at the entrance of the 1,900-acre Port San Antonio campus. It’s expected to cost $275 million ($250 per square foot) and could be delivered as early as 2028. The port plans to finance the building with a combination of debt and the port’s equity.\nThe building has already started pre-leasing, according to the port’s website.\nPort CEO Jim Perschbach anticipates rents at Innovation Tower could be $50 per square foot, which surpasses rent rates for new office space in popular submarkets like downtown and the Pearl.\n\nPerschbach’s plans to put high-end office space at the port have been questioned, but the port has already built a solid tenant base, he told the outlet.\nThe port has 80 tenants with about 18,000 employees, he said. About 97 percent of the 10 million square feet of space is occupied, he said. The area caters to cybersecurity, defense and aerospace companies; it’s home to offices for companies like Boeing and Accenture.\n“This isn’t just some sort of ‘build it and they will come’ effort,” he told the outlet. “We’re very confident we’ve proven our market.”\nThe numbers back him up; since 2020, the port has increased its operating revenue by 69 percent to $75 million and its net operating income by 56 percent to $29.5 million.\n—Jess Hardin\n",
    "related_links": [
      "https://www.expressnews.com/business/real-estate/article/port-san-antonio-office-building-childcare-retail-20227834.php",
      "https://therealdeal.com/texas/san-antonio/2025/01/14/mauricio-umanskys-the-agency-opens-san-antonio-office/",
      "https://therealdeal.com/texas/san-antonio/2024/12/23/san-antonio-multifamily-in-pearl-district-trades-hands/",
      "https://therealdeal.com/texas/2024/04/16/weston-urban-adds-to-downtown-san-antonio-assemblage/"
    ],
    "market": "Texas",
    "published": "Wed, 19 Mar 2025 20:30:00 +0000",
    "published_dt": "2025-03-19T20:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/19/chicago-landlords-push-back-on-anti-gentrification-ordinance/",
    "title": "How Chicago landlords are pushing back against anti-gentrification rule",
    "subhead": "Real estate players are lobbying aldermen, claiming ordinance delays sales and discourages investment",
    "authors": "ByKelli Duncan",
    "pub_date": "Mar 19, 2025, 4:00 PM",
    "pub_date_dt": "2025-03-19T16:00:00",
    "content": "Chicago’s real estate industry is pushing back against the anti-gentrification ordinance that took effect this month, with one group launching a letter-writing campaign against it.\nLandlords and brokers are frustrated with the right of first refusal granted to tenants in some Northwest Side neighborhoods, which allows tenants to band together to purchase their buildings ahead of any outside investor.\nThe Chicagoland Apartment Association and the Neighborhood Building Owner’s Alliance said the right of first refusal will delay the sale of buildings, causing problems for owners who may need to sell quickly, and could have a cooling effect on investment in the area.\n“This ordinance punishes owners of affordable housing, devalues their property, and makes it harder to invest in neighborhood housing,” said Mike Glasser, president of the Neighborhood Building Owner’s Alliance, which launched a letter-writing campaign against the ordinance.\nGlasser’s organization, an alliance of 11 landlord associations, put up a webpage with forms for contacting alderpeople, along with information about the ordinance.\nIt’s also asking members to share personal stories of how the ordinance affected them if they are owners in the area. In addition to legislative tactics, the group is exploring ways to challenge the ordinance in court, according to comments made in an October conference call.\nThey are looking for examples of sellers being harmed by the requirement to give renters in larger buildings a 60-day notice of intent to sell and another 90 days to form a tenant association to decide if they want to buy the building. This timeline is shorter for buildings of four units or fewer, where the total timeline is 45 days.\nThe ordinance was crafted to address documented displacement and gentrification faced by residents in the communities covered by the ordinance, said Kelvin Gensollen Arellano, housing organizer with a community group called Palenque LSNA. The industry’s arguments, on the other hand, are “hypothetical,” he said.\nThe ordinance is a pilot program that will sunset at the end of 2029 unless renewed. The program applies to parts of Logan Square, Avondale, Hermosa, Humboldt Park and West Town as well as Pilsen. It is meant to stem exploding housing costs in areas that began gentrifying rapidly about 10 years ago, when developers started tearing down two- and three-flats and replacing them with luxury homes along the 606 trail. The area lost 6.1 percent of its two- to six-flat buildings between 2013 and 2018, according to the DePaul Institute for Housing Studies.\nIn response to the loss of smaller multifamily buildings, the ordinance also allows for the construction of two-flats by right in any areas within the ordinance’s boundaries that are zoned for single-family. Finally, the measure increased demolition surcharges from $5,000 per unit or $15,000 per building to $20,000 per unit and $60,000 per building, whichever is higher.\n‘Unintended consequences’ and ‘trojan horse’ arguments\nAndy Friedman, a multifamily broker with Kiser Group, said owners and developers will just find ways around portions of the ordinance designed to preserve existing affordable housing and protect against displacement, bringing “unintended consequences” to tenants and sellers.\nFor example, sellers will likely move to vacate buildings before selling as a way of skirting tenant rights, meaning less available housing in the area for that period of time, Friedman said.\nThe ordinance prohibits owners from displacing tenants after purchasing a building, requiring them to keep inherited tenants for 6 months or until the end of their lease, whichever is longer. That could pose a challenge for buyers looking to rehab a property and sellers may want to avoid the elongated timeline of granting tenants the right to first refusal. Vacating a property before bringing it to market may become a more attractive option, said Compass broker Mario Greco.\n\nThe increased demolition fees may hurt owners and sale prices in the area as buyers will take that cost off the top of any offers they make, Friedman said. Though he has not seen evidence of a drop in investment or average sale price yet, Friedman said the ordinance has “definitely changed the attitude” of developers toward the area.\nWith so much of the area’s affordable housing already bought up by outside investors, Gensollen Arellano said most of the money from multifamily sales was not circulating or being reinvested in  local communities anyway. Revenue from the surcharges will go to the Chicago Community Land Trust to support the “construction, rehabilitation or preservation of affordable housing” in the area, according to the ordinance. Developers who plan to reserve at least half of proposed units for families who earn up to 60 percent of the area’s median income are exempt from the increased surcharges.\nThe Chicago City Council\namended the ordinance\nin response to concerns from the industry in December, adding the sunset date, delaying implementation of the right to first refusal until March 1 and requiring tenants to provide proof of financial backing to move forward in purchasing a building. The Chicagoland Apartment Association supported these amendments, but it would prefer for the council to overturn the measure altogether, said the organization’s executive vice president Mike Mini. It’s unlikely there is any political will to do so given strong support for the ordinance among aldermen, he said.\n“I’m certain that the evidence is going to show that this is not an effective ordinance, and perhaps then there’ll be an opportunity to revisit this,” Mini said. “If there’s an opportunity to overturn it, we certainly would participate in that.”\nMeanwhile, Palenque LSNA, which\nworked to get the ordinance passed last fall\n, has launched an education campaign of its own, canvassing Northwest Side neighborhoods to inform tenants about their rights.\n“This is the first step,” Gensollen Arellano said. The second step has been talking with tenants about the kinds of “legal, logistical and financial support” they might need in order to execute their rights, so that Palenque and others can help bridge that gap, he said.\nBrokers who work in the area said they have yet to see an example of tenants organizing to match an offer from a third-party buyer to purchase their building, and Mini said he doubts the likelihood of it happening, particularly in larger buildings.\nThe timeline afforded to tenants to organize represents an unnecessary delay that will disadvantage small, live-in owners who may have more logistical and timing constraints around buying a property if they are taking out a mortgage, said NBOA member Joe Wilcox, a property manager and broker.\nThe ordinance states that 75 percent of occupied units should be in agreement in order for tenants to move forward with buying their building. That’s more of a challenge in larger buildings, but Palenque LSNA is working to provide support to tenants on a case-by-case basis. Tenants can also opt to transfer their right of first refusal to a third-party organization that is committed to keeping the building affordable, Gensollen Arellano said.\nIndustry players’ arguments that reforms will end up hurting renters or local, small-time landlords are often a “trojan horse” for less community-minded concerns, he said.\n“Most of the people who are purchasing these two-flats and three-flats are not families. Most of them are very big companies that are trying to resell them at a very big price and de-converting these units into luxury homes,” he said. “It’s a rational period of time to ask people to wait 30 days. It’s not like the entire world will end during this period of time.”\nBut Mini and others in the industry maintained that if the city really wanted to protect affordable housing in the area, they would remove restrictions on sellers, open up zoning and make it easier to increase the overall supply of housing.\n“The ordinances in the city of Chicago are such that it makes it very, very difficult to operate a rental property, and that puts upward pressure on rents. Costs are skyrocketing. Insurance is going up. Property taxes are high. Utility charges are high. It’s difficult to get financing,” Mini said. “There’s just a lot of headwinds in the apartment industry right now, and until we change our policies to make it easier to build and maintain properties, we’re going to continue to have this problem.”\n",
    "related_links": [
      "https://therealdeal.com/chicago/2024/12/11/chicago-softens-anti-gentrification-ordinance/",
      "https://therealdeal.com/chicago/2024/10/10/real-estate-panicked-by-chicagos-anti-gentrification-measure/",
      "https://therealdeal.com/chicago/2024/10/10/real-estate-panicked-by-chicagos-anti-gentrification-measure/",
      "https://therealdeal.com/chicago/2024/12/11/chicago-softens-anti-gentrification-ordinance/"
    ],
    "market": "Chicago",
    "published": "Wed, 19 Mar 2025 20:00:00 +0000",
    "published_dt": "2025-03-19T20:00:00+00:00",
    "author": "Kelli Duncan"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/19/homebuilding-boom-brings-1000-homes-to-hot-dallas-suburb/",
    "title": "Homebuilding boom brings 1,000 more homes to Rockwall",
    "subhead": "Michael Joyce Properties, Qualico Developments, Skorburg Companies approved for development plans in fast-growing suburb",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 19, 2025, 3:51 PM",
    "pub_date_dt": "2025-03-19T15:51:00",
    "content": "Two residential projects are bringing over 1,000 homes to a fast-growing suburb east of Dallas.\nRockwall City Council green-lighted a development called Juniper, from a joint effort between Canada-based Qualico Developments and Rockwall-based Michael Joyce Properties, and another called Erwin Farms, from Dallas-based Skorburg Company, the Dallas Business Journal\nreported\n.\nJuniper, spanning 526 acres, will bring 885 homes, over 7 acres of trails and 126 acres of open space, including 33 acres of city parkland to the intersection of John King Boulevard and South Goliad Street. Construction is planned in six phases over 11 years, with work on the first phase beginning in June. A second phase is expected to launch in 2027. Qualico’s business units include Sterling Homes and Pacesetter Homes, and it opened a McKinney office in 2018.\nThe 98-acre Erwin Farms, near North Country Lane and FM 1141, will include 123 lots, hiking and biking trails, and two multi-use sports courts. Prices are estimated to range between $750,000 and $1.2 million, with construction expected to span six years. The first residents could move in by mid-2028.\n\nThe developments underscore Rockwall County’s rapid transformation. The county’s population has increased 4 percent in the past year alone, surpassing 137,000, according to the U.S. Census Bureau. Since 2020, it has grown an estimated 25 percent, making it one of Texas’ fastest-growing counties, second only to neighboring Kaufman County.\nThe Dallas-Fort Worth home building market is experiencing significant growth, driven by strong demand and a robust development pipeline. The region is a leader in construction permits,\ntrailing only Houston\nnationally.\n—Rachel Stone\n",
    "related_links": [
      "https://www.bizjournals.com/dallas/news/2025/03/19/juniper-erwin-farms-rockwall-new-neighorhoods.html",
      "https://therealdeal.com/texas/houston/2024/10/24/houston-leads-nation-in-homebuilding-due-to-high-demand/",
      "https://therealdeal.com/texas/dallas/2024/01/22/h-e-b-to-open-store-in-dallas-suburb-of-rockwall-in-september-2025/",
      "https://therealdeal.com/texas/dallas/2024/07/09/shaquille-oneal-buys-another-house-in-dallas-suburbs/",
      "https://therealdeal.com/texas/dallas/2024/05/10/home-builder-giants-squeeze-out-dfws-little-guys/"
    ],
    "market": "Texas",
    "published": "Wed, 19 Mar 2025 19:51:07 +0000",
    "published_dt": "2025-03-19T19:51:07+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/19/elliman-celebrates-top-nyc-agents-in-2025-ellies/",
    "title": "Elliman celebrates top NYC agents in 2025 Ellies",
    "subhead": "Michael Lorber Team, Ann Cutbill Lenane among city’s top honorees",
    "authors": "BySheridan Wall",
    "pub_date": "Mar 19, 2025, 3:47 PM",
    "pub_date_dt": "2025-03-19T15:47:00",
    "content": "Douglas Elliman is celebrating its top-producing agents in New York City, who rose among the ranks of the firm as it waded through a turbulent 2024.\nThe brokerage on Wednesday announced the winners of its annual Ellie awards, recognizing brokers who earned the largest sales volumes and gross commission incomes, and closed the highest number of transactions last year.\nElliman’s agents “didn’t just have an outstanding 2024; they defined it,” Richard Ferrari, the head of the company’s brokerage, wrote in a statement. CEO Michael Liebowitz pointed to “their expertise, entrepreneurial drive, and commitment to excellence”\nAgents and teams with operations in the Big Apple racked up company-wide accolades this year, including the Eklund-Gomes Team, which once again snagged the Billion Dollar Club Award for exceeding $1 billion in sales. The cohort, led by Fredrik Eklund and John Gomes, also nabbed the highest GCI among the firm’s mega teams, followed by Noble Black &amp; Partners.\nIn Manhattan, Ann Cutbill Lenane was named the top agent by sales volume, transactions and GCI,\nadding a third honor\nto her spoils from the year prior. Lenane — who placed 26th in\nThe Real Deal’s\nlatest ranking\nof the city’s top agents with $76 million in sell-side deals — was also the No. 4 agent by GCI for the entire company.\nFollowing Lenane in sales volume and GCI was Michelle Griffith, who led sales at the Reuben Brothers’ Upper East Side hotel-condo conversion, alongside top broker Lauren Muss. The project, known as the Surrey, was a fixture atop\nweekly contract reports\nin the borough, scoring signed contracts for at least three units priced north of $20 million.\n\nThe Michael Lorber Team finished first in sales, transactions and commission income among Elliman’s large teams in New York City. The group slid into the top spot after the 2024 winner, the Holly Parker Team,\njumped from Elliman\nto Compass earlier this year amid a\nwave of brokers\nexiting the firm over the last few months.\nLorber’s team, which placed 11th in\nTRD’s\nrankings with $103 million in sales, was also the third top-earning large team overall.\nAlso among the top teams highlighted in the awards was the Rubin Team, which was No. 1 in GCI and transactions among the firm’s medium teams in Manhattan. The Lindsay Barton Barrett Team earned the most commission income, sales volume and transactions among the company’s small teams.\nIn Brooklyn, the top-selling individual agent was Rebekah Carver, and the top-selling medium and small teams were the Scott Robles Team and The Bartolucci Team, respectively.\nElliman tapped its honorees following an end to the year rife with executive turnover. The firm’s longtime CEO and chairman Howard Lorber abruptly retired in October under pressure from the board.\nThe head of the company’s brokerage, Scott Durkin, was terminated just days after Lorber stepped down from his post. Chief operations officer Richard Lampen also exited the firm at the end of last year.\nElliman, Manhattan’s third-largest brokerage by\nTRD’s analysis\nof sales volume, closed 2024 with a\n$76 million loss\n, up from the $43 million lost the previous year. The brokerage has been in the red for more than two years, though it pushed its revenue above $1 billion last year.\n",
    "related_links": [
      "https://therealdeal.com/new-york/2024/03/14/elliman-names-2024-nyc-ellie-award-winners/",
      "https://therealdeal.com/magazine/april-2024/ranking-nycs-top-residential-brokers/",
      "https://therealdeal.com/new-york/2024/11/25/new-devs-rule-manhattans-luxury-market/",
      "https://therealdeal.com/national/2025/02/05/holly-parker-joins-compass-after-24-years-at-douglas-elliman/",
      "https://therealdeal.com/national/2024/10/14/compass-elliman-agents-tracking-broker-moves-2024/",
      "https://therealdeal.com/magazine/march-2024/ranking-nycs-top-brokerages-of-2023/",
      "https://therealdeal.com/national/2025/03/11/elliman-closed-bumpy-2024-with-narrowed-losses/",
      "https://therealdeal.com/national/2025/03/11/elliman-closed-bumpy-2024-with-narrowed-losses/",
      "https://therealdeal.com/new-york/2024/03/14/elliman-names-2024-nyc-ellie-award-winners/",
      "https://therealdeal.com/magazine/april-2024/ranking-nycs-top-residential-brokers/"
    ],
    "market": "New York",
    "published": "Wed, 19 Mar 2025 19:47:12 +0000",
    "published_dt": "2025-03-19T19:47:12+00:00",
    "author": "Sheridan Wall"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/19/multiplan-re-plans-first-coral-gables-condo-project/",
    "title": "Brazilian billionaire’s firm completes dev site purchase for first Coral Gables condo project",
    "subhead": "Multiplan paid nearly $32M for two-building assemblage",
    "authors": "ByKatherine Kallergis",
    "pub_date": "Mar 19, 2025, 3:30 PM",
    "pub_date_dt": "2025-03-19T15:30:00",
    "content": "Multiplan Real Estate Asset Management completed an assemblage for its first condo development in Coral Gables,\nThe Real Deal\nhas learned.\nBrazilian billionaire Jose Isaac Peres’ firm, led by managing partner Marcelo Kingston, paid $17.8 million for the second half of the assemblage, an office building at 1501 Venera Avenue, Kingston told\nTRD\n.\nMutiplan\nacquired the first piece, the vacant office building next door at 1500 Monza Avenue, from Baptist Health South Florida in October for $14 million.\nThe developer paid $31.8 million in total for the 1.4-acre site, which includes Park Place I and Park Place II office buildings. A company tied to the Rosen family sold the latest piece, property records show.\nKingston said the firm plans a luxury condo project on the site. The developer expects to submit plans for the project later this year, and could launch sales by the end of 2026, he said. The building would include a “high level of amenities and services.”\n\nMultiplan expects to target local buyers downsizing from single-family homes in the area, including Cocoplum, Ponce-Davis and Gables Estates, Kingston added. Phil Gutman of Gutman Development Marketing leads Multiplan’s in-house sales team and will be advising the project, according to a press release.\nThe second office building, Park Place II, is fully occupied and will keep its tenants in place until the project moves forward. Combined, the two buildings include about 50,000 square feet of office space.\nThe\nCoral Gables\nassemblage is across the street from a city park and near a\nnew Publix store\nthat’s under construction. Also nearby, developer Edgardo Defortuna’s Fortune International Group\nplans to redevelop\nan aging residential and commercial complex in Coral Gables into a luxury condo project. The 4.8-acre property fronts the Gables Waterway and is immediately south of U.S. 1.\nMultiplan’s completed projects include 57 Ocean and Il Villaggio in Miami Beach. The company is also working on the\nplanned waterfront Ocean House\ncondo building in Surfside. It launched sales, led by Gutman, in the fall.\n",
    "related_links": [
      "https://therealdeal.com/tag/multiplan-real-estate/",
      "https://therealdeal.com/tag/coral-gables/",
      "https://therealdeal.com/miami/2020/04/13/publix-pays-23m-for-site-of-new-coral-gables-store/",
      "https://therealdeal.com/miami/2023/11/15/fortune-plans-branded-condo-on-gables-waterway-site/",
      "https://therealdeal.com/miami/2024/08/15/multiplan-launches-sales-for-oceanfront-surfside-condos/",
      "https://therealdeal.com/miami/2023/11/15/fortune-plans-branded-condo-on-gables-waterway-site/",
      "https://therealdeal.com/miami/2025/02/25/developers-launch-sales-for-coral-gables-wellness-condos/"
    ],
    "market": "South Florida",
    "published": "Wed, 19 Mar 2025 19:30:00 +0000",
    "published_dt": "2025-03-19T19:30:00+00:00",
    "author": "Katherine Kallergis"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/19/muwekma-ohlone-tribe-asks-trump-for-title-to-presidio/",
    "title": "Bay Area Native American tribe asks Trump for title to Presidio",
    "subhead": "Muwekma Ohlone Tribe seeks to create reservation on 1,500-acre national park",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 19, 2025, 3:11 PM",
    "pub_date_dt": "2025-03-19T15:11:00",
    "content": "An unrecognized Native American tribe from San Francisco ramped up its claim to the Presidio after President Donald Trump ordered an end to the federal trust overseeing the national park.\nThe Muwekma Ohlone Tribe formally requested the president return the 1,500-acre park at the base of the Golden Gate bridge to its supervision, where it would create a new reservation, the\nSan Francisco Standard\nand\nKRON4\nreported.\nThe Manteca-based tribe that once inhabited San Francisco said the move “would reduce federal taxpayer spending and constitute one of the most significant rematriations of Indigenous land in U.S. history,” according to a statement.\nThe request comes after Trump\nissued an executive order\nlast month to dissolve the Presidio Trust, established by Congress in 1996 to redevelop the former military base and manage the park and its nearly\n200 commercial tenants\n.\nThe Trust is operating in the black, earning $182 million last year while reinvesting\n$58 million\nin net operating income back into the park. It relies on Presidio profits and private donations,\nnot taxpayer money\n, according to a Trust report.\nThe White House didn’t respond to a request for comment by the Standard.\n“This is an opportunity for President Trump to do what the state of California has failed to do,” Charlene Nijmeh, chair of the tribe, said in a statement. “Not only will returning the Presidio to Indigenous care be the right thing for our people and for the land, but it will also save the federal government — and taxpayers — money.”\nThe tribe, working with the Lakota People’s Law Project, has launched a\npetition\nseeking public support for the initiative.\n\nTribal officials said they submitted a right of first refusal to the federal government during the decommissioning of the military base in 1992, but faced opposition from prominent California politicians, including the late Sen. Dianne Feinstein and Speaker Emerita Nancy Pelosi, both Democrats.\nIn the petition addressed to Trump and Secretary of the Interior Doug Burgum, the Muwekma Ohlone Tribe called the Presidio “a beautiful national park on the tribe’s traditional homelands in San Francisco.”\nIt said the goal of the petition is to “rematriate” the Presidio and “establish a new reservation” there.\n“Rematriation,” according to the Sogorea Te’ Land Trust, is “Indigenous woman-led work to restore sacred relationships between Indigenous people” and “ancestral land.”\nThe tribe said the “rightful return” of the Presidio would be “an extraordinary act of reconciliation” and that the Muwekma people maintain a “deep cultural and spiritual connection to the Presidio lands.”\nThe Muwekma Ohlone Tribe claims on its\nwebsite\nthat it was once federally recognized as the Verona Band of Alameda County but was omitted from the Bureau of Indian Affairs’ first official list of recognized tribes, drafted in 1978, according to the Standard.\nThe tribe has sought to reaffirm its federal status for more than 45 years. There are 614 members of the tribe, living mostly across the Bay Area, an unidentified spokesperson told the newspaper.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://sfstandard.com/2025/03/18/tribe-asks-trump-presidio-control-slams-pelosi/",
      "https://www.kron4.com/news/bay-area/local-tribe-petitions-trump-to-return-presidio-to-indigenous-people/",
      "https://therealdeal.com/san-francisco/2025/02/20/trump-moves-to-squeeze-agency-overseeing-sfs-presidio/",
      "https://therealdeal.com/san-francisco/2023/12/06/presidio-trust-names-cw-to-manage-commercial-portfolio/",
      "https://therealdeal.com/san-francisco/2025/03/03/presidio-trust-raked-in-record-182m-last-year/",
      "https://therealdeal.com/san-francisco/2025/03/06/presidio-trust-counters-trumps-attempted-takedown/",
      "https://action.lakotalaw.org/action/muwekma-presidio",
      "https://www.muwekma.org/recognition-process.html",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/03/06/presidio-trust-counters-trumps-attempted-takedown/",
      "https://therealdeal.com/san-francisco/2025/03/03/presidio-trust-raked-in-record-182m-last-year/",
      "https://therealdeal.com/san-francisco/2025/02/20/trump-moves-to-squeeze-agency-overseeing-sfs-presidio/"
    ],
    "market": "San Francisco",
    "published": "Wed, 19 Mar 2025 19:11:01 +0000",
    "published_dt": "2025-03-19T19:11:01+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/19/crowdstreet-investors-file-1b-class-action-lawsuit/",
    "title": "Jilted CrowdStreet investors file $1B class-action suit over unregistered broker-dealer claims",
    "subhead": "Customers aim to recoup more than $1B in investments made before 2023",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 19, 2025, 3:00 PM",
    "pub_date_dt": "2025-03-19T15:00:00",
    "content": "Angry investors are going after crowdfunding platform CrowdStreet, seeking to recoup more than $1 billion in funds.\nThree victims in Elie Schwartz’s Nightingale Properties case, who each lost at least $25,000, filed a class-action lawsuit in Texas, where CrowdStreet is based, Bisnow\nreported\n. Former CrowdStreet chief executive officer\nTore Steen\nand\nrecently departed\nchief investment officer Ian Formigle are also named as defendants.\nThe investors — a class believed to be at least a thousand strong — are seeking to rescind more than $1 billion of investments made on the platform before 2023. That’s the year CrowdStreet secured a broker-dealer license with the Federal Industry Regulatory Authority. Schwartz defrauded investors of $63 million the year before.\nThe plaintiffs claim CrowdStreet operated as an unregistered broker-dealer for years, selling and marketing securities and collecting commissions without properly protecting investors, in violation of securities laws.\nThe company claims that before it received its license, CrowdStreet was a neutral marketplace that connected investors to developers and sponsors but didn’t promote or recommend investments. The suit counters with claims that CrowdStreet acted more like an investment bank — promoting deals, conducting due diligence and earning fees.\n\nThe lawsuit includes a document showing a plan for CrowdStreet to pursue a FINRA license dating back to 2021.\nCrowdStreet CEO John Imbriglia warned customers last week that the investors in the lawsuit were trying to “capitalize on the Nightingale situation by launching baseless lawsuits against CrowdStreet.” Imbriglia added that the company “will not let it distract us from our goals and mission.\nCrowdStreet is facing a growing legal groundswell, though. This month, 125 investors roped into a campaign to raise $25 million for the acquisition of a Chicago office building\nfiled an arbitration claim\nagainst the company, demanding the platform cover more than $7 million in losses for allegedly ignoring red flags in the deal.\nSchwartz, meanwhile,\npleaded guilty\nto fraud last month. He’s set to be sentenced in May and could receive up to 20 years in prison.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.bisnow.com/national/news/capital-markets/crowdstreet-accused-of-raising-securities-without-a-license-in-class-action-128551",
      "https://therealdeal.com/national/2023/07/28/tore-steen-out-as-crowdstreet-ceo/",
      "https://therealdeal.com/new-york/2025/03/11/crowdstreet-chief-investment-officer-leaves/",
      "https://therealdeal.com/chicago/2025/03/07/investors-come-for-crowdstreet-loop-office-deal-as-elie-schwartz-fallout-mushrooms/",
      "https://therealdeal.com/new-york/2025/02/13/nightingales-elie-schwartz-pleads-guilty-in-crowdfunding-fiasco/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/national/2023/07/28/tore-steen-out-as-crowdstreet-ceo/",
      "https://therealdeal.com/new-york/2025/03/11/crowdstreet-chief-investment-officer-leaves/",
      "https://therealdeal.com/chicago/2025/03/07/investors-come-for-crowdstreet-loop-office-deal-as-elie-schwartz-fallout-mushrooms/"
    ],
    "market": "National",
    "published": "Wed, 19 Mar 2025 19:00:00 +0000",
    "published_dt": "2025-03-19T19:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/19/strip-mall-mogul-sentenced-in-wework-options-scheme/",
    "title": "Strip mall mogul sentenced in WeWork options scheme",
    "subhead": "Jonathan Larmore faces five years in prison after fraud conviction",
    "authors": "ByHolden Walter-Warner",
    "pub_date": "Mar 19, 2025, 3:00 PM",
    "pub_date_dt": "2025-03-19T15:00:00",
    "content": "A Midwest strip mall mogul is headed to prison after\nbeing found guilty\nof a massive fraud scheme perpetrated with WeWork securities days before the co-working company filed for bankruptcy.\nThe U.S. Attorney’s Office for the Southern District of New York on Tuesday\nannounced\nJonathan Larmore was sentenced to five years in prison for manipulating WeWork’s stock price. The Indiana man will also receive three years of supervised release and 500 hours of community service.\n“Jonathan Larmore treated the stock market like a game he could rig to obtain instant riches at the expense of innocent investors,” Acting U.S. Attorney Matthew Podolsky said in a statement.\nIn the fall of 2023, Larmore created a sham real estate investment firm, Cole Capital, and spent $775,000 to buy WeWork call options and hundreds of thousands of shares of common stock. In November, he published a bogus press release, announcing Cole Capital was proposing to acquire a majority of all outstanding shares owned by a minority shareholders at a massive premium, an all-cash offer that would’ve been worth $77 million, had it been real.\nAt the time, WeWork was teetering on the edge of bankruptcy. Larmore never had the intent or ability to follow through on his offer, according to prosecutors.\nAs soon as the release went out, WeWork’s share price immediately jumped 70 percent and ultimately surged 150 percent above the pre-press release price. The call options Larmore held expired before the press release was published, though, keeping him from a payday worth tens of millions. WeWork\nfiled for bankruptcy\nshortly thereafter.\n\nA jury convicted Larmore in October following a weeklong trial and two hours of deliberation.\nLarmore founded Arciterra Companies in 2005, which bought, renovated and refinanced strip malls. By 2023, the company had acquired more than 80 properties and was worth more than $600 million, only for rising interest rates to reduce valuations for residential and commercial properties, putting him on the defensive side of lawsuits brought by vendors and investors.\nIn one case,\ninvestors filed a federal lawsuit\ncentered on Belleville Crossing, an Arciterra strip mall in St. Clair County, Illinois. They accused Larmore of using funds from 175 investors to finance a lavish lifestyle while neglecting lease renewals, regular bill payments and critical repairs on the property.\nThe U.S. Securities and Exchange Commission also sued Larmore in November 2023, accusing the strip mall mogul of misappropriating over $35 million from his company.\n",
    "related_links": [
      "https://therealdeal.com/national/2024/10/23/jonathan-larmore-convicted-for-fraudulent-wework-bid/",
      "https://www.justice.gov/usao-sdny/pr/former-real-estate-ceo-sentenced-five-years-prison-manipulating-wework-stock",
      "https://therealdeal.com/national/2023/11/07/webankrupt-crumbling-co-working-firm-goes-bust/",
      "https://therealdeal.com/national/2023/06/04/arciterra-head-accused-of-mismanaging-investor-money/",
      "https://therealdeal.com/national/2023/06/04/arciterra-head-accused-of-mismanaging-investor-money/",
      "https://therealdeal.com/national/2024/10/23/jonathan-larmore-convicted-for-fraudulent-wework-bid/",
      "https://therealdeal.com/national/2023/11/07/webankrupt-crumbling-co-working-firm-goes-bust/"
    ],
    "market": "National",
    "published": "Wed, 19 Mar 2025 19:00:00 +0000",
    "published_dt": "2025-03-19T19:00:00+00:00",
    "author": "Holden Walter-Warner"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/19/encore-sells-plantation-rental-complex-to-journey-capital/",
    "title": "Journey Capital buys multifamily complex in Plantation for $102M",
    "subhead": "Deal for 404-unit property breaks down to $253K per apartment",
    "authors": "ByLidia Dinkova",
    "pub_date": "Mar 19, 2025, 2:30 PM",
    "pub_date_dt": "2025-03-19T14:30:00",
    "content": "Journey Capital scooped up a 404-unit multifamily complex in Plantation for $102 million.\nThe New York-based investment manager bought Rise at Plantation Walk at 333 North University Drive from Boca Raton-based Encore Capital Management, according to records and real estate database Vizzda. The deal breaks down to $252,500 per unit.\nJourney borrowed $89.7 million from Houston-based Corebridge Financial.\nRise at Plantation Walk consists of a pair of seven-story buildings completed in 2021 and 2022 on a roughly 2.3-acre site, property records show. It offers studios and one- to three-bedroom apartments, with monthly rents ranging from $2,172 to $4,415, according to Apartments.com.\nThe complex is part of Encore Capital’s mixed-use\nPlantation Walk\nproject on a 32-acre site that used to be Fashion Mall.\nEncore, led by\nArt Falcone\n, bought the then-vacant mall in a bankruptcy auction in 2015 for\n$37.7 million\n. In 2019, Plantation city officials\napproved\nthe redevelopment with up to 700 apartments, about 250,000 square feet of offices and 225,000 square feet of retail.\n\nEncore has sold completed portions of Plantation Walk over the years. In 2021, it sold the seven-story, 177,000-square-foot office building at 261 North University Drive to Vision Properties for\n$57.5 million\n.\nJourney Capital hasn’t been a high-profile player in South Florida’s market. The firm, founded in 2023, buys, develops and manages multifamily, industrial and mixed-use properties across the U.S., according to its website. It’s led by CEO Peter Calatozzo.\nPreviously, Calatozzo was with Praedium Group, his LinkedIn shows.\nSouth Florida’s\nmultifamily\ninvestment sales market has experienced an uptick during recent months after a slowdown over the past two years. Sales volume was $4.3 billion last year and $3.4 billion in 2023, down from $9.2 billion in 2022 and $15.4 billion in 2021, according to data from Avison Young. In 2021 and 2022, South Florida became a magnet for out-of-state residents, fueling\nunprecedented\ndemand from tenants and\nrecord\nrent hikes, but in the later years the market\nslowed\ndue to elevated interest rates and\nhefty new supply\n, which tempered tenant demand.\nLast month, FCP paid\n$90 million\nfor the 400-unit Arium Sunrise complex at 1501 Northwest 124th Terrace in Sunrise. That came on the heels of TA Realty buying the 300-unit Bell Pembroke Pines complex at 16700 Sheridan Street in Pembroke Pines for\n$118 million\n.",
    "related_links": [
      "https://therealdeal.com/miami/2017/03/23/falcones-plantation-redevelopment-gets-a-name-plantation-walk/",
      "https://therealdeal.com/tag/art-falcone/",
      "https://therealdeal.com/miami/2015/03/20/bankruptcy-judge-approves-37-7-million-sale-of-fashion-mall/",
      "https://therealdeal.com/miami/2016/12/01/falcones-plantation-fashion-mall-redevelopment-nabs-city-approvals/",
      "https://therealdeal.com/miami/2021/10/20/art-falcones-encore-capital-sells-plantation-walk-office-building-for-58m/",
      "https://therealdeal.com/tag/multifamily/",
      "https://therealdeal.com/miami/2021/08/24/south-florida-apartment-crunch-locals-squeezed-out-as-demand-from-newcomers-leads-to-record-rents/",
      "https://therealdeal.com/miami/2022/04/14/miami-leads-nation-with-58-rent-spike-during-the-pandemic/",
      "https://therealdeal.com/magazine/national-september-2023/hot-summer-sales/",
      "https://therealdeal.com/miami/2025/01/24/after-record-south-florida-rental-completions-lease-ups-slow/",
      "https://therealdeal.com/miami/2025/02/28/pccp-rmr-group-sell-arium-sunrise-rentals-to-fcp-for-90m/",
      "https://therealdeal.com/miami/2025/01/29/bell-partners-sells-pembroke-pines-rentals-to-ta-realty/"
    ],
    "market": "South Florida",
    "published": "Wed, 19 Mar 2025 18:30:00 +0000",
    "published_dt": "2025-03-19T18:30:00+00:00",
    "author": "Lidia Dinkova"
  },
  {
    "url": "https://therealdeal.com/national/phoenix/2025/03/19/tech-billionaire-poised-to-build-1b-village-in-scottsdale/",
    "title": "Tech billionaire-turned-developer poised to build $1B village on Scottsdale thrill park site",
    "subhead": "George Kurtz plans to build 1,200-plus homes, hotel, office north of airport",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 19, 2025, 2:27 PM",
    "pub_date_dt": "2025-03-19T14:27:00",
    "content": "Billionaire George Kurtz has moved ahead with a $1 billion plan to build a 30-acre hotel-office village with more than 1,200 homes on a former amusement park in north Scottsdale.\nThe CEO of cybersecurity firm CrowdStrike is poised to get site plans approved for the 2 million-square-foot project at the former CrackerJax site at 16001 North Scottsdale Road, north of the Scottsdale Airport,\nthe Phoenix Business Journal reported.\nThe Parque, approved by the city in 2023, will include a 223-room hotel, a 150,00-square-foot office building, 40,000 square feet of restaurants, retail and 1,236 homes.\nA first phase would include an 89-unit apartment building and a 70-unit condominium atop four restaurants and shops around a 1.7-acre park.\nThe city’s Development Review board could hear the project, designed by Texas-based Nelsen Partners, as early as Thursday.\nCost and timeline for the project were not disclosed.\n\nKurtz\nbought the former amusement park land\nin 2022 for $55.5 million, or $1.83 million an acre. Through an affiliate, he then purchased the Promenade Shopping Center across the street for $180 million.\nThe Parque is one of a handful of mega mixed-use projects in North Scottsdale\ntaking advantage of abundant land\njust north of Loop 101, according to the Business Journal.\nAxon Enterprise, the maker of Taser electroshock weapons, bought 70 acres for a proposed mixed-use headquarters, but\nthe approved $1.3 billion project stalled\nbecause of neighborhood opposition to nearly 1,900 homes tied to the project.\nScottsdale voters will have a final say in a referendum vote, which caused Axon CEO Rick Smith to threaten to move the company\nto another city\n.\nKurtz cofounded CrowdStrike, based in Austin, Texas. In July, the publicly owned firm issued a faulty update to its security software that crashed millions of Windows computers around the globe, disrupting air travel, banking, broadcasting and other services, for which he apologized.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.bizjournals.com/phoenix/news/2025/03/17/plans-submitted-to-develop-former-crackerjax-site.html",
      "https://www.bizjournals.com/phoenix/news/2022/04/20/tech-billionaire-buys-crackerjax-in-scottsdale.html",
      "https://www.bizjournals.com/phoenix/news/2023/05/26/scottsdale-development-500-acres-construction.html",
      "https://therealdeal.com/national/phoenix/2025/01/20/axon-enterprise-poised-to-pull-headquarters-from-scottsdale/",
      "https://www.bizjournals.com/phoenix/news/2025/02/25/axon-ceo-addresses-headquarters-uncertainty.html",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/national/phoenix/2025/01/20/axon-enterprise-poised-to-pull-headquarters-from-scottsdale/",
      "https://therealdeal.com/national/phoenix/2025/01/17/high-street-mitsui-fudosan-to-build-scottsdale-apartments/",
      "https://therealdeal.com/national/phoenix/2025/01/02/ascentris-george-oliver-buy-acreage-for-scottsdale-offices/"
    ],
    "market": "National",
    "published": "Wed, 19 Mar 2025 18:27:56 +0000",
    "published_dt": "2025-03-19T18:27:56+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/19/louise-sunshine-is-bringing-auctions-to-new-development/",
    "title": "Louise Sunshine bids on power of auctions for new developments",
    "subhead": "Luxury condo guru, Concierge Auctions partner up to pitch developers",
    "authors": "ByJake Indursky",
    "pub_date": "Mar 19, 2025, 2:00 PM",
    "pub_date_dt": "2025-03-19T14:00:00",
    "content": "Real estate auctions have historically been associated with troubled developers, one-of-a-kind mansions and languishing resales.\nBut a new partnership helmed by Louise Sunshine is trying to bridge the upsides of the auction market with the glitzy world of new development sales.\nThe real estate marketing guru and her son Paul are launching the Real Estate Investor Services division, a new development-focused arm of Concierge Auctions intended to complement traditional in-house marketing and sales for luxury developments.\nLouise is joining Concierge full-time after resigning from\nMichael Shvo’s\neponymous firm, which she joined in 2022 to ​​oversee its residential sales and marketing efforts.\nFounded in 2008, the auction house is\nmajority-owned by real estate holding company\nAnywhere Real Estate and auction house Sotheby’s. Concierge counted $4 billion in sales last year and touts its international database of high-net-worth buyers and sellers.\nConcierge claims the most expensive residence ever sold at auction, a Bel-Air estate called\n“The One”, which sold for $141 million in 2022\n. That property was once slated to list for $500 million after the home’s limited liability company defaulted on construction loans, according to the Journal.\nAuctions have become more common in luxury real estate in recent years, but often usher in a lower price than hoped for by the sellers behind the high-end properties, the Wall Street Journal reported last year. An analysis by the outlet found homes sold by Concierge in the first nine months of 2024 sold for\nan average discount of 41 percent\nfrom the list prices.\nBut CEO Chad Roffers pointed to a gap in the market as a focus for the new development-specific division.\n“We have more demand than inventory right now for ultra-luxury [and] luxury multi-family residences,” he said.\n\nTeeing up sales\nThe appeal for developers — or their financial backers — lies in establishing a set timeline for a sale.\n“We can cut a seller’s timeline to 60 days from three to five years,” Roffers said. “That’s invaluable.”\nThe auction market can be tapped at any point in the sales cycle, from launch through final closings, according to Paul, who said he envisions alternating the platform with traditional marketing methods for the same building.\n“We can go from an accelerated sale to conventional marketing as needed by the developer, which sort of eliminates the developer’s risk,” Louise added.\nConcierge will also provide developers a minimum price guarantee by pre-marketing units to its client list to solicit bids ahead of auction day. The firm takes an average of 8 percent buyer’s premium on top of the purchase price, according to its website, but incentivizes early bids by reducing that premium by half.\n“The developer knows going into the process there is already a bid on the table that’s an acceptable price,” Roffers said, likening the process to work by an investment bank leading up to a company’s initial public offering.\nRoffers, who declined to name specific developments working with Concierge, said he expects to auction the first new development inventory later this year when the firm has upcoming auctions in London, Hong Kong, Abu Dhabi and New York.\n",
    "related_links": [
      "https://therealdeal.com/new-york/2022/09/13/louise-sunshine-joins-shvo/",
      "https://therealdeal.com/new-york/2021/11/18/sothebys-realogy-make-winning-bid-for-concierge-auctions/",
      "https://therealdeal.com/la/2022/03/07/fashion-nova-founder-saghian-goes-biggest-gets-the-one/",
      "https://www.wsj.com/real-estate/luxury-homes/luxury-home-auctions-3975e082",
      "https://therealdeal.com/new-york/2021/11/18/sothebys-realogy-make-winning-bid-for-concierge-auctions/",
      "https://therealdeal.com/new-york/2022/09/13/louise-sunshine-joins-shvo/",
      "https://therealdeal.com/new-york/2024/12/10/manhattan-new-devs-outpace-resales/"
    ],
    "market": "National",
    "published": "Wed, 19 Mar 2025 18:00:00 +0000",
    "published_dt": "2025-03-19T18:00:00+00:00",
    "author": "Jake Indursky"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/19/caruso-swings-against-recall-of-la-mayor-karen-bass/",
    "title": "Caruso swings against Bass recall",
    "subhead": "“There is a time and place for politics, but it is not now,” billionaire developer says",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 19, 2025, 1:23 PM",
    "pub_date_dt": "2025-03-19T13:23:00",
    "content": "Billionaire developer Rick Caruso, who poured more than $100 million into a failed bid to defeat Karen Bass for Los Angeles mayor, isn’t shy about bashing the seasoned pol.\nBut the owner of upscale shopping centers fell short of supporting a recall effort against Bass, which has been fueled by discontent over her leadership surrounding the firestorm that burned 7,000 homes and businesses in the Pacific Palisades,\nKTLA 5\nand\nCity News Service\nreported.\n“A mayoral recall right now is not a good idea,” Caruso, who hasn’t ruled out mounting another challenge against Bass for mayor,\nposted on X\n. “This is a time when Los Angeles needs unity, not costly and expensive political distractions.\n“We must rebuild our communities, get people back into their homes, and open businesses that have been closed or lost. That must be our total focus. There is a time and place for politics, but it is not now.”\nBass, under siege since the nearly 24,000-acre\nPalisades Fire\n, faces a recall campaign\nled by Los Angeles realtor Nicole Shanahan\n, former presidential running mate of Robert F. Kennedy Jr. A recall would require 330,000 ballot signatures in four months.\nThe\nrecall effort gained steam\namong opponents who criticized the mayor for traveling to Ghana when the fire erupted on Jan. 7, despite advanced warnings from weather officials that severe winds would create extreme fire conditions.\nConcerns mounted over L.A. fire hydrant issues, low water pressure in the Palisades and resources within the Los Angeles Fire Department.\n\nFirefighting efforts were hampered when\nwater supplies ran out\nas crews tried to save entire neighborhoods.\nSome critics say Bass tried to shift blame for the response\nby firing former LAFD Chief Kristin Crowley\n.\nRumors have swirled\nsince last year\nthat Caruso could return to politics, with another bid for mayor or a candidacy for California governor when Newsom is termed out next year. Caruso also\nlaunched\nSteadfast LA, a private-sector recovery effort, sparking speculation about a possible second mayoral run. He has yet to make an official announcement.\nBass, who is up for reelection in 2026, has already launched her campaign. In an interview with KNX News, the mayor said she would fight any attempts to boot her from office.\n“I would never quit on my city. This is where I was born and raised,” Bass told the radio station. “Did I know that it was a difficult job? Absolutely. Am I ready for the job? Most definitely.”\n—\nDana Bartholomew\n",
    "related_links": [
      "https://ktla.com/news/local-news/businessman-rick-caruso-opposes-effort-to-recall-embattled-l-a-mayor-bass/",
      "https://www.dailynews.com/2025/03/18/rick-caruso-says-effort-to-recall-mayor-karen-bass-is-not-a-good-idea/",
      "https://x.com/RickCarusoLA/status/1902037406007853366",
      "https://www.fire.ca.gov/incidents/2025/1/7/palisades-fire",
      "https://therealdeal.com/la/2025/03/04/who-is-agent-hoping-to-recall-karen-bass/",
      "https://ktla.com/news/local-news/karen-bass-recall-palisades-fire/",
      "https://ktla.com/news/local-news/why-did-fire-hydrants-go-dry-for-crews-fighting-the-palisades-fire/",
      "https://www.dailynews.com/2025/03/14/mayor-bass-approved-a-raise-for-ex-los-angeles-fire-chief-before-bass-fired-her/",
      "https://ktla.com/news/local-news/rick-caruso-may-again-seek-public-office-los-angeles-times-reports/",
      "https://therealdeal.com/la/2025/02/04/rick-caruso-sets-up-indie-group-for-la-wildfire-rebuild/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2025/03/04/la-realtor-spearheads-bid-to-oust-mayor-karen-bass/",
      "https://therealdeal.com/la/2025/03/04/who-is-agent-hoping-to-recall-karen-bass/",
      "https://therealdeal.com/la/2025/03/05/bass-recall-effort-taps-major-funding-from-nicole-shanahan/"
    ],
    "market": "Los Angeles",
    "published": "Wed, 19 Mar 2025 17:23:58 +0000",
    "published_dt": "2025-03-19T17:23:58+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/19/miami-beach-mayors-eviction-effort-against-o-cinema-fizzles/",
    "title": "Miami Beach Mayor Steven Meiner’s push to evict O Cinema fizzles",
    "subhead": "Five city commissioners indicated they would not support evicting nonprofit arthouse over Gaza War doc screening",
    "authors": "ByFrancisco Alvarado",
    "pub_date": "Mar 19, 2025, 1:21 PM",
    "pub_date_dt": "2025-03-19T13:21:00",
    "content": "Once five Miami Beach city commissioners indicated they would not support evicting O Cinema, Mayor Steven Meiner called off his effort to kick out the nonprofit art house.\nOn Wednesday, Meiner withdrew his resolution seeking to cancel Miami Beach’s lease as well as grants to\nO Cinema\nafter Vice-Mayor Tanya Bhatt and commissioners Laura Dominguez, Alex Fernandez, Joseph Magazine and Kristen Rosen Gonzalez gave speeches about why\nMiami Beach\nshouldn’t be booting tenants from city-owned buildings for free speech content that some politicians find offensive.\nThe theater is in the old Miami Beach city hall, a historic\nArt Deco\nbuilding at 1130\nWashington Avenue\n.\nMeiner sought to cancel a two-year lease extension that the city commission granted O Cinema over the summer because the theater showed screenings of “No Other Land.”\nThe Oscar winning documentary chronicles life in the West Bank during the Gaza War and events that led to it. Meiner was upset that O Cinema’s leadership went ahead with the screenings after initially acquiescing to his demand not to show the film, directed by Palestinian activist Basel Adra and Israeli journalist Yuval Abraham.\nLast week, Meiner condemned “No Other Land” as “a false one-sided propaganda attack on the Jewish people.”\n\nDuring Wednesday’s meeting, Meiner claimed his reaction was rooted in ensuring public safety for the city’s Jewish constituents amid rising anti-Semitism across the globe because of Israel’s ongoing destruction of Palestine since Hamas terrorists killed more than 1,400 Israelis and kidnapped 240 more on Oct. 7, 2023.\n“Throughout history, there’s been different excuses for hating Jews,” Meiner said. “Sometimes it’s because Jews are too successful, sometimes because they’re too poor. Now it’s the state of Israel. It doesn’t matter. Every generation it morphs into something else. It’s just a convenient excuse. And that’s what I was trying to highlight.”\nStill, a majority of speakers during the meeting’s public comments voiced opposition to Meiner’s push to evict O Cinema, calling his actions government censorship.\n“We saw democracy in action,” O Cinema co-founder Kareem Tabsch told\nThe Real Deal\nfollowing the meeting. “There was an outpouring of support for O Cinema, and I think Meiner did the right thing. I respect his viewpoint and decisions.…It’s not the government’s role to dictate what art organizations should be showing or not showing.”\nA majority of the city commission concurred with Tabsch’s view. “The First Amendment is clear,” commissioner Fernandez said during the meeting. “The government must never censor artistic expression even when it is controversial or deeply offensive.”\nVice-Mayor Bhatt noted that O Cinema has shown more than 50 pro-Israel films by Jewish filmmakers, hosts the Miami Jewish Film Festival and screened a 12-hour documentary about the Holocaust. “To silence that voice does more damage than almost anything I can think of,” Bhatt said. “I will tell you that I’m not censoring anybody.”",
    "related_links": [
      "https://therealdeal.com/miami/2025/03/14/miami-beach-mayor-steven-meiner-threatens-to-evict-o-cinema/",
      "https://therealdeal.com/tag/miami-beach/",
      "https://therealdeal.com/tag/art-deco/",
      "https://therealdeal.com/tag/washington-avenue/"
    ],
    "market": "South Florida",
    "published": "Wed, 19 Mar 2025 17:21:00 +0000",
    "published_dt": "2025-03-19T17:21:00+00:00",
    "author": "Francisco Alvarado"
  },
  {
    "url": "https://therealdeal.com/texas/austin/2025/03/19/google-to-move-into-downtown-austins-sail-tower/",
    "title": "Google finally moving into Austin’s Sail Tower this year",
    "subhead": "Downtown office building has sat empty since its delivery in 2022",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 19, 2025, 12:39 PM",
    "pub_date_dt": "2025-03-19T12:39:00",
    "content": "Austin’s “Sail Tower” has been empty since 2022.\nBut by the end of the year, Google will move into the downtown office building it agreed to lease in 2019, KVUE\nreported\n.\nThe tech giant had delayed moving employees into the 35-story, 804,000-square-foot building after the pandemic. Google didn’t provide a specific timeline but confirmed its plan to move in later this year. The full-building lease expires in 2038.\nGoogle has eaten more than $53 million a year by paying for the trophy property lease it hasn’t used, the Austin Business Journal estimated.\nGoogle employees\ncurrently work\nin East Austin’s Saltillo development or at the skyscraper at 500 West 2nd Street, next to the Sail Tower, according to the Austin Business Journal.\n\nThe Sail Tower, at 601 West 2nd Street, traded hands in December, when developer Trammell Crow Company sold it to Atlanta-based Cousins Properties for $521.8 million.\nAt the time, Cousins’ Tim Hendricks said he “felt very comfortable in Google and Google’s plans for the city of Austin” despite the fact that the company hadn’t moved into the property at the time of the sale, Austin Business Journal reported.\nIndustry experts are hopeful that return to office mandates from major companies like Google will buoy the troubled office market, which has suffered since the pandemic made remote work the norm.\nWhile Austin’s office market vacancy has slowed its rapid acceleration, it still sat at 25.2 percent at the end of last year, JLL\nreported\n. There’s still nearly 3 million square feet of office space under construction in Austin, but the development pipeline is tightening, JLL said.\n–Jess Hardin\n",
    "related_links": [
      "https://www.kvue.com/article/news/local/google-moving-into-austin-sail-building/269-cf139055-8927-4fa5-b336-58fcdf2414d5",
      "https://www.bizjournals.com/austin/news/2025/03/18/google-downtown-austin-sail-tower-occupy.html",
      "https://www.us.jll.com/content/dam/jll-com/documents/pdf/research/americas/us/q4-2024-office-market-dynamics/jll-us-office-market-dynamics-q4-2024-austin.pdf",
      "https://therealdeal.com/texas/austin/2025/03/13/meta-platforms-spending-3m-on-austin-office-buildout/",
      "https://therealdeal.com/texas/austin/2025/02/06/realtor-com-moving-headquarters-to-texas-from-california/",
      "https://therealdeal.com/texas/austin/2025/01/02/austins-biggest-office-leases-of-2024/"
    ],
    "market": "Texas",
    "published": "Wed, 19 Mar 2025 16:39:15 +0000",
    "published_dt": "2025-03-19T16:39:15+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/19/ballys-launches-chicago-casino-fundraising-workaround/",
    "title": "Bally’s paves $195M workaround as diversity fundraising stalls",
    "subhead": "Firm raised $83M via alternative method after SEC paused IPO",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 19, 2025, 12:30 PM",
    "pub_date_dt": "2025-03-19T12:30:00",
    "content": "Bally’s is hedging a bet on its controversial diversity-focused fundraising plan for its $1.7 billion Chicago casino development on the former Tribune newspaper printing plant site in River West.\nBally’s Chicago is now seeking to raise $195 million through a private share sale, as the Securities and Exchange Commission has halted an effort to raise $250 million through an initial public offering exclusively targeted at women and minority investors, the Chicago Business Journal\nreported\n.\nThe shift in fundraising methods comes as the company, a subsidiary of Rhode Island-based Bally’s Corp., is navigating significant regulatory challenges for its project, which is set to become the Windy City’s first full-fledged permanent gambling emporium.\nLast summer, Bally’s Chicago garnered attention with plans for a $250 million IPO exclusively targeting qualified female and minority investors. This initiative was prompted by a mandate from the city of Chicago, stipulating that 25 percent of the new casino must be owned by minorities and women. However, the SEC has yet to approve the IPO, citing the need for updated audited financials from Bally’s Chicago.\n\nIn response to the regulatory delay, Bally’s launched a private placement offering, which has already secured over $83 million from 270 accredited investors, the outlet reported, citing the firm’s financial disclosures. This approach is running alongside the stalled public offering and includes individuals who meet the criteria specified by Chicago’s ownership mandate, according to Bally’s spokesperson Richard Land.\nLegal hurdles loom, however. The IPO has faced federal court challenges, with accusations of discrimination leveled by plaintiffs supported by groups like the American Alliance for Equal Rights and the Liberty Justice Center. These lawsuits argue that the IPO unfairly favors minority and female investors, potentially excluding others from participating in the investment opportunity.\nMeanwhile, Bally’s continues to refund deposits to potential IPO investors as it strives to gain SEC clearance. The company remains optimistic about its casino project, which has recently received site plan approval and is slated to open in September 2026. The complex promises a 500-room hotel, entertainment venues, multiple dining options, and public spaces, and aims to redefine Chicago’s hospitality and gaming scene.\n— Sam Lounsberry\n",
    "related_links": [
      "https://www.bizjournals.com/chicago/news/2025/03/18/ballys-seeks-195m-from-private-investors.html",
      "https://therealdeal.com/chicago/2025/03/03/ballys-chicago-casino-hits-roadblock-as-sec-documents-expired/",
      "https://therealdeal.com/chicago/2024/07/12/ballys-lands-940m-for-chicago-casino-development/",
      "https://therealdeal.com/chicago/2025/01/15/ballys-seeks-big-property-tax-break-for-chicago-casino/"
    ],
    "market": "Chicago",
    "published": "Wed, 19 Mar 2025 16:30:00 +0000",
    "published_dt": "2025-03-19T16:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/19/post-investment-group-buys-apartments-in-palmdale-for-71m/",
    "title": "Post Investment Group pays $71M for Chaparral Apartments in Palmdale",
    "subhead": "KeyBank provided $52.6M loan to the Beverly Hills-based firm",
    "authors": "ByAbigail Nehring",
    "pub_date": "Mar 19, 2025, 12:00 PM",
    "pub_date_dt": "2025-03-19T12:00:00",
    "content": "Jason Post’s Post Investment Group planted a flag in Antelope Valley north of Los Angeles,\nThe Real Deal\nhas learned.\nThe Beverly Hills-based investor paid $71 million to buy Chaparral Apartments, a 296-unit rental complex spanning 16 buildings at 38441 5th Street West in the desert city of Palmdale, according to property records filed in Los Angeles County earlier this month.\nThe deal values the property at just under $240,000 per unit.\nScott Pickett, the head of Post Investment’s multifamily division, did not immediately respond to a request for comment. The seller, a shell company registered in Nevada linked to George and Richard Brock, could not be reached for comment.\n\nKeyBank Real Estate Capital provided a $52.6 million loan to Post Investment for the acquisition, according to property records. It comes with a seven-year term. A spokesperson for the lender declined to comment.\nNorthmarq’s Steven Goldstein, Jeff Benson and Sam Neumark brokered the deal.\nPost Investment also recently popped up in the North Hollywood multifamily market, purchasing a 236-unit apartment complex at 12300 Sherman Way with Walker &amp; Dunlop Investment Partners last year for $44 million,\nas TRD previously reported\n.\n",
    "related_links": [
      "https://therealdeal.com/la/2024/12/10/post-and-walker-dunlop-buy-noho-apartment-complex-for-44m/",
      "https://therealdeal.com/la/2024/12/10/post-and-walker-dunlop-buy-noho-apartment-complex-for-44m/",
      "https://therealdeal.com/la/2021/07/09/ravello-nabs-55m-construction-loan-for-palmdale-affordable-project/",
      "https://therealdeal.com/la/2022/07/15/merlone-geier-sells-second-palmdale-mall-in-a-month/"
    ],
    "market": "Los Angeles",
    "published": "Wed, 19 Mar 2025 16:00:00 +0000",
    "published_dt": "2025-03-19T16:00:00+00:00",
    "author": "Abigail Nehring"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/18/4terra-srm-plan-to-swap-offices-for-apartments-near-uc-berkeley/",
    "title": "4Terra, SRM plan to swap offices for apartments near UC Berkeley",
    "subhead": "JV would tear down a three-story office building to build 201 apartments",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 8:30 PM",
    "pub_date_dt": "2025-03-18T20:30:00",
    "content": "4Terra Investments and SRM Associates want to replace a three-story office building with a 201-unit apartment building near UC Berkeley.\nThe San Francisco-based developer and Alameda-based property owner have filed plans to build the eight-story building at 2100 Milvia Street, two blocks west of campus,\nthe San Francisco Business Times reported\n. The offices would be demolished.\nPlans call for a 209,000-square-foot building with 3,750 square feet of ground-floor commercial space. Of the project’s 201 apartments, four would be live-work spaces and 11 units would be set aside as affordable.\nThe developers would employ Senate Bill 330 to streamline approvals. A Berkeley Design Review Committee is slated to review the project on Wednesday.\nBerkeley, a city once challenging to build in, has approved dozens of residential towers in Downtown to meet a local housing crunch, while rezoning its\nSouthside\nto double the development potential.\nUC Berkeley provides housing for a quarter of its students, the lowest of all UC campuses.\n\nSRM Associates purchased the office building on Milvia in 1996 for an undisclosed price.\n4Terra Investments, founded in 2013 by Amir Massih, has built more than 30,000 apartments and student-oriented units across Northern California, according to its website, LinkedIn page and state business records.\n4Terra is behind several other Bay Area projects, including\na seven-story, 75-unit project at\n2550 Shattuck\nin Berkeley and a 169-unit project called the Kittredge at an unknown location in Downtown Berkeley, according to the Business Times.\nThe developer also plans to build a 203-unit apartment building at\n400 Divisadero in San Francisco\n, on the site of a former car wash.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.bizjournals.com/sanfrancisco/news/2025/03/17/berkeley-4terra-2100-milvia-office-residential-srm.html",
      "https://www.bizjournals.com/sanfrancisco/news/2023/11/22/berkeley-campus-housing-taller-buildings.html",
      "https://www.bizjournals.com/sanfrancisco/news/2025/01/21/berkeley-sb-230-2550-shattuck-apartment-4terrra.html",
      "https://www.bizjournals.com/sanfrancisco/news/2025/01/21/berkeley-sb-230-2550-shattuck-apartment-4terrra.html",
      "https://www.bizjournals.com/sanfrancisco/news/2024/06/17/4terra-400-divisadero-nopa-touchless-car-wash-sf.html",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/02/21/read-acquires-98-unit-berkeley-building-for-32m-38-off/",
      "https://therealdeal.com/san-francisco/2025/01/22/nx-ventures-advances-plan-for-apartment-building-in-berkeley/",
      "https://therealdeal.com/san-francisco/2023/03/23/six-proposed-highrises-would-tower-over-downtown-berkeley/"
    ],
    "market": "San Francisco",
    "published": "Wed, 19 Mar 2025 00:30:00 +0000",
    "published_dt": "2025-03-19T00:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/18/developers-trim-koreatown-vision-by-32-floors/",
    "title": "Developers trim Koreatown vision by 32 floors",
    "subhead": "Townline, Forme advance with 318-unit apartment complex in Koreatown",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 8:27 PM",
    "pub_date_dt": "2025-03-18T20:27:00",
    "content": "Townline and Forme Development have trimmed the towering height of a proposed apartment building in Koreatown, which won a preliminary nod for eight stories.\nThe Los Angeles City Planning Commission approved the latest plan by the Vancouver-based developers for a 318-unit complex at 550 South Shatto Place,\nUrbanize Los Angeles reported\n.\nInitial plans by the Canadian joint venture called for\na 32-story building\nin 2018 and a\n40-story, 367-unit tower\napproved by the City Council three years later. The apartments would be built next to the former First English Evangelical Lutheran Church at Shatto and 6th Street.\nIt’s not clear why the developers downsized the project.\nPlans call for an eight-story building with 318 studio, one- and two-bedroom apartments above a two-level parking garage for 194 cars. About 21,000 square feet of shops, restaurants or offices would partially take up the 89-year-old church building included in the project.\nThe developers employed density bonus incentives to permit a taller building than allowed by zoning rules in exchange for 35 affordable apartments for\nvery low-income households.\nThe beige complex, designed by Downtown-based KTGY, would include large windows and external balconies, with floor-to-ceiling windows on the ground floor, according to a rendering.\n\nOmgivning, based in Elysian Park, designed the adaptive-reuse of the\nSpanish Colonial Revival church, built in 1936\nand later used as a gym by the New Covenant Academy, a private school.\nA cost and timeline for the project were not disclosed. Construction is expected to take 18 months.\nTownline and Forme Development have also teamed up for a proposed 23-story, 178-unit highrise at 942 Broadway, in Chinatown, which was\nslated to break ground in 2021\n, according to Urbanize. It remains a dirt lot.\nTownline, founded by Rick Ilich in 1981, has built a range of residential properties, from multifamily to townhomes and single-family homes, according to its LinkedIn page.\nForme Development, founded by Damon Chan in 2017, focuses on mixed-use, high-rise multi-family residential, retail and office buildings along the West Coast, with offices in Vancouver and Los Angeles.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://la.urbanize.city/post/scaled-down-development-gets-approval-550-s-shatto-pl-koreatown",
      "https://la.urbanize.city/post/32-story-tower-planned-6th-shatto",
      "https://therealdeal.com/la/2021/10/26/koreatown-tower-trims-transient-units-grows-to-40-stories-gets-city-council-greenlight/",
      "https://la.urbanize.city/post/here-are-californias-affordable-housing-income-limits-2024",
      "https://planning.lacity.gov/eir/SCEAs/documents/Soul/files/II%20-%20Project%20Description.pdf",
      "https://la.urbanize.city/post/chinatown-downtown-942-broadway-harmony-construction-apartments",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2021/10/26/koreatown-tower-trims-transient-units-grows-to-40-stories-gets-city-council-greenlight/",
      "https://therealdeal.com/la/2021/04/23/41-story-koreatown-tower-project-clears-key-city-hurdle/",
      "https://therealdeal.com/la/2025/03/12/jamison-scores-50m-refi-for-koreatown-apartment-complex/"
    ],
    "market": "Los Angeles",
    "published": "Wed, 19 Mar 2025 00:27:56 +0000",
    "published_dt": "2025-03-19T00:27:56+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/18/savills-consolidates-expands-with-new-century-city-digs/",
    "title": "Savills to consolidate DTLA, Westwood offices in Century City",
    "subhead": "Brokerage takes 20K sf full floor at 1900 Avenue of the Stars",
    "authors": "ByLauren Elkies Schram",
    "pub_date": "Mar 18, 2025, 7:30 PM",
    "pub_date_dt": "2025-03-18T19:30:00",
    "content": "Savills is consolidating its two Los Angeles offices — one in Downtown and the other in Westwood — and expanding with a move to around 20,000 square feet in Century City.\nThe tenant-side brokerage plans to take the entire 11th floor at Anderson Real Estate’s 1900 Avenue of the Stars sometime this summer. It will relocate from 7,800 square feet at 777 South Figueroa Street and 9,973 square feet at 1100 Glendon Avenue, according to a person with knowledge of the deal.\nThe length of the lease, a Savills spokesperson said, is “multi-year.”\nAsking rent in the building ranges from $6.50 to $7.50, according to a spokesperson for CBRE.\nThe Century City building, a 28-story, 627,000-square-foot, Class-A high-rise office building, is undergoing a $100 million redevelopment together with 1800 Avenue of the Stars by owner\nCentury City-based\nAnderson. The redevelopment will be completed in the second quarter, per the Anderson spokesperson.\nThe new digs aim to “create a new, experiential office environment,” Savills Los Angeles region President Josh Gorin, who oversaw lease negotiations for the firm, said in a statement.\n\nPeter Best of LA Realty Partners and David Freitag, Kayla Rix and Rocky Binswanger of CBRE represented the building in lease negotiations. Best didn’t respond to a request for comment.\nWhen asked why Savills would want to leave Downtown L.A., Gorin said via a spokesperson: “Century City offers a prime location that puts us near key clients in industries such as entertainment, legal, financial, and other professional services firms.”\nOffice leasing bounced back across L.A. County at the end of last year, though the bulk of the deals were renewals.\nThe L.A. office market had its best quarter since the start of the pandemic in the fourth quarter, with 3.9 million square feet leased, from 1.7 million square feet a year earlier, according to Savills data.\nAmong the top 10 transactions in Q4, one was in Century City, according to a list from Savills. Loeb &amp; Loeb renewed its 130,000-square-foot space at 101000 Santa Monica Boulevard. Savills’ 40,000-person operations span seven countries.\n",
    "related_links": [
      "https://therealdeal.com/la/2024/11/26/anderson-signs-lease-renewal-for-fat-brands-beverly-hills-hq/",
      "https://therealdeal.com/la/2024/11/26/anderson-signs-lease-renewal-for-fat-brands-beverly-hills-hq/",
      "https://therealdeal.com/la/2024/04/02/jmb-gets-575m-loan-for-century-city-office-project/",
      "https://therealdeal.com/la/2024/01/30/office-vacancy-ticks-up-in-tony-century-city/"
    ],
    "market": "Los Angeles",
    "published": "Tue, 18 Mar 2025 23:30:00 +0000",
    "published_dt": "2025-03-18T23:30:00+00:00",
    "author": "Lauren Elkies Schram"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/18/investors-buy-distressed-chicago-ambassador-hotel-at-discount/",
    "title": "Investors snag distressed Chicago Ambassador Hotel at big discount",
    "subhead": "Gold Coast hotel changed hands after previous owner defaulted on $38.5M following pandemic shutdown",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 6:30 PM",
    "pub_date_dt": "2025-03-18T18:30:00",
    "content": "A group of high net worth investors has purchased the historic Ambassador Chicago Hotel out of receivership after years of financial distress for the Gold Coast landmark.\nA venture managed by Wheeling-based investor Marsha Forsythe acquired the 285-key property at 1301 North State Parkway, Crain’s\nreported\n, resolving a 2023 foreclosure lawsuit that accused the hotel’s previous owner — an affiliate of Chinese investment firm Gaw Capital — of defaulting on a $38.5 million loan when it matured last May.\nThe purchase price was not disclosed, but court records show the buyer reached a deal last summer to acquire the hotel for $30.5 million, or roughly $107,000 per key. It’s a sharp drop from the $60 million Gaw Capital paid for it in 2016.\nThe buyers have added the Ambassador to a cluster of independently managed hotels operated by the Chicago Hotel Collection, which also manages three other properties downtown and in Wrigleyville.\nSeller Gaw Capital invested $11 million in renovations and rebranded the hotel under the Hyatt Joie de Vivre collection in 2020.\n\nThe pandemic forced the hotel to shut down for nearly a year, and it struggled to recover amid a slow rebound for the city’s hospitality sector.\nDowntown Chicago hotels remain below pre-pandemic levels, when adjusted for inflation, despite some signs of a recovery. Revenue per available room was 11 percent higher last year than in 2019, but inflation-adjusted figures show the sector still lagging, according to CoStar.\nThe buyers must stabilize the hotel’s operations fast if they want to turn a profit. The hotel lost $1.2 million last year on $13.9 million in revenue, according to CMBS loan data from Bloomberg.\nThe Ambassador is now the largest hotel in the Chicago Hotel Collection’s portfolio. The company hasn’t revealed renovation plans but has stated the ownership will “honor the hotel’s storied legacy” while introducing upgrades.\n— Judah Duke\n",
    "related_links": [
      "https://www.chicagobusiness.com/commercial-real-estate/investors-buy-distressed-ambassador-hotel-out-receivership",
      "https://therealdeal.com/chicago/2025/03/18/chicago-approves-lgbtq-hotel-in-northalsted/",
      "https://therealdeal.com/chicago/2025/03/07/kim-kardashians-skims-opening-first-store-in-chicago/",
      "https://therealdeal.com/chicago/2025/03/10/gold-coast-penthouse-is-priciest-chicago-home-sale-this-year/"
    ],
    "market": "Chicago",
    "published": "Tue, 18 Mar 2025 22:30:00 +0000",
    "published_dt": "2025-03-18T22:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/18/two-ai-companies-sign-on-at-swigs-soma-building/",
    "title": "Two AI companies sign on at Swig’s 501 Second Street",
    "subhead": "LangChain, unitQ take combined 20,000 sf in SoMa, indicating AI demand in SF",
    "authors": "ByEmily Landes",
    "pub_date": "Mar 18, 2025, 6:30 PM",
    "pub_date_dt": "2025-03-18T18:30:00",
    "content": "The Swig Company has signed two new artificial intelligence tenants at 501 Second Street in SoMa, for nearly 20,000 square feet combined, according to a press release from the San Francisco-based owner and developer.\nLangChain, an open-source framework for building applications using large language models, is taking 11,800 square feet in the seven-story 200,000-square-foot former warehouse, while unitQ, an AI-enabled product quality and user experience analytics platform, has signed on for 7,500 square feet.\nA Swig representative said that the company could not comment on specific lease terms like length, price per square foot and tenant improvements, but did say unitQ moved in in February, while LangChain is expected to do so May 1.\nCory Kristoff, Swig’s director of leasing, said in a statement that the company was happy to welcome “two San Francisco-based enterprises advancing the application of artificial intelligence in business” and that it looked forward to “supporting their future growth.”\nMike McCarthy, Brian McCarthy and Maddie Meyersieck of Transwestern represented Swig in both transactions. They did not immediately reply to a request for comment via a spokesperson.\nA Transwestern marketing page for the property indicates that the recently snagged LangChain space is Suite 120, which is located directly off the lobby and has two large conference rooms, five smaller huddle rooms, a private shower, an open kitchen/dining area and 16-foot-high ceilings. The unitQ space appears to be Suite 212, which has 10 conference rooms and an open kitchen. A Swig representative would not confirm the suite numbers.\nThere are still seven vacant suites in the building totaling about 50,000 square feet, according to the site, which also shows three of those have been undergoing spec suite renovations. They will be delivered in April, Swig confirmed.\n\nBlake Walker and Caroline O’Loughlin Livermore of CBRE represented LangChain. Walker said LangChain would be moving into a furnished space, which “minimized disruption” so they could focus on their business and give their team “an office they enjoy coming into.”\n“The decision to move to 501 Second Street was driven by favorable economics, term flexibility, and a high-quality workspace that supports their growing team,” he said.\nWill Cassriel and Grant Dettmer of JLL represented unitQ. They did not immediately reply to a request for comment via a representative.\nAI has been touted as the likely taker for a substantial portion of San Francisco’s one-third-empty office space. There were\n86 AI leases signed last year\nin the city, according to Kilroy analysis, with AI expected to drive another 1 million to 1.5 million square feet in absorption this year. Tech office leasing was up 17 percent last year,\ndriven by AI\ndemand, according to CBRE.\nAI companies are “absolutely” having an impact on the office market, Walker said, adding that with 5 million square feet of leased space, the city’s 200 AI companies represent nearly 9% of the total occupied office space in the city.\n“These AI companies recognize the strategic value of being in San Francisco—not just for access to talent and investors, but for building in-office cultures that will help shape the future of downtown,” he said.\nIf more of these AI companies come to SoMa, it would be a much-needed boost to the neighborhood, which has been\nhit harder than other SF markets\nby tech’s office retreat since the pandemic. At the end of 2024, SoMa was 40 percent vacant, compared to 36.5 percent citywide, according to CBRE data.\n",
    "related_links": [
      "https://therealdeal.com/san-francisco/2025/02/14/sfs-86-ai-office-leases-last-year-driving-rebound/",
      "https://therealdeal.com/san-francisco/2024/12/23/tech-office-leasing-jumps-17-in-sf-half-driven-by-ai-firms/",
      "https://therealdeal.com/san-francisco/2024/10/18/where-are-new-hot-spots-in-san-francisco-office-market/",
      "https://therealdeal.com/san-francisco/2025/02/14/sfs-86-ai-office-leases-last-year-driving-rebound/",
      "https://therealdeal.com/san-francisco/2024/12/23/tech-office-leasing-jumps-17-in-sf-half-driven-by-ai-firms/",
      "https://therealdeal.com/san-francisco/2024/10/18/where-are-new-hot-spots-in-san-francisco-office-market/"
    ],
    "market": "San Francisco",
    "published": "Tue, 18 Mar 2025 22:30:00 +0000",
    "published_dt": "2025-03-18T22:30:00+00:00",
    "author": "Emily Landes"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/18/haley-hospitality-buys-hotel-in-laguna-hills-for-17m/",
    "title": "Haley Hospitality buys 121-room hotel in Laguna Hills for $17M",
    "subhead": "Deal comes after investor’s OC hotel deal with 107% return",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 5:30 PM",
    "pub_date_dt": "2025-03-18T17:30:00",
    "content": "Haley Hospitality Enterprises has snapped up a 121-room hotel in Laguna Hills for nearly $17 million after selling a hotel in Costa Mesa at a hefty profit for a hotel-to-residential conversion.\nThe Lake Forest-based hospitality firm led by Bhavesh Ahir bought the three-story Laguna Hills Lodge at 23932 Paseo De Valencia,\nthe Orange County Business Journal\nreported, citing CoStar. The seller was locally based LHMLP.\nThe deal works out to nearly $140,500 per room. Brokers Oliver Shah and Justin Myers of Atlas Hospitality Group represented the buyers. It’s not clear what LHMLP paid for the property, and when.\nThe 87,500-square-foot economy class hotel, built in 1968, is near Interstate 5 at El Toro Road. Its rooms were recently offered for discount rates for refugees of January’s fires in Pacific Palisades and Altadena.\nHotel sales in central and south OC have cooled, according to CoStar. Sales between Newport Beach and Dana Point were $125 million during the last “volume year,” compared to a three-year average of $340 million a year.\nThe market didn’t prevent Haley from doing well in its sale late last year of a 120-room Travelodge by Wyndham Orange County Airport/ Costa Mesa at 1400 Bristol Street\nIn December, the county agreed to buy the Travelodge from Haley for conversion into homeless housing under the state’s\nProject Homekey program\n. The hotel purchase and conversion into 78 supported apartments was to cost\n$45 million\n.\n\nThe $45 million redevelopment project, dubbed Homekey Bristol, included a $4 million contribution from Costa Mesa and $3 million from neighboring Newport Beach. Orange County kicked in $7 million and nearly 50 project-based vouchers. The grants totalled\n$14 million\n.\nThe bulk of the money came from a Project Homekey grant from the state Department of Housing and Community Development, which kicked in\n$29 million\nfor the project led by American Family Housing. The Midway City-based nonprofit developer was to revamp the motel and run it as supportive housing.\nSuch grants generally cover the purchase of the property. In the case of the Travelodge, that means Haley likely sold the 120-room hotel for $29 million, or $241,667 per room.\nHaley Hospitality bought the Travelodge, built in 1970, in 2021 for\n$14 million\n, or $116,667 per room, according to the Central OC Times. The purchase came at the height of the pandemic, when the\nhotel industry tanked\nwhile\ntens of thousands of rooms\nwent dark.\nThree years later, the county, via a grant from the state, bought the 54-year-old motor inn for a 107 percent markup for its last traded price. And Haley walked away with a windfall.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.ocbj.com/real-estate/orange-county-companies-exchange-laguna-hills-lodge/",
      "https://therealdeal.com/la/2022/08/29/project-homekey-to-pump-452m-into-la-market/",
      "https://www.ocregister.com/2024/08/22/costa-mesa-motel-will-be-converted-into-supportive-housing-with-29-million-state-grant/",
      "https://therealdeal.com/la/2024/12/19/oc-to-buy-travelodge-motel-in-costa-mesa-for-project-homekey/",
      "https://therealdeal.com/la/2024/08/26/american-family-housing-to-convert-costa-mesa-motel-to-homes/",
      "https://centraloctimes.com/stories/619309404-haley-hospitality-enterprises-llc-purchases-1400-bristol-st-costa-mesa-for-14m",
      "https://therealdeal.com/magazine/national-february-2021/check-out-anytime-you-like/",
      "https://therealdeal.com/new-york/2022/10/25/lights-out-why-more-than-10000-hotel-rooms-remain-closed/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2024/12/19/oc-to-buy-travelodge-motel-in-costa-mesa-for-project-homekey/",
      "https://therealdeal.com/la/2024/08/26/american-family-housing-to-convert-costa-mesa-motel-to-homes/",
      "https://therealdeal.com/la/2024/02/02/shangri-la-industries-loses-homekey-sites-to-receiverships/"
    ],
    "market": "Los Angeles",
    "published": "Tue, 18 Mar 2025 21:30:00 +0000",
    "published_dt": "2025-03-18T21:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/18/bullet-train-battle-could-impede-dallas-convention-center-project/",
    "title": "DFW bullet train threatens to derail convention center",
    "subhead": "Design plans still up in the air months after groundbreaking ceremony",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 5:30 PM",
    "pub_date_dt": "2025-03-18T17:30:00",
    "content": "A proposed high-speed rail line connecting Dallas and Fort Worth is throwing a wrench in plans\nfor Dallas’ new convention center.\nNearly a year after the city\ncelebrated the groundbreaking\nof the $3.7 billion expansion of the Kay Bailey Hutchison Convention Center, Hunt Realty proposed shifting the project toward Reunion Tower, the site of a\n$5 billion redevelopment project\nby Hunt, the Dallas Morning News\nreported\n.\nAt issue is the $6 billion high-speed rail line, which is being spearheaded by the North Central Texas Council of Governments.\nHunt has been trying to kill the project for years, arguing it would impede the Reunion redevelopment, which is set to include thousands of multifamily units, a hotel, office and retail, since the track will be seven stories high. Economic analyst the Perryman Group conducted a study that validated Hunt’s fears and found the train could lead to the closing of the Hyatt and billions in losses for the city.\n\nProponents of the rail line claim moving the convention center would delay the opening of the facility and stymie the development of the train, which the North Central Texas Council of Governments has spent years planning.\nHunt president Colin Fitzgibbons said in a statement that he heard the city was still exploring location options for the convention center. Although a groundbreaking ceremony was held last year, the convention center design hasn’t been finalized; plans for the facility have shifted multiple times.\nConcerns about the train project compelled Dallas City Council to back an alternative route for the train last summer; officials said they’d revisit the issue after reviewing the economic impact of various high-speed routes.\nHunt is also the developer behind NorthEnd, a $5 billion mixed-use development that will include a\n$500 million campus\nfor Goldman Sachs.\n–Jess Hardin\n",
    "related_links": [
      "https://www.dallasnews.com/news/2024/06/26/dallas-37b-convention-center-expansion-underway/",
      "https://therealdeal.com/texas/dallas/2023/12/15/hunt-pouring-5b-into-redevelopment-of-reunion-tower-area/",
      "https://www.dallasnews.com/business/real-estate/2025/03/17/could-dallas-convention-center-move-near-reunion-tower-hunt-realty-presents-plan-to-city/",
      "https://therealdeal.com/texas/dallas/2023/10/10/goldman-sachs-starts-500m-dallas-campus/",
      "https://therealdeal.com/texas/dallas/2023/10/10/goldman-sachs-starts-500m-dallas-campus/",
      "https://therealdeal.com/magazine/october-2024/wall-to-yall/",
      "https://therealdeal.com/texas/dallas/2023/12/15/hunt-pouring-5b-into-redevelopment-of-reunion-tower-area/"
    ],
    "market": "Texas",
    "published": "Tue, 18 Mar 2025 21:30:00 +0000",
    "published_dt": "2025-03-18T21:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/18/santana-row-gets-in-on-ai-office-rush/",
    "title": "Santana Row gets in on AI office rush",
    "subhead": "Federal Realty inks leases for Etched, Securiti.ai in upscale San Jose district",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 5:00 PM",
    "pub_date_dt": "2025-03-18T17:00:00",
    "content": "Artificial intelligence firms are moving into San Jose’s upscale Santana Row.\nEtched, based in Cupertino, and Securiti.ai, based in San Jose, leased a combined 60,400 square feet in the One Santa West building at 3155 Olsen Drive,\nthe San Jose Mercury News reported\n.\nTerms of the separate deals with landlord Federal Realty Investment Trust, based in Maryland, developer and principal owner of the mixed-use Santa Row district, were not disclosed.\nEtched, which makes specialty AI semiconductor chips, leased the 49,500-square-foot second floor.\nSecuriti.ai, which provides software services to allow for safer use of artificial intelligence and data, leased 10,900 square feet on the third floor.\nWith these deals, the 375,000-square-foot One Santana West is now 80 percent leased, according to Jan Sweetnam, chief investment officer for Federal Realty.\n“Santana West is ideal for companies seeking a modern and efficient workspace and the deepest set of amenities and services available,” Sweetnam told the Mercury News.\n\nThe AI tech leases occurred after the real estate investment trust pivoted from its original strategy to lease the entire building to a single tenant.\nAfter Federal Realty decided to make chunks of the offices available to separate tenants, One Santana West began to draw firms interested in flexible leasing options.\nA\ncrush of companies that piled into the eight-story building\ninclude PwC U.S. Group, which leased 141,000 square feet; Acrisure, for  29,000 square feet; Couchbase for 23,700 square feet; Calix, for 23,000 square feet; Pivot Interiors, for 15,000 square feet; and  BetterHelp, for 10,400 square feet.\nThe Good Eating Company, a full-service cafe, has struck a deal to operate on the office building’s ground floor.\nThe building’s 20 percent vacancy compares to the\n21.8 percent vacancy\nfor Silicon Valley in the third quarter, according to a\nDecember report\nfrom Joint Venture Silicon Valley and JLL Silicon Valley, according to the San Jose Spotlight.\nSouth Bay office availability — empty offices plus offices being listed for sublease — was 25.9 percent in the fourth quarter ending in December,\naccording to Savills\n.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.mercurynews.com/2025/03/17/san-jose-tech-economy-office-property-build-real-estate-ai-develop/",
      "https://therealdeal.com/san-francisco/2025/02/06/one-santana-west-in-san-jose-70-leased/",
      "https://sanjosespotlight.com/silicon-valley-san-jose-commercial-real-estate-vacancy-rates-pass-20-percent/",
      "https://siliconvalleyindicators.org/special-reports/commercial-space-q3-2024/",
      "https://www.mercurynews.com/2025/01/07/san-jose-south-bay-tech-nvidia-google-amazon-economy-jobs-office-work/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/02/06/one-santana-west-in-san-jose-70-leased/",
      "https://therealdeal.com/san-francisco/2024/04/02/pwc-signs-141k-sf-lease-at-santana-row-in-san-jose/",
      "https://therealdeal.com/san-francisco/2024/02/23/silicon-valley-vies-with-sf-as-ai-capital-of-the-world/"
    ],
    "market": "San Francisco",
    "published": "Tue, 18 Mar 2025 21:00:00 +0000",
    "published_dt": "2025-03-18T21:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/austin/2025/03/18/19m-mansion-hits-austin-market-as-luxury-listings-swell/",
    "title": "$19M mansion hits market as luxury listings swell",
    "subhead": "Inventory jumped with 48 offerings over $2 million",
    "authors": "ByJudah Duke",
    "pub_date": "Mar 18, 2025, 4:39 PM",
    "pub_date_dt": "2025-03-18T16:39:00",
    "content": "A $19 million asking price for an estate on the Colorado River topped Austin’s offerings last week as listings over $2 million surged.\nThe property, at 4705 Island Cove, includes an updated modern home on just over an acre with an adjacent 2.1-acre lot at 4709 Island Cove.\nThe main residence features eight living spaces, including a game room, walk-in humidor, pool with swim-up bar and an outdoor kitchen. The property also includes three guest suites, a safe room, three-car garage and a two-slip boat garage. The asking price pencils out to $1,860 per square feet.\nA separate listing includes 4705 Island Cove, 4709 Island Cove and 4400 Island Avenue for $25.5 million, combining 4.85 acres and approximately 450 feet of Lake Austin frontage.\nEric Moreland of Moreland Properties has the listing; the identity of the seller, who owns all three properties, is hidden by a trust.\nForty-eight listings over $2 million were added to Austin’s inventory last week, 12 more than it added\nthe week prior\n, according to the Eklund Gomes luxury report.\n\nContracts on luxury homes dipped, from 12 the week before to six last week, five single-family homes and one $2.24 million condo. Purchases typically slow when the annual 9-day SXSW festival and conference takes over the city, Eklund Gomes’ Michael Reisor said.\nThe top contract was for a 5,800-square-foot home last listed for $5.3 million at 4900 Amarra Drive in Barton Creek. It has five bedrooms and a detached guesthouse. It asked $900 per square foot and was listed by Eric Moreland.\nThe other four single-family homes ranged in listed price from $2.5 to $3.25 million, with three in Tarrytown and one near Bee Cave, in the Bella Montagna neighborhood.\nThe condo deal went down for a penthouse asking about $900 per square foot at 901 West 9th Street, unit 704, at the Nokonah residences. The nearly 2,500-square-foot unit has 2 bedrooms, a balcony and an 800-bottle wine cellar.\nThe Nokonah was developed by Robert Barnstone and Perry Lorenz in 2001. The condo was listed by Moreland Properties’ Diane Humphreys.\n— Judah Duke",
    "related_links": [
      "https://therealdeal.com/texas/austin/2025/03/11/austin-luxury-condo-market-gains-steam/"
    ],
    "market": "Texas",
    "published": "Tue, 18 Mar 2025 20:39:56 +0000",
    "published_dt": "2025-03-18T20:39:56+00:00",
    "author": "Judah Duke"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/18/national-association-of-realtors-roundly-disliked-survey-finds/",
    "title": "NAR missteps alienate pros, public alike",
    "subhead": "Sexual harassment, commission collusion put organization in the doghouse",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 4:00 PM",
    "pub_date_dt": "2025-03-18T16:00:00",
    "content": "The National Association of Realtors is in the doghouse.\nThe Chicago-based organization’s reputation hasn’t recovered from recent setbacks, and it is unpopular with real estate professionals as well as the general public, according to the\nHousing Sentiment Survey\n, conducted by Lance Lambert’s real estate analytics site ResiClub. It ranked NAR near the bottom among 16 real estate-related entities, with 62 percent of real estate agents and brokers holding an unfavorable view of the organization, Crain’s\nreported\n.\nAmong executives in real estate and housing, 66 percent reported a negative perception, while 68 percent of the general public viewed NAR unfavorably.\nSome top Chicago-area agents weren’t surprised.\nNAR is “so far out of touch with reality” that it failed to anticipate the class-action lawsuits challenging its long-standing commission model, prominent Compass agent Mario Greco said.\nThe organization, which most agents must join to access multiple listing services, has been under intense scrutiny following a\nsexual harassment scandal in 2023\nand a federal jury ruling that found NAR and large brokerages\ncolluded to keep commissions artificially high\n, making homeownership costlier.\n\nIn response, NAR abandoned its previous commission standards\nlast August\n, but the lack of a unified standard to replace it has\nleft the industry in flux\n.\nJennifer Ames, head of Engel &amp; Völkers Chicago, offered a more measured view, acknowledging that while NAR’s lobbying has been “important” for homeowners, its reputation has taken a major hit. The group has been instrumental in shaping fair housing efforts and advocating for policies like the mortgage interest income-tax deduction.\nNAR CEO Nykia Wright has been\nworking to repair the trade group’s image\n, introducing conduct standards and focusing on restoring trust.\nThe organization responded to the survey results by stating it is committed to strengthening relationships with brokerages, local associations and industry partners.\nAgents are skeptical despite the efforts. Marina Carney, a Compass agent in Lake Forest, said NAR is “a fine mess” but added that meaningful change will take time.\n— Judah Duke\n",
    "related_links": [
      "https://www.resiclubanalytics.com/p/housing-market-2025-q1-resiclub-housing-sentiment-survey%20",
      "https://www.chicagobusiness.com/residential-real-estate/national-association-realtors-scores-poorly-new-survey",
      "https://therealdeal.com/national/2023/08/26/kenny-parcell-accused-of-sexual-harassment-creating-toxic-culture-at-nar/",
      "https://therealdeal.com/national/2024/03/15/nar-resolves-commission-lawsuits/",
      "https://therealdeal.com/national/2024/09/10/nars-remaining-legal-battles-doj-pressure/",
      "https://therealdeal.com/national/2024/03/15/heres-what-nars-landmark-commissions-settlement-means/",
      "https://therealdeal.com/national/2024/08/19/nar-taps-nykia-wright-as-permanent-ceo/",
      "https://therealdeal.com/national/2025/01/13/scotus-denies-to-hear-nars-petition-over-doj-probe/",
      "https://therealdeal.com/national/2024/09/10/nars-remaining-legal-battles-doj-pressure/",
      "https://therealdeal.com/national/2024/08/19/nar-taps-nykia-wright-as-permanent-ceo/"
    ],
    "market": "Chicago",
    "published": "Tue, 18 Mar 2025 20:00:00 +0000",
    "published_dt": "2025-03-18T20:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/18/henry-crown-scores-chicago-lease-expansion-from-fintech-firm/",
    "title": "Henry Crown and Co scores another lease expansion from fintech firm",
    "subhead": "Bucks trend of companies downsizing; office market’s average lease size increased for first time since pandemic",
    "authors": "ByEmma Whalen",
    "pub_date": "Mar 18, 2025, 3:13 PM",
    "pub_date_dt": "2025-03-18T15:13:00",
    "content": "Henry Crown and Company brushed off the Loop’s bleak office leasing landscape with a tenant’s second expansion.\nFintech company NinjaTrader is adding 15,700 square feet at 222 North LaSalle for a second time, bucking the post-pandemic trend of office downsizing. The expansion brings the firm’s space up to nearly 42,000 square feet, spanning a full floor in the 1 million-square-foot building.\nAvison Young’s Chris O’Leary and Jeff Lindenmeyer represented NinjaTrader; Tishman and Speyer represented the landlord.\nNinjatrader previously occupied 6,400 square feet at 363 West Erie Street in River North before relocating to a 19,500-square-foot space at 222 North LaSalle in 2021. The firm added 6,600 square feet in 2023.\n\nThe city’s average office lease size has increased for the first time since the pandemic, a promising sign of resilience, O’Leary said.\nIt’s likely too soon to tell if the broader office market in Chicago is headed for a noticeable turnaround. The downtown office vacancy rate hit 26.3 percent in the fourth quarter, up from 23.8 percent at the end of 2023 and more than double the 13.8 percent rate recorded at the start of the pandemic, according to CBRE.\nHenry Crown and Co. bought the 27-story building at 222 North LaSalle for $112 million in 2006 with a $100 million loan from the Teachers Insurance and Annuity Association of America.\nThe investment firm dates back to 1959 and is tied to one of Chicago’s wealthiest families. One of its scions, the businessman and philanthropist Jim Crown, died in 2023, and his Gold Coast condo at\n65 Goethe Street\n, was listed the following year for $17.5 million.\n",
    "related_links": [
      "https://therealdeal.com/chicago/2024/10/31/the-late-jim-crowns-chicago-condo-lists-for-17-5-million/",
      "https://therealdeal.com/chicago/2025/03/13/chicago-developer-sterling-bay-downsizes-office-space/",
      "https://therealdeal.com/chicago/2025/03/13/beacon-capital-partners-lists-indebted-chicago-office-tower/",
      "https://therealdeal.com/chicago/2025/03/12/investor-pitches-conversion-for-chicagos-pittsfield-building/"
    ],
    "market": "Chicago",
    "published": "Tue, 18 Mar 2025 19:13:59 +0000",
    "published_dt": "2025-03-18T19:13:59+00:00",
    "author": "Emma Whalen"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/18/chicago-approves-lgbtq-hotel-in-northalsted/",
    "title": "LGBTQ+ hotel with rooftop pool among handful of rooms in pipeline",
    "subhead": "51-key hotel in Northalsted will replace former Yoshi’s Cafe",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 2:30 PM",
    "pub_date_dt": "2025-03-18T14:30:00",
    "content": "A boutique hotel project geared toward LGBTQ+ travelers is moving forward in Lakeview after receiving Chicago City Council approval, clearing the way for construction to begin.\nThe proposed hotel at 3257 North Halsted Street will have six-stories and 51 rooms, Block Club\nreported\n.\nIt would replace the former Yoshi’s Cafe, a neighborhood staple that closed in 2021 after 39 years in business.\nThe project is led by local developer Allan O’Brien, owner of the Men’s Room Chicago at 3343 North Halsted Street, which sells clothing and accessories for the gay community. His partners in the deal are Andrias Campbell and Bob Sievers.\nThe development will feature a restaurant on its ground floor, a rooftop bar with a pool and cabanas and a speakeasy-style lounge in the basement. The lobby, restaurant, speakeasy and rooftop lounge will be open to the public when not reserved for private events.\nThe rainbow-themed building was designed by Chicago-based Jonathan Splitt Architects.\n\nO’Brien’s team secured the approval with strong community support, having worked with Alderman Bennett Lawson and neighborhood groups. No timeline for construction has been announced.\nThe developer’s “good-neighbor agreement” with the city includes 24-hour on-site staff and security, hosting community events with discounted offerings for neighbors and reinstating a three-car standing zone on Aldine Avenue for guest drop-offs and pickups.\nTo ease congestion, the developers are also working with city officials to establish a second standing zone on Halsted Street for ride-share and taxi access.\nChicago’s hotel development pipeline has fallen to the lowest level in recent years as construction lending froze up, with fewer than 1,500 rooms under construction in the fourth quarter, CoStar\nreported\n— Judah Duke\n",
    "related_links": [
      "https://blockclubchicago.org/2025/03/12/lgbtq-hotel-with-rooftop-bar-speakeasy-in-lakeview-gets-city-council-ok/",
      "https://www.costar.com/article/1060761240/chicago-hotel-development-pipeline-slows-more-than-national-average",
      "https://therealdeal.com/chicago/2025/03/06/skokie-developer-em-hit-with-24m-hotel-site-foreclosure/",
      "https://therealdeal.com/chicago/2025/03/04/struggling-sonder-ditching-hotel-in-chicagos-river-north/",
      "https://therealdeal.com/chicago/2024/11/21/chicago-hotel-owners-push-back-on-massive-tax-valuations/"
    ],
    "market": "Chicago",
    "published": "Tue, 18 Mar 2025 18:30:00 +0000",
    "published_dt": "2025-03-18T18:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/18/saks-fifth-avenue-may-be-poised-to-exit-sfs-union-square/",
    "title": "Retail chain reaction casts doubt on Saks flagship at Union Square",
    "subhead": "Department store’s lease expires in 2027",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 1:59 PM",
    "pub_date_dt": "2025-03-18T13:59:00",
    "content": "The dominoes of department stores and boutique shops falling around San Francisco’s Union Square may include another luxury retail store: Saks Fifth Avenue.\nCanada-based Hudson Bay Company, which owns Saks, appears ready to cut the cord for its appointment-only store at 384 Post Street when its lease expires in 2027,\nthe San Francisco Chronicle reported\n.\nThe move comes after an affiliate of Hudson Bay, Saks Global Enterprises, picked up the Union Square flagship store from Neiman Marcus late last year at 150 Stockton Street during its acquisition of Neiman Marcus and its real estate properties for\n$2.7 billion\n.\nThe transfer of the six-story, 208,900-square-foot building at 150 Stockton assigned a new market value of $160 million, or $766 per square foot, according to public records and an unidentified source.\nThat left Saks, which for decades has leased a 136,000-square-foot building at 384 Post diagonally across the street from Neiman, vulnerable.\nSaks Fifth Avenue faces an expiring lease in January  2027, Charlie McCabe, a locally based real estate investment broker, told the Chronicle. The department store’s ongoing tenure in that building “may be tenuous,” he said.\nSaks pays more than $6 million a year in rent to landlord Lincoln Property, based in Dallas. Last summer, Saks laid off workers as it converted the store to\n“appointment only,”\ncurtailing its retail clout in Union Square.\nKazuko Morgan, a veteran retail broker who specializes in leasing around Union Square, said that she was told Saks doesn’t plan to renew its lease — and hasn’t heard that Saks could move in with Neiman Marcus across the street.\n\n“If Saks does exit the market, it’s not such a terrible thing today, since they have been appointment-only for months,” Morgan told the newspaper. “They’ve already diminished their presence.”\nLincoln Property and Germany-based Cara Investment bought the building in 2021 for $156 million, or $115 per square foot. They now plan to redevelop it as “mixed use,” Morgan said.\nThe loss of Saks could be inscribed into a larger retail tombstone for greater Union Square, once the city’s golden shopping district.\nNordstrom, which for decades anchored the mall at 865 Powell Street, packed up in 2023. Bloomgindale’s, which occupied more than 300,000 square-feet at the nearly empty San Francisco Centre mall,\nwill close this month\n.\nMacy’s, which for decades has occupied its three-building flagship store in Union Square plaza, plans to\nsell the property and close the doors\nof its only San Francisco store.\nOther retailers that have pulled up stakes include Saks Off Fifth, Nordstrom Rack, H&amp;M and Uniqlo, according to the Chronicle. Meanwhile, luxury retailers may be drifting over to historic Jackson Square.\nThis month, Ralph Lauren has returned to San Francisco with a\nnew store at 441 Jackson Street\n, following an\ninflux of luxury retailers\nlike Paul Smith, Isabel Marant and Zimmermann.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.sfchronicle.com/realestate/article/union-square-nieman-marcus-saks-fifth-avenue-20226191.php",
      "https://www.neimanmarcusgroup.com/HBC,-Parent-of-Saks-Fifth-Avenue,-to-Acquire-Neiman-Marcus-Group-for-2-65-Billion-and-Establish-Saks-Global,-a-Technology-Powered-Luxury-Retail-Company",
      "https://www.sfchronicle.com/realestate/article/s-f-union-square-saks-appointment-shopping-19582844.php",
      "https://therealdeal.com/san-francisco/2025/01/23/bloomingdales-to-close-flagship-in-san-francisco-centre-mall/?firstLevel=sanfrancisco&secondLevel=2025&thirdLevel=01&fourthLevel=23&fifthLevel=bloomingdales-to-close-flagship-in-san-francisco-centre-mall",
      "https://therealdeal.com/la/2025/03/03/macys-downtown-los-angeles-closure/",
      "https://therealdeal.com/san-francisco/2025/03/10/star-chef-brick-timber-join-up-on-sf-jackson-square-buy/",
      "https://www.sfchronicle.com/realestate/article/postscript-business-san-francisco-19986839.php",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/03/10/star-chef-brick-timber-join-up-on-sf-jackson-square-buy/",
      "https://therealdeal.com/la/2025/03/03/macys-downtown-los-angeles-closure/",
      "https://therealdeal.com/san-francisco/2025/01/29/sf-retail-agents-read-tea-leaves-on-bloomingdales-exit/"
    ],
    "market": "San Francisco",
    "published": "Tue, 18 Mar 2025 17:59:22 +0000",
    "published_dt": "2025-03-18T17:59:22+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/18/paramount-ceo-brian-robbins-in-contract-on-bev-hills-home/",
    "title": "Paramount Pictures, Nickelodeon CEO in contract to sell Beverly Hills home",
    "subhead": "Trousdale Estates five-bedroom listed for $20.8M",
    "authors": "ByKari Hamanaka",
    "pub_date": "Mar 18, 2025, 1:41 PM",
    "pub_date_dt": "2025-03-18T13:41:00",
    "content": "Media and entertainment honcho\nBrian Robbins\nmoved closer to striking a deal on his Beverly Hills contemporary pad in what marked last week’s top Los Angeles County home under contract.\nThat’s according to the Douglas Elliman Eklund Gomes team’s weekly report, tracking homes that went into contract. The team counts properties in the Multiple Listing Service priced at $4 million or more and lists them by asking dollar volume in its report.\nRobbins, who has been president and CEO of Paramount Pictures and Nickelodeon since 2021, placed the home at 1335 Carla Lane on the market in late January with a $20.8 million asking price.\nThe executive bought the Trousdale Estates property in 2020 for $16.8 million through an entity called Stella Properties LLC, state records show. He nabbed a deal on the home, which was originally listed for nearly $24 million, about a year before he bought it.\nThe Beverly Hills Estates’ Rayni Williams and Branden Williams hold the listing and did not respond to a request for comment.\nThe home is 11,000 square feet with five bedrooms and eight bathrooms. Features include a two-story courtyard, glass walls, oak ceilings, infinity pool and Japanese garden.\n\nSouth of Beverly Hills, a beachfront property on The Strand in Manhattan Beach came in second on the Eklund Gomes report.\nThe home at 304 The Strand in\nManhattan Beach\nis listed at just under $14 million, with Strand Hill Properties’ Kevin Pratt and Amy Olivares marketing the property.\nThe seller is a limited liability company tied to a New York address, property and state records show.\nThere’s a three-bedroom, three-and-a-half bath home on the 3,326-square-foot lot. Above the property’s garage is a one-bed, one-bath unit.\nOverall, Los Angeles County saw 23 signed contracts last week, adding up to asking dollar volume of $161.8 million, according to the Eklund Gomes report. The majority of those contracts, 22, were single-family homes as\ncondo activity\nnormalized from the burst of signings within the segment seen for the week ended March 9.\n",
    "related_links": [
      "https://therealdeal.com/la/2019/09/06/this-week-in-celeb-real-estate-ellen-degeneres-flips-for-santa-barbara-and-jonah-hill-settles-down-in-santa-monicaand-more/",
      "https://therealdeal.com/la/2024/07/22/manhattan-beachs-priciest-home-trade-fetches-24-5m/",
      "https://therealdeal.com/la/2025/03/12/las-condo-market-drives-luxury-resi-contract-activity/",
      "https://therealdeal.com/la/2025/03/12/las-condo-market-drives-luxury-resi-contract-activity/",
      "https://therealdeal.com/la/2025/03/04/la-luxury-residential-contract-activity-slows-to-76m/",
      "https://therealdeal.com/la/2025/02/25/la-inks-120m-in-signed-resi-contracts/"
    ],
    "market": "Los Angeles",
    "published": "Tue, 18 Mar 2025 17:41:01 +0000",
    "published_dt": "2025-03-18T17:41:01+00:00",
    "author": "Kari Hamanaka"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/18/dallas-gets-meeting-with-saks-to-save-downtown-neiman-marcus/",
    "title": "Dallas gets Saks to negotiating table in effort to save Neiman Marcus",
    "subhead": "City manager to pitch “financially beneficial” deal for downtown flagship",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 1:30 PM",
    "pub_date_dt": "2025-03-18T13:30:00",
    "content": "Dallas officials secured a meeting with Saks Global as they make a final push to keep the Neiman Marcus flagship open downtown, but the retailer insists its decision to close remains unchanged.\nDallas City Manager Kimberly Bizor Tolbert will meet with Saks executives next week following the city’s latest attempt to pitch what it describes as a “financially beneficial” offer, the Dallas Morning News\nreported\n. Where the meeting will take place wasn’t reported.\nThe meeting comes after Tolbert and the Dallas Consortium, a coalition of business and civic leaders,\nsent a letter\nto Saks Executive Chairman Richard Baker and others, urging a discussion before the store shutters on March 31.\nSaks has “always been open to speaking with the city manager of Dallas,” it said in a statement, but reaffirmed that its decision to close the downtown Neiman Marcus location, which it\nmade in February\n, has not changed.\nThe letter to Baker claimed that keeping the store open for a few more months would allow Saks to “capture the opportunity we wish to discuss.”\n\nThe city has not publicly disclosed details of its proposal but previously worked to remove a major barrier to keeping the store open by securing the deed to a disputed portion of the property earlier this month.\nSaks, which acquired Neiman Marcus for $2.7 billion last year, has\npushed back on the city’s efforts\n, arguing that the situation is “far more complicated than what the public is being led to believe.” The company, which is owned by Hudson Bay Company, has also claimed that some of its previous attempts to engage with Dallas officials were rejected.\nThe meeting is the latest development in an ongoing effort to preserve the store, which has been a landmark in downtown Dallas for over a century. The closure threatens to leave a major void in the city’s retail core, as Neiman Marcus also plans to vacate its 82,000-square-foot headquarters at Cityplace Tower.\nWhile Dallas officials hold out hope for a deal, Saks is already moving forward with plans to invest $100 million into its Neiman Marcus location at NorthPark Center, suggesting its focus is shifting away from downtown.\n— Judah Duke\n",
    "related_links": [
      "https://www.dallasnews.com/business/retail/2025/03/17/dallas-gets-meeting-with-saks-global-over-downtown-neiman/",
      "https://therealdeal.com/texas/dallas/2025/03/17/dallas-officials-make-another-pitch-to-keep-neiman-marcus/",
      "https://therealdeal.com/texas/dallas/2025/02/18/hudson-bay-company-slashes-neiman-marcus-dallas-presence/",
      "https://therealdeal.com/texas/2025/03/05/saks-to-close-historic-neiman-marcus-store/",
      "https://therealdeal.com/texas/dallas/2025/03/17/dallas-officials-make-another-pitch-to-keep-neiman-marcus/",
      "https://therealdeal.com/texas/dallas/2025/02/18/hudson-bay-company-slashes-neiman-marcus-dallas-presence/",
      "https://therealdeal.com/texas/2025/03/05/saks-to-close-historic-neiman-marcus-store/"
    ],
    "market": "Texas",
    "published": "Tue, 18 Mar 2025 17:30:00 +0000",
    "published_dt": "2025-03-18T17:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/18/nasdaq-to-open-second-headquarters-in-dallas-suburb-irving/",
    "title": "Nasdaq joins Y’all Street movement with Dallas expansion",
    "subhead": "Wall Street index to open first regional headquarters in Irving",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 1:05 PM",
    "pub_date_dt": "2025-03-18T13:05:00",
    "content": "The financial migration to “Y’all Street” is accelerating as Nasdaq plans to open its first regional headquarters in Dallas.\nThe stock exchange, long associated with its Times Square presence in New York City, will establish a regional management division at its existing office at 5030 Riverside Drive in Irving later this year to serve Texas and the broader Southeast, The Dallas Morning News\nreported\n.\nThe exchange tapped Rachel Racz, a Texas native and oil-and-gas industry veteran, as senior vice president, head of listings for the Texas, Southern U.S. and Latin America division.\nThe office will house parts of Nasdaq’s technology and financial crime management divisions, which clients use to detect fraud and money laundering, but will not primarily focus on acquiring stock listings.\nNasdaq’s Texas, Southern U.S. and Latin America region serves more than 480 clients across various industries, collectively valued at $1.9 trillion. Within Texas alone, over 200 companies trade on Nasdaq, accounting for $1.3 trillion in market capitalization, the firm said.\nIt’s another sign of Texas’ growing influence in the financial world, and for Dallas, proof that\nY’all Street\nis still filling out.\nThe New York Stock Exchange plans to launch an electronic exchange in Dallas,\nrebranding the Chicago Stock Exchange as NYSE Texas\nand further shifting trading operations to the Southwest.\nMeanwhile, the Texas Stock Exchange, a startup seeking to challenge Wall Street’s longstanding dominance, is awaiting regulatory approval to launch in Dallas next year. The fully electronic exchange has raised $120 million, with backing from BlackRock and Citadel Securities.\n\nNasdaq’s move comes as Dallas developers push a $1 billion transformation of Uptown Dallas into a financial hub that could rival New York’s stronghold.\nThe area has attracted a wave of finance firms in recent years, with its own pool of developers. Hunt Realty hired Ross Perot Jr.’s Hillwood to manage construction of a\n$500 million campus\nfor Goldman Sachs. KDC and Pacific Elm Properties are building a\n30-story tower\nthat will house Bank of America and Granite Properties’ $173 million office tower\nsigned Deloitte for four floors\n, over 100,000 square feet of space.\nGoldman Sachs and Bank of America’s offices are slated to deliver in 2027. Deloitte will enter its offices when Granite Properties’ 23Springs tower opens this year.\nGoldman Sachs recently gave its managers in New York and London an ultimatum to move to either its Dallas hub or to Salt Lake City or face termination.\nThe Lone Star State recently introduced Texas Business Courts to handle corporate matters, part of the state’s play to offer an alternative to Delaware’s Court of Chancery system.\nTexas’ pro-business stance has fueled speculation that more financial firms could shift operations to Dallas, where commercial real estate costs and corporate taxes are significantly lower than in the Northeast.\n— Judah Duke\n",
    "related_links": [
      "https://www.dallasnews.com/business/economy/2025/03/18/nasdaq-plants-roots-in-dallas-with-new-hq-as-north-texas-draws-attention-from-wall-street/",
      "https://therealdeal.com/magazine/october-2024/wall-to-yall/",
      "https://therealdeal.com/chicago/2025/02/14/chicago-stock-exchange-moving-to-texas-yall-street/",
      "https://therealdeal.com/texas/dallas/2023/10/10/goldman-sachs-starts-500m-dallas-campus/",
      "https://therealdeal.com/texas/dallas/2024/04/16/pacific-elm-scores-construction-loan-for-bank-of-america-tower/",
      "https://therealdeal.com/texas/dallas/2024/01/16/deloitte-leases-100k-sf-in-uptown-dallas/",
      "https://therealdeal.com/magazine/october-2024/wall-to-yall/",
      "https://therealdeal.com/chicago/2025/02/14/chicago-stock-exchange-moving-to-texas-yall-street/",
      "https://therealdeal.com/texas/dallas/2024/11/19/oaktree-capital-launches-formida-capital-in-dallas/"
    ],
    "market": "Texas",
    "published": "Tue, 18 Mar 2025 17:05:36 +0000",
    "published_dt": "2025-03-18T17:05:36+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/18/beltway-capital-seizes-west-loop-offices-with-r2-still-aboard/",
    "title": "R2’s loft office debt workout cuts Heitman out of the picture",
    "subhead": "Nonperforming loan purchaser Beltway Capital kept Matt Garrison’s firm on board",
    "authors": "ByEmma Whalen",
    "pub_date": "Mar 18, 2025, 7:15 AM",
    "pub_date_dt": "2025-03-18T07:15:00",
    "content": "Office properties hit hard by the pandemic often end up in the hands of their lenders or bargain-hunting buyers before they get a chance at a revival.\nYet for a West Loop office portfolio that plunged from 90 to 50 percent occupied, co-owner R2 has managed to remain in the drivers’ seat and go debt-free through a new partnership. Public records show its joint venture with Beltway Capital Management — finalized last month with a deed-in-lieu of foreclosure that took its former co-owner Heitman out of the picture — also adds a fifth building to the 350,000-square-foot portfolio.\nR2 bought six West Loop loft office buildings in 2016 for $86 million in a joint venture with Chicago-based Walton Street Capital. R2 later recapitalized a four-building portion of the portfolio in a joint venture with Chicago-based Heitman in 2019. The Heitman venture paid $65 million for the portfolio with a $42 million loan from Truist Financial. It’s unclear how much R2 paid to maintain its stake in the properties.\nThe joint venture struggled to hold onto the four assets, located at 641 West Lake Street, 901 West Jackson Boulevard and 130 South Jefferson Street, after the pandemic hit.\nMaryland-based Beltway, which specializes in buying distressed debt, bought the loan note from Truist last May, when the properties and their owners faced a murky path forward. The loan was labeled nonperforming at the time of its sale, meaning it likely traded for less than its face value.\nIt’s not uncommon for distressed debt buyers to file foreclosure actions shortly after acquiring a struggling loan.\nWhen Truist put the $42 million debt on the market, R2 and Heitman hadn’t technically defaulted on the loan, but it was in cash management, people familiar with the offering said. That means its excess cash flow was being used to cover debt service costs.\nIn this case, Beltway tapped R2 as its partner in managing the assets. R2 CEO Matt Garrison declined to share how much the firm invested into the portfolio to maintain its stake or what terms dictated Heitman’s departure from the joint venture.\nRepresentatives of Heitman did not respond to requests for comment.\nGarrison said R2 will be investing in “aggressive retention efforts for existing tenants,” and upgrades to common areas.\n\nIt was worth it for R2 to hang onto the assets because loft offices are often the type of buildings targeted for residential conversions, he said, meaning the number of competing properties could dwindle. Others aren’t in a position to fund the costs of competing for tenants.\n“Many of the (loft office) owners are undercapitalized or lack a rationale to invest capital in new leases, because their properties are worth less than the debt,” Garrison said. “This makes the effective inventory even smaller. We think there will always be demand for well executed loft buildings in the West Loop, and supply and demand looks better today for the right buildings than it has in a long time.”\nA few months before it bought the distressed note from Truist, Beltway also pounced on another struggling loan issued by Sun Life Assurance Company of Canada to the Feil Organization for a loft office building at 730 North Franklin Street. Beltway also partnered with R2 to take over that asset.\nNow the firms co-own all five properties outright. Debt-free buildings\nhave emerged as an appealing strategy\nfor office investors seeking flexibility in making significant building upgrades and attracting tenants with competitive lease terms.\n“Debt is just financial engineering. It isn’t required from this entry basis to generate great returns,” Garrison said. “One of the first questions tenant reps ask is about debt. Is the building in trouble, etc. Owning a property in all cash is the best answer to this question.”\nWhether the new approach will kickstart a turnaround for the full portfolio remains to be seen.\nThe office at 901 West Jackson is 90 percent occupied but the offices at 641 West  Lake and 130 South Jefferson are 50 percent occupied. Garrison said the firm is negotiating several leases across the properties.\n“In the office business, it is hard to stay flat,” he said. “You are either growing or you are declining. The Chicago office market is really two markets today, with almost half of the buildings effectively offline.”\n",
    "related_links": [
      "https://therealdeal.com/chicago/2024/03/04/debt-free-office-buildings-can-give-chicago-landlords-an-edge/",
      "https://therealdeal.com/chicago/2023/06/23/r2-buying-michigan-avenue-office-tower-for-70m-as-cbre-takes-loss/",
      "https://therealdeal.com/chicago/2024/02/16/feil-facing-beltways-foreclosure-on-river-north-office/",
      "https://therealdeal.com/chicago/2024/07/26/beltway-capital-seizes-chicago-office-building-from-feil/"
    ],
    "market": "Chicago",
    "published": "Tue, 18 Mar 2025 11:15:00 +0000",
    "published_dt": "2025-03-18T11:15:00+00:00",
    "author": "Emma Whalen"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/17/east-bay-architect-eyes-15-homes-next-to-war-memorial-in-lafayette/",
    "title": "East Bay architect wants to build 15 homes next to war memorial in Lafayette",
    "subhead": "Lara Dutto to preserve Lafayette Hillside Memorial from development",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 8:22 PM",
    "pub_date_dt": "2025-03-17T20:22:00",
    "content": "Architect-turned-builder Lara Dutto plans to build 15 homes next to a war memorial of thousands of white wooden crosses in Lafayette.\nDutto, principal of Orinda-based Laraarchitecture, bought the\nLafayette Hillside Memorial\nat 3600 Deer Hill Road two years ago to save the 3.1-acre parcel from development,\nthe San Francisco Chronicle reported\n.\nNow Dutto, a professor of architecture at Diablo Valley College, has pitched a plan to develop 15 homes on the northern two-thirds of the site.\nShe wants to split off the southern portion to preserve the memorial conceived in 2006 by contractor Jeff Heaton as a “place to recognize, honor, and commemorate individual national service contribution” of those dying in the Iraq and Afghanistan wars.\nNonprofit Lafayette Hillside Memorial would continue to maintain the crosses.\n“Its scale and rawness and simplicity somehow makes me stop, forces me to take a deep breath, and in that moment I am so grateful for my freedoms,” she told the Chronicle.\nDutto, who has worked since 2010 to support the memorial and once sat on its board, grew concerned when the family that owned it put it up for sale, fearful that whoever bought it would remove the crosses. So she bought it in 2023 for an undisclosed price.\nPlans now call for preserving the memorial and half the property as open space, while building a subdivision of 15 single-family homes around a “village green,” with an outdoor cooking and dining area, according to the Chronicle.\nFive of the homes would have accessory dwelling units, or granny flats. The development would climb up the slope along Oak Hill Road, below a ridgeline of preserved open space.\n\nDutto has employed a state density bonus and Senate Bill 330 for streamlined approvals. On Monday, the Lafayette Planning Commission was slated to hold an informational hearing.\nThe application came as housing advocates\nsued the East Bay city\nfor creating “misleading and unrealistic housing sites” to satisfy state-mandated housing goals.\nThe lawsuit by the Housing Action Coalition accused Lafayette of “pretending” to comply with the state housing element, a planning blueprint required of every city and county across the state every eight years.\nMayor Susan Candell took issue with the lawsuit, according to the Chronicle, saying the City Council has approved all housing projects that have come before it. She said the city will have no choice but to approve the Deer Hill Road project.\nLafayette, a wealthy city with $2 million homes, was once a battleground for the region’s housing wars, with two lawsuits, a ballot referendum and more than 100 public hearings that delayed a 315-unit apartment building for almost a dozen years.\nWithin a 10-year span, 115 homes were built in the city of 25,000 residents, including 10 in 2010, 76 in 2018 and 29 in 2019. The city must rezone to build 2,114 homes, 943 of them affordable, by 2031.\nLast year, the\nstate Supreme Court declined\nto hear an appeal from a neighborhood group, allowing the development to move forward. The project has not broken ground.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.lafayettehillsidememorial.org/",
      "https://www.sfchronicle.com/bayarea/article/housing-war-memorial-lafayette-20217913.php",
      "https://therealdeal.com/san-francisco/2025/03/11/housing-advocate-sues-lafayette-for-misleading-housing-plan/",
      "https://www.sfchronicle.com/realestate/article/lafayette-housing-project-court-17844162.php",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/03/11/housing-advocate-sues-lafayette-for-misleading-housing-plan/",
      "https://therealdeal.com/san-francisco/2025/03/14/developer-saj-eyes-office-to-resi-conversion-in-lafayette/",
      "https://therealdeal.com/san-francisco/2024/03/14/former-sf-giant-buster-posey-buys-lafayette-home-for-8-3m/"
    ],
    "market": "San Francisco",
    "published": "Tue, 18 Mar 2025 00:22:50 +0000",
    "published_dt": "2025-03-18T00:22:50+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/17/kb-home-pays-58m-for-office-to-resi-plan-in-san-ramon/",
    "title": "KB Home pays $58M to get into office-to-resi redevelopment in San Ramon",
    "subhead": "Developer plans to raze 276,000 sq building to make way for 190 townhomes, single-family homes in Bishop Ranch",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 6:32 PM",
    "pub_date_dt": "2025-03-17T18:32:00",
    "content": "KB Home has paid $57.8 million for a 276,000-square-foot building it wants to replace with 190 homes in San Ramon’s Bishop Ranch.\nAn affiliate of the Los Angeles-based developer paid cash for the three-story office building at 2527-2545 Camino Ramon,\nthe San Jose Mercury News reported\n.\nThe seller of the Bishop Ranch 7 building was locally based Sunset Development, the principal owner and developer of Bishop Ranch.\nThe deal works out to $209 per square foot.\nPlans by the developer include bulldozing the offices at Camino Ramon and Executive Parkway to clear the way for 190 homes.\nKB Home wants to develop\nBartlett\n, a walkable neighborhood on the north side of Bishop Ranch, according to the Mercury News.\nThe project would have 396,100 square feet of housing, including 118 townhomes and 72 single-family homes, according to a planning document. The detached homes would range from 1,800 to 2,400 square feet with three to four bedrooms and two and a half to three bathrooms, with two-car garages.\nRenderings by SDG Architects show gray and white townhouses surrounding green courtyards with jacaranda trees. The project would be built next to City Village, a\n404-unit project\nnow being built by SummerHill Homes, a local unit of Calabasas-based Marcus &amp; Millichap.\n\nCost and timeline for the KB Home development were not disclosed.\nSunset, owned by the Mehran family, wants to redevelop the\n585-acre office campus at Bishop Ranch into a retail village\nwith up to\n10,000 homes\n.\nThe developer’s CityWalk Master Plan, approved in 2020, would redevelop 135 acres with thousands of homes, a hotel, shops and restaurants in three distinct neighborhoods.\nThe master developer, led by Alex Mehran Jr., also plans to build another\n2,600 homes at the former Chevron headquarters\nat 6001 Bollinger Canyon Road, along with 125,000 square feet of open-air shops and restaurants and a 2.5-acre park. Sunset, which sold Chevron the land for its headquarters in 1981, bought it back in 2022 for $174.5 million.\nMehran told\nThe Real Deal\nthis month that Sunset had made random selections as to which offices would be torn down for homes.\n“I threw a dart at the wall,” he joked, explaining how he decided which of his family’s office properties should be razed to create 300,000 square feet of retail and entertainment options at Bishop Ranch’s CityCenter, which opened in 2018, and 8,000 planned homes.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.mercurynews.com/2025/03/11/san-ramon-home-build-property-east-bay-office-economy-real-estate-jobs/",
      "https://sanramonca.iqm2.com/Citizens/FileOpen.aspx?Type=1&ID=3748&Inline=True",
      "https://therealdeal.com/san-francisco/2022/01/13/summerhill-homes-spends-108m-on-31-office-park-acres-in-san-ramon/?firstLevel=sanfrancisco&secondLevel=2022&thirdLevel=01&fourthLevel=13&fifthLevel=summerhill-homes-spends-108m-on-31-office-park-acres-in-san-ramon",
      "https://therealdeal.com/san-francisco/2024/01/25/former-chevron-hq-to-become-housing-and-retail-in-east-bay/",
      "https://www.bishopranch.com/press/bishop-ranchs-first-batch-of-homeowners-move-in/",
      "https://therealdeal.com/sanfrancisco/2024/01/25/former-chevron-hq-to-become-housing-and-retail-in-east-bay/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/03/10/bishop-ranchs-transformation-with-sunset-development-ceo/",
      "https://therealdeal.com/san-francisco/2025/02/10/eden-housing-sunset-plan-200-affordable-units-in-san-ramon/",
      "https://therealdeal.com/san-francisco/2022/01/13/summerhill-homes-spends-108m-on-31-office-park-acres-in-san-ramon/"
    ],
    "market": "San Francisco",
    "published": "Mon, 17 Mar 2025 22:32:51 +0000",
    "published_dt": "2025-03-17T22:32:51+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/17/gehry-designed-office-building-proceeds-in-playa-vista/",
    "title": "Gehry-designed office building proceeds in Playa Vista",
    "subhead": "NSB’s plan for 196K sf project suffered 2020 legal setback",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 5:39 PM",
    "pub_date_dt": "2025-03-17T17:39:00",
    "content": "NSB Associates is back on track for an approved 196,000-square-foot office building designed by Frank Gehry in Playa Vista, which stalled four years ago because of a lawsuit.\nThe Beverly Hills-based developer was reapproved by the Los Angeles City Planning Commission to build the eight-story building at 12575 West Beatrice Street,\nUrbanize Los Angeles reported\n.\nThe offices, approved in 2017, were forced by a court to undergo further environmental review. This month, the Planning Commission approved the revised environmental impact report for the project known as New Beatrice West.\nPlans include 3,400 square feet of shops and restaurants. An existing office building, home to Gehry Partners, would be retained.\nThe U-shaped, 135-foot-tall project, designed by Gehry, will have upper level setbacks to create terrace decks.\nConstruction is expected to take 18 months. A project cost and when NSB is expected to break ground were not disclosed.\n\nKarney Management, a property owner nearby, had repeatedly appealed the office building to attempt to force the project to undergo further environmental review, without success.\nThe company led by Aliza Karney Guren\nsued the City of Los Angeles\nto block the project. In January 2020, a Los Angeles judge ruled that the mitigated negative declaration conducted for the project had not sufficiently considered impacts to aesthetics, noise and traffic congestion.\nAs a result, the Planning Department was forced to redo the environmental review process, although project entitlements were not overturned by the decision, according to Urbanize.\nNew Beatrice West is the second collaboration between Larry Field, founder of NSB Associates, and his longtime friend Frank Gehry. In 2023, NSB completed its two-building,\n80,000-square-foot offices\n, designed by Gehry,\nin El Segundo\n.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://la.urbanize.city/post/city-planning-commission-signs-eir-gehry-designed-offices-12575-beatrice-street-playa-vista",
      "https://casetext.com/case/karney-mgmt-v-city-of-los-angeles",
      "https://therealdeal.com/la/2017/03/20/jll-to-lease-nsbs-gehry-designed-creative-office-in-el-segundo/",
      "https://urbanize.city/la/post/gehry-designed-office-building-completed-el-segundo",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2017/03/20/jll-to-lease-nsbs-gehry-designed-creative-office-in-el-segundo/",
      "https://therealdeal.com/la/2016/04/13/playa-vista-is-getting-a-new-campus/",
      "https://therealdeal.com/la/2023/01/18/frank-gehry-project-with-approvals-for-sale-in-hollywood/"
    ],
    "market": "Los Angeles",
    "published": "Mon, 17 Mar 2025 21:39:33 +0000",
    "published_dt": "2025-03-17T21:39:33+00:00",
    "author": "TRD Staff"
  }
]