[
  {
    "url": "https://therealdeal.com/national/2025/03/19/louise-sunshine-is-bringing-auctions-to-new-development/",
    "title": "Louise Sunshine bids on power of auctions for new developments",
    "subhead": "Luxury condo guru, Concierge Auctions partner up to pitch developers",
    "authors": "ByJake Indursky",
    "pub_date": "Mar 19, 2025, 2:00 PM",
    "pub_date_dt": "2025-03-19T14:00:00",
    "content": "Real estate auctions have historically been associated with troubled developers, one-of-a-kind mansions and languishing resales.\nBut a new partnership helmed by Louise Sunshine is trying to bridge the upsides of the auction market with the glitzy world of new development sales.\nThe real estate marketing guru and her son Paul are launching the Real Estate Investor Services division, a new development-focused arm of Concierge Auctions intended to complement traditional in-house marketing and sales for luxury developments.\nLouise is joining Concierge full-time after resigning from\nMichael Shvo’s\neponymous firm, which she joined in 2022 to ​​oversee its residential sales and marketing efforts.\nFounded in 2008, the auction house is\nmajority-owned by real estate holding company\nAnywhere Real Estate and auction house Sotheby’s. Concierge counted $4 billion in sales last year and touts its international database of high-net-worth buyers and sellers.\nConcierge claims the most expensive residence ever sold at auction, a Bel-Air estate called\n“The One”, which sold for $141 million in 2022\n. That property was once slated to list for $500 million after the home’s limited liability company defaulted on construction loans, according to the Journal.\nAuctions have become more common in luxury real estate in recent years, but often usher in a lower price than hoped for by the sellers behind the high-end properties, the Wall Street Journal reported last year. An analysis by the outlet found homes sold by Concierge in the first nine months of 2024 sold for\nan average discount of 41 percent\nfrom the list prices.\nBut CEO Chad Roffers pointed to a gap in the market as a focus for the new development-specific division.\n“We have more demand than inventory right now for ultra-luxury [and] luxury multi-family residences,” he said.\n\nSetting the timeline\nThe appeal for developers — or their financial backers — lies in establishing a set timeline for a sale.\n“We can cut a seller’s timeline to 60 days from three to five years,” Roffers said. “That’s invaluable.”\nThe auction market can be tapped at any point in the sales cycle, from launch through final closings, according to Paul, who said he envisions alternating the platform with traditional marketing methods for the same building.\n“We can go from an accelerated sale to conventional marketing as needed by the developer, which sort of eliminates the developer’s risk,” Louise added.\nConcierge will also provide developers a minimum price guarantee by pre-marketing units to its client list to solicit bids ahead of auction day. The firm takes an average of 8 percent buyer’s premium on top of the purchase price, according to its website, but incentivizes early bids by reducing that premium by half.\n“The developer knows going into the process there is already a bid on the table that’s an acceptable price,” Roffers said, likening the process to work by an investment bank leading up to a company’s initial public offering.\nRoffers, who declined to name specific developments working with Concierge, said he expects to auction the first new development inventory later this year when the firm has upcoming auctions in London, Hong Kong, Abu Dhabi and New York.\n",
    "related_links": [
      "https://therealdeal.com/new-york/2022/09/13/louise-sunshine-joins-shvo/",
      "https://therealdeal.com/new-york/2021/11/18/sothebys-realogy-make-winning-bid-for-concierge-auctions/",
      "https://therealdeal.com/la/2022/03/07/fashion-nova-founder-saghian-goes-biggest-gets-the-one/",
      "https://www.wsj.com/real-estate/luxury-homes/luxury-home-auctions-3975e082",
      "https://therealdeal.com/new-york/2021/11/18/sothebys-realogy-make-winning-bid-for-concierge-auctions/",
      "https://therealdeal.com/new-york/2022/09/13/louise-sunshine-joins-shvo/",
      "https://therealdeal.com/new-york/2024/12/10/manhattan-new-devs-outpace-resales/"
    ],
    "market": "National",
    "published": "Wed, 19 Mar 2025 18:00:00 +0000",
    "published_dt": "2025-03-19T18:00:00+00:00",
    "author": "Jake Indursky"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/19/caruso-swings-against-recall-of-la-mayor-karen-bass/",
    "title": "Caruso swings against Bass recall",
    "subhead": "“There is a time and place for politics, but it is not now,” billionaire developer says",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 19, 2025, 1:23 PM",
    "pub_date_dt": "2025-03-19T13:23:00",
    "content": "Billionaire developer Rick Caruso, who poured more than $100 million into a failed bid to defeat Karen Bass for Los Angeles mayor, isn’t shy about bashing the seasoned pol.\nBut the owner of upscale shopping centers fell short of supporting a recall effort against Bass, which has been fueled by discontent over her leadership surrounding the firestorm that burned 7,000 homes and businesses in the Pacific Palisades,\nKTLA 5\nand\nCity News Service\nreported.\n“A mayoral recall right now is not a good idea,” Caruso, who hasn’t ruled out mounting another challenge against Bass for mayor,\nposted on X\n. “This is a time when Los Angeles needs unity, not costly and expensive political distractions.\n“We must rebuild our communities, get people back into their homes, and open businesses that have been closed or lost. That must be our total focus. There is a time and place for politics, but it is not now.”\nBass, under siege since the nearly 24,000-acre\nPalisades Fire\n, faces a recall campaign\nled by Los Angeles realtor Nicole Shanahan\n, former presidential running mate of Robert F. Kennedy Jr. A recall would require 330,000 ballot signatures in four months.\nThe\nrecall effort gained steam\namong opponents who criticized the mayor for traveling to Ghana when the fire erupted on Jan. 7, despite advanced warnings from weather officials that severe winds would create extreme fire conditions.\nConcerns mounted over L.A. fire hydrant issues, low water pressure in the Palisades and resources within the Los Angeles Fire Department.\n\nFirefighting efforts were hampered when\nwater supplies ran out\nas crews tried to save entire neighborhoods.\nSome critics say Bass tried to shift blame for the response\nby firing former LAFD Chief Kristin Crowley\n.\nRumors have swirled\nsince last year\nthat Caruso could return to politics, with another bid for mayor or a candidacy for California governor when Newsom is termed out next year. Caruso also\nlaunched\nSteadfast LA, a private-sector recovery effort, sparking speculation about a possible second mayoral run. He has yet to make an official announcement.\nBass, who is up for reelection in 2026, has already launched her campaign. In an interview with KNX News, the mayor said she would fight any attempts to boot her from office.\n“I would never quit on my city. This is where I was born and raised,” Bass told the radio station. “Did I know that it was a difficult job? Absolutely. Am I ready for the job? Most definitely.”\n—\nDana Bartholomew\n",
    "related_links": [
      "https://ktla.com/news/local-news/businessman-rick-caruso-opposes-effort-to-recall-embattled-l-a-mayor-bass/",
      "https://www.dailynews.com/2025/03/18/rick-caruso-says-effort-to-recall-mayor-karen-bass-is-not-a-good-idea/",
      "https://x.com/RickCarusoLA/status/1902037406007853366",
      "https://www.fire.ca.gov/incidents/2025/1/7/palisades-fire",
      "https://therealdeal.com/la/2025/03/04/who-is-agent-hoping-to-recall-karen-bass/",
      "https://ktla.com/news/local-news/karen-bass-recall-palisades-fire/",
      "https://ktla.com/news/local-news/why-did-fire-hydrants-go-dry-for-crews-fighting-the-palisades-fire/",
      "https://www.dailynews.com/2025/03/14/mayor-bass-approved-a-raise-for-ex-los-angeles-fire-chief-before-bass-fired-her/",
      "https://ktla.com/news/local-news/rick-caruso-may-again-seek-public-office-los-angeles-times-reports/",
      "https://therealdeal.com/la/2025/02/04/rick-caruso-sets-up-indie-group-for-la-wildfire-rebuild/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2025/03/04/la-realtor-spearheads-bid-to-oust-mayor-karen-bass/",
      "https://therealdeal.com/la/2025/03/04/who-is-agent-hoping-to-recall-karen-bass/",
      "https://therealdeal.com/la/2025/03/05/bass-recall-effort-taps-major-funding-from-nicole-shanahan/"
    ],
    "market": "Los Angeles",
    "published": "Wed, 19 Mar 2025 17:23:58 +0000",
    "published_dt": "2025-03-19T17:23:58+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/19/miami-beach-mayors-eviction-effort-against-o-cinema-fizzles/",
    "title": "Miami Beach Mayor Steven Meiner’s push to evict O Cinema fizzles",
    "subhead": "Five city commissioners indicated they would not support evicting nonprofit arthouse over Gaza War doc screening",
    "authors": "ByFrancisco Alvarado",
    "pub_date": "Mar 19, 2025, 1:21 PM",
    "pub_date_dt": "2025-03-19T13:21:00",
    "content": "Once five Miami Beach city commissioners indicated they would not support evicting O Cinema, Mayor Steven Meiner called off his effort to kick out the nonprofit art house.\nOn Wednesday, Meiner withdrew his resolution seeking to cancel Miami Beach’s lease as well as grants to\nO Cinema\nafter Vice-Mayor Tanya Bhatt and commissioners Laura Dominguez, Alex Fernandez, Joseph Magazine and Kristen Rosen Gonzalez gave speeches about why\nMiami Beach\nshouldn’t be booting tenants from city-owned buildings for free speech content that some politicians find offensive.\nThe theater is in the old Miami Beach city hall, a historic\nArt Deco\nbuilding at 1130\nWashington Avenue\n.\nMeiner sought to cancel a two-year lease extension that the city commission granted O Cinema over the summer because the theater showed screenings of “No Other Land.”\nThe Oscar winning documentary chronicles life in the West Bank during the Gaza War and events that led to it. Meiner was upset that O Cinema’s leadership went ahead with the screenings after initially acquiescing to his demand not to show the film, directed by Palestinian activist Basel Adra and Israeli journalist Yuval Abraham.\nLast week, Meiner condemned “No Other Land” as “a false one-sided propaganda attack on the Jewish people.”\n\nDuring Wednesday’s meeting, Meiner claimed his reaction was rooted in ensuring public safety for the city’s Jewish constituents amid rising anti-Semitism across the globe because of Israel’s ongoing destruction of Palestine since Hamas terrorists killed more than 1,400 Israelis and kidnapped 240 more on Oct. 7, 2023.\n“Throughout history, there’s been different excuses for hating Jews,” Meiner said. “Sometimes it’s because Jews are too successful, sometimes because they’re too poor. Now it’s the state of Israel. It doesn’t matter. Every generation it morphs into something else. It’s just a convenient excuse. And that’s what I was trying to highlight.”\nStill, a majority of speakers during the meeting’s public comments voiced opposition to Meiner’s push to evict O Cinema, calling his actions government censorship.\n“We saw democracy in action,” O Cinema co-founder Kareem Tabsch told\nThe Real Deal\nfollowing the meeting. “There was an outpouring of support for O Cinema, and I think Meiner did the right thing. I respect his viewpoint and decisions.…It’s not the government’s role to dictate what art organizations should be showing or not showing.”\nA majority of the city commission concurred with Tabsch’s view. “The First Amendment is clear,” commissioner Fernandez said during the meeting. “The government must never censor artistic expression even when it is controversial or deeply offensive.”\nVice-Mayor Bhatt noted that O Cinema has shown more than 50 pro-Israel films by Jewish filmmakers, hosts the Miami Jewish Film Festival and screened a 12-hour documentary about the Holocaust. “To silence that voice does more damage than almost anything I can think of,” Bhatt said. “I will tell you that I’m not censoring anybody.”",
    "related_links": [
      "https://therealdeal.com/miami/2025/03/14/miami-beach-mayor-steven-meiner-threatens-to-evict-o-cinema/",
      "https://therealdeal.com/tag/miami-beach/",
      "https://therealdeal.com/tag/art-deco/",
      "https://therealdeal.com/tag/washington-avenue/"
    ],
    "market": "South Florida",
    "published": "Wed, 19 Mar 2025 17:21:00 +0000",
    "published_dt": "2025-03-19T17:21:00+00:00",
    "author": "Francisco Alvarado"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/19/queens-da-charges-four-in-deed-fraud-scheme/",
    "title": "Queens DA charges four in deed fraud scheme targeting seniors",
    "subhead": "Defendants allegedly stole three homes from rightful owners",
    "authors": "ByHolden Walter-Warner",
    "pub_date": "Mar 19, 2025, 1:19 PM",
    "pub_date_dt": "2025-03-19T13:19:00",
    "content": "The Queens DA is going after four people for allegedly stealing three homes from their rightful owners — two of whom were senior citizens.\nOn Wednesday, Carl Avinger, Autumn Valeri, Lawrence Ray and Torey Guice were arraigned on a 47-count indictment for their alleged roles in a deed fraud scheme involving falsified documents filed with the City Register’s office between March and July 2023.\nThe four individuals face charges of grand larceny, criminal possession of stolen property, conspiracy and other crimes for allegedly stealing three homes from their rightful owners in Queens, District Attorney Melinda Katz\nannounced\n.\n“Property ownership is a fundamental right,” Katz said in a statement. “As alleged, the defendants acted in concert to target properties for theft, forge documents, file false instruments and ultimately steal homes from the rightful owners.”\nThe scheme began in April 2023 when Avinger and Valeri, a licensed real estate agent and vice president of Fave Realty, allegedly filed fraudulent deed transfer documents, transferring a 76-year-old woman’s Queens Village home to Shuler Management LLC, an entity owned by Ray. Investigators discovered one signature belonged to a co-owner who died in 2016.\n\nWeeks later, the defendants allegedly filed forged documents transferring a Kew Gardens Hills home from its mother-daughter owners to another one of Ray’s companies. By May, they had sold this property to a third party for $600,000, according to the indictment, and approximately $442,000 was wired to an account linked to Ray.\nThe third party who purchased the property has since filed a civil suit against the legitimate owners, although proceedings have been stayed under legislation enacted in 2023 to\nprotect against deed fraud\n.\nIn May 2023, the group also allegedly targeted an 82-year-old woman’s Jamaica Estates home using similar tactics.\nAll four defendants surrendered to authorities on Wednesday. They are scheduled to return to court on April 29. If convicted, Ray, Valeri and Avinger face up to 25 years in prison, while Guice faces up to 15 years.\n",
    "related_links": [
      "https://queensda.org/four-individuals-indicted-in-deed-fraud-scheme/",
      "https://therealdeal.com/new-york/2023/11/14/gov-kathy-hochul-signs-deed-theft-protection-law/",
      "https://therealdeal.com/new-york/2024/10/09/bronx-broker-associates-charged-in-deed-theft-scheme/",
      "https://therealdeal.com/new-york/2023/11/14/gov-kathy-hochul-signs-deed-theft-protection-law/",
      "https://therealdeal.com/new-york/2022/05/06/shocking-twist-in-crown-heights-deed-theft-case/"
    ],
    "market": "New York",
    "published": "Wed, 19 Mar 2025 17:19:36 +0000",
    "published_dt": "2025-03-19T17:19:36+00:00",
    "author": "Holden Walter-Warner"
  },
  {
    "url": "https://therealdeal.com/texas/austin/2025/03/19/google-to-move-into-downtown-austins-sail-tower/",
    "title": "Google finally moving into Austin’s Sail Tower this year",
    "subhead": "Downtown office building has sat empty since its delivery in 2022",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 19, 2025, 12:39 PM",
    "pub_date_dt": "2025-03-19T12:39:00",
    "content": "Austin’s “Sail Tower” has been empty since 2022.\nBut by the end of the year, Google will move into the downtown office building it agreed to lease in 2019, KVUE\nreported\n.\nThe tech giant had delayed moving employees into the 35-story, 804,000-square-foot building after the pandemic. Google didn’t provide a specific timeline but confirmed its plan to move in later this year. The full-building lease expires in 2038.\nGoogle has eaten more than $53 million a year by paying for the trophy property lease it hasn’t used, the Austin Business Journal estimated.\nGoogle employees\ncurrently work\nin East Austin’s Saltillo development or at the skyscraper at 500 West 2nd Street, next to the Sail Tower, according to the Austin Business Journal.\n\nThe Sail Tower, at 601 West 2nd Street, traded hands in December, when developer Trammell Crow Company sold it to Atlanta-based Cousins Properties for $521.8 million.\nAt the time, Cousins’ Tim Hendricks said he “felt very comfortable in Google and Google’s plans for the city of Austin” despite the fact that the company hadn’t moved into the property at the time of the sale, Austin Business Journal reported.\nIndustry experts are hopeful that return to office mandates from major companies like Google will buoy the troubled office market, which has suffered since the pandemic made remote work the norm.\nWhile Austin’s office market vacancy has slowed its rapid acceleration, it still sat at 25.2 percent at the end of last year, JLL\nreported\n. There’s still nearly 3 million square feet of office space under construction in Austin, but the development pipeline is tightening, JLL said.\n–Jess Hardin\n",
    "related_links": [
      "https://www.kvue.com/article/news/local/google-moving-into-austin-sail-building/269-cf139055-8927-4fa5-b336-58fcdf2414d5",
      "https://www.bizjournals.com/austin/news/2025/03/18/google-downtown-austin-sail-tower-occupy.html",
      "https://www.us.jll.com/content/dam/jll-com/documents/pdf/research/americas/us/q4-2024-office-market-dynamics/jll-us-office-market-dynamics-q4-2024-austin.pdf",
      "https://therealdeal.com/texas/austin/2025/03/13/meta-platforms-spending-3m-on-austin-office-buildout/",
      "https://therealdeal.com/texas/austin/2025/02/06/realtor-com-moving-headquarters-to-texas-from-california/",
      "https://therealdeal.com/texas/austin/2025/01/02/austins-biggest-office-leases-of-2024/"
    ],
    "market": "Texas",
    "published": "Wed, 19 Mar 2025 16:39:15 +0000",
    "published_dt": "2025-03-19T16:39:15+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/19/ballys-launches-chicago-casino-fundraising-workaround/",
    "title": "Bally’s paves $195M workaround as diversity fundraising stalls",
    "subhead": "Firm raised $83M via alternative method after SEC paused IPO",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 19, 2025, 12:30 PM",
    "pub_date_dt": "2025-03-19T12:30:00",
    "content": "Bally’s is hedging a bet on its controversial diversity-focused fundraising plan for its $1.7 billion Chicago casino development on the former Tribune newspaper printing plant site in River West.\nBally’s Chicago is now seeking to raise $195 million through a private share sale, as the Securities and Exchange Commission has halted an effort to raise $250 million through an initial public offering exclusively targeted at women and minority investors, the Chicago Business Journal\nreported\n.\nThe shift in fundraising methods comes as the company, a subsidiary of Rhode Island-based Bally’s Corp., is navigating significant regulatory challenges for its project, which is set to become the Windy City’s first full-fledged permanent gambling emporium.\nLast summer, Bally’s Chicago garnered attention with plans for a $250 million IPO exclusively targeting qualified female and minority investors. This initiative was prompted by a mandate from the city of Chicago, stipulating that 25 percent of the new casino must be owned by minorities and women. However, the SEC has yet to approve the IPO, citing the need for updated audited financials from Bally’s Chicago.\n\nIn response to the regulatory delay, Bally’s launched a private placement offering, which has already secured over $83 million from 270 accredited investors, the outlet reported, citing the firm’s financial disclosures. This approach is running alongside the stalled public offering and includes individuals who meet the criteria specified by Chicago’s ownership mandate, according to Bally’s spokesperson Richard Land.\nLegal hurdles loom, however. The IPO has faced federal court challenges, with accusations of discrimination leveled by plaintiffs supported by groups like the American Alliance for Equal Rights and the Liberty Justice Center. These lawsuits argue that the IPO unfairly favors minority and female investors, potentially excluding others from participating in the investment opportunity.\nMeanwhile, Bally’s continues to refund deposits to potential IPO investors as it strives to gain SEC clearance. The company remains optimistic about its casino project, which has recently received site plan approval and is slated to open in September 2026. The complex promises a 500-room hotel, entertainment venues, multiple dining options, and public spaces, and aims to redefine Chicago’s hospitality and gaming scene.\n— Sam Lounsberry\n",
    "related_links": [
      "https://www.bizjournals.com/chicago/news/2025/03/18/ballys-seeks-195m-from-private-investors.html",
      "https://therealdeal.com/chicago/2025/03/03/ballys-chicago-casino-hits-roadblock-as-sec-documents-expired/",
      "https://therealdeal.com/chicago/2024/07/12/ballys-lands-940m-for-chicago-casino-development/",
      "https://therealdeal.com/chicago/2025/01/15/ballys-seeks-big-property-tax-break-for-chicago-casino/"
    ],
    "market": "Chicago",
    "published": "Wed, 19 Mar 2025 16:30:00 +0000",
    "published_dt": "2025-03-19T16:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/19/post-investment-group-buys-apartments-in-palmdale-for-71m/",
    "title": "Post Investment Group pays $71M for Chaparral Apartments in Palmdale",
    "subhead": "KeyBank provided $52.6M loan to the Beverly Hills-based firm",
    "authors": "ByAbigail Nehring",
    "pub_date": "Mar 19, 2025, 12:00 PM",
    "pub_date_dt": "2025-03-19T12:00:00",
    "content": "Jason Post’s Post Investment Group planted a flag in Antelope Valley north of Los Angeles,\nThe Real Deal\nhas learned.\nThe Beverly Hills-based investor paid $71 million to buy Chaparral Apartments, a 296-unit rental complex spanning 16 buildings at 38441 5th Street West in the desert city of Palmdale, according to property records filed in Los Angeles County earlier this month.\nThe deal values the property at just under $240,000 per unit.\nScott Pickett, the head of Post Investment’s multifamily division, did not immediately respond to a request for comment. The seller, a shell company registered in Nevada linked to George and Richard Brock, could not be reached for comment.\n\nKeyBank Real Estate Capital provided a $52.6 million loan to Post Investment for the acquisition, according to property records. It comes with a seven-year term. A spokesperson for the lender did not respond to a request for comment.\nIt’s unclear if brokers were involved in the sale or the financing.\nPost Investment also recently popped up in the North Hollywood multifamily market, purchasing a 236-unit apartment complex at 12300 Sherman Way with Walker &amp; Dunlop Investment Partners last year for $44 million,\nas TRD previously reported\n.\n",
    "related_links": [
      "https://therealdeal.com/la/2024/12/10/post-and-walker-dunlop-buy-noho-apartment-complex-for-44m/",
      "https://therealdeal.com/la/2024/12/10/post-and-walker-dunlop-buy-noho-apartment-complex-for-44m/",
      "https://therealdeal.com/la/2021/07/09/ravello-nabs-55m-construction-loan-for-palmdale-affordable-project/",
      "https://therealdeal.com/la/2022/07/15/merlone-geier-sells-second-palmdale-mall-in-a-month/"
    ],
    "market": "Los Angeles",
    "published": "Wed, 19 Mar 2025 16:00:00 +0000",
    "published_dt": "2025-03-19T16:00:00+00:00",
    "author": "Abigail Nehring"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/19/city-still-paying-indicted-hotel-owner-weihong-hu/",
    "title": "City still paying indicted hotel owner Weihong Hu $542K a month",
    "subhead": "Company earning cash for nonprofit program amid possible plea agreement",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 19, 2025, 11:45 AM",
    "pub_date_dt": "2025-03-19T11:45:00",
    "content": "Despite being under indictment, hotel owner Weihong Hu continues to reap the rewards of a city contract in Fresh Meadows.\nMayor Eric Adams’ administration is paying one of Hu’s companies $542,000 per month to host a nonprofit program at a Queens hotel, The Guardian\nreported\n. Hu was\nindicted last month\nfor allegedly bribing the chief executive officer of a nonprofit.\nThe Fresh Meadows hotel has housed formerly incarcerated people since 2021 and served as the site for\nmultiple fundraisers\nto support Adams.\nProsecutors say\nHu paid Julio Medina, the head of a taxpayer-funded program for recently released incarcerated people, elaborate kickbacks including the purchase of a $1.3 million townhouse and financing on a luxury vehicle. In exchange, Hu allegedly received more than $20 million in city-funded contracts for two of her hotels, as well as her catering company.\nHu pleaded not guilty to all charges. She is negotiating a plea agreement, according to court filings, though her criminal attorney denies any negotiations.\nCity Comptroller and mayoral candidate Brad Lander is pushing for the Adams administration to cancel a contract extension that would ultimately steer $20 million towards Hu, according to\nThe City\n. The three-year renewal would begin in July.\n\nA spokesperson for the mayor’s office of criminal justice — the contract holder — said the administration is looking for an alternative site, but that it could be challenging; a spokesperson for HousingWorks, the nonprofit occupying the space, said no substantive coordination between the organization and city about relocating has happened.\nSecurity firm owner Christopher Dantzler was also charged in what prosecutors labeled an elaborate kickback scheme involving more than $120 million in public funds being steered toward Exodus. Medina ultimately funneled $51 million in public funds to companies belonging to Hu and Dantzler, according to prosecutors.\nHu was released on a $20 million bond with her passport seized, while Medina and Dantzler were released on $250,000 and $750,000 bonds, respectively. All three defendants pleaded not guilty.\nHu has been on the receiving end of positive regulatory decisions from local officials, including approval of construction projects that were either cited for worker safety or affordable housing violations.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.theguardian.com/us-news/2025/mar/19/eric-adams-nyc-developer",
      "https://therealdeal.com/new-york/2025/02/14/exodus-founder-adams-fundraiser-charged-in-kickback-scheme/",
      "https://therealdeal.com/new-york/2024/05/23/eric-adams-hotel-operator-test-ethical-boundaries/",
      "https://www.thecity.nyc/2025/02/13/julio-medina-exodus-weihong-hu-dantzler/",
      "https://www.thecity.nyc/2025/03/19/comptroller-contract-fundraiser-indicted-mayor/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/2025/02/14/exodus-founder-adams-fundraiser-charged-in-kickback-scheme/",
      "https://therealdeal.com/new-york/2024/05/23/eric-adams-hotel-operator-test-ethical-boundaries/",
      "https://therealdeal.com/new-york/2024/06/14/city-halts-weihong-hu-project/"
    ],
    "market": "New York",
    "published": "Wed, 19 Mar 2025 15:45:00 +0000",
    "published_dt": "2025-03-19T15:45:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/19/glenwood-lands-231m-refi-for-lincoln-square-rental/",
    "title": "Glenwood lands $231M refi for Lincoln Square property",
    "subhead": "NYS Housing Finance Agency provides loan for 339-unit rental building",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 19, 2025, 11:00 AM",
    "pub_date_dt": "2025-03-19T11:00:00",
    "content": "Glenwood Management returned to the NYS Housing Finance Agency to refinance a large rental building in Manhattan’s Lincoln Square.\nThe developer secured a $231 million loan from the state public benefit corporation for the 339-unit rental at 160 West 62nd Street, PincusCo\nreported\n. The loan price per built square foot is $500, and the deal closed about a week ago.\nGlenwood previously\nnabbed a $260 million loan\nfrom the NYS Housing Finance Agency in 2014, around when leasing began at the 54-story tower known as Hawthorn Park. That mortgage helped to finance a portion of the purchase cost, construction and improvements.\nThe developer acquired the site in 2011 from Fordham University for $125 million. The purchase came after Douglaston Development abandoned efforts to construct a 57-story tower at the site, waylaid by the market downturn during the Great Recession.\n\nGlenwood could not immediately be reached by\nThe Real Deal\nfor comment.\nThe building includes retail space. Resident amenities include a lap pool and stone whirlpool spa, seasonal access to an outdoor deck, a fitness center with locker rooms, saunas and dressing areas, a lounge with kitchen facilities, a landscaped outdoor terrace and a children’s playroom. The property is also only steps from Lincoln Center.\nThe property faced controversy when Glenwood\nnot only banned dogs\nweighing 15 pounds or more from the building but also required dogs to be carried by their owners into the elevator to avoid doggy paws scuffing up the lobby floors.\nElsewhere in Lincoln Square, the Gotham Organization and the Carlyle Group\nlanded a $216 million bridge loan\na year ago associated with their acquisition of the building at 200 West 67th Street. The loan, provided by MF1 Capital, was brought to market shortly after Gotham and Carlyle purchased The Aire from A&amp;R Kalimian Realty\nfor $265 million\n.—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.pincusco.com/glenwood-signs-231m-refi-for-339-unit-rental-in-lincoln-square/",
      "https://therealdeal.com/new-york/2014/11/05/glenwood-lines-up-260m-loan-for-hawthorn-park-rental-tower/",
      "https://therealdeal.com/new-york/2014/08/30/uws-building-bans-dog-paws-from-lobby-floor/",
      "https://therealdeal.com/new-york/2024/04/02/carlyle-gotham-secure-216m-loan-on-lincoln-square-tower/",
      "https://therealdeal.com/new-york/2024/02/05/kalimian-sells-lincoln-square-luxury-tower-aire-for-265m/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/2014/11/05/glenwood-lines-up-260m-loan-for-hawthorn-park-rental-tower/",
      "https://therealdeal.com/new-york/2024/04/02/carlyle-gotham-secure-216m-loan-on-lincoln-square-tower/",
      "https://therealdeal.com/new-york/2014/08/30/uws-building-bans-dog-paws-from-lobby-floor/"
    ],
    "market": "New York",
    "published": "Wed, 19 Mar 2025 15:00:00 +0000",
    "published_dt": "2025-03-19T15:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/19/coal-heir-buys-west-palm-beach-condo-for-15m/",
    "title": "Coal heir buys West Palm Beach condo for $15M",
    "subhead": "Unit hit market for $17.5M last March, previously sold for $6.9M in 2020",
    "authors": "ByKate Hinsche",
    "pub_date": "Mar 19, 2025, 10:30 AM",
    "pub_date_dt": "2025-03-19T10:30:00",
    "content": "A coal heir bought a Bristol condo in West Palm Beach for $14.9 million, more than double its previous sale price five years ago.\nRecords show John W. Rich Jr. bought unit 1401 at 1100 South Flagler Drive from Raymond Richards.\nSamantha Curry of Douglas Elliman had the listing, and Antoinette Vigilante with Sotheby’s International Realty brought the buyer.\nRich is the son of the late John W. Rich Sr., who was the longtime head of Pennsylvania-based mining firms Reading Anthracite Company and Gilberton Coal Company, according to his obituary.\n\nThe seller, Richards, sold his telephone company to AT&amp;T in 1994, according to published reports. He bought the condo for $6.9 million in 2020, property records show. The 4,500-square-foot unit has three bedrooms, four bathrooms and one half-bathroom.\nDevelopers Al Adelson and Gene Golub completed the waterfront 25-story, 69-unit Bristol in 2019. The tower’s amenities include a dog park, salon, two spas, a gym, pool and lounge.\nRichards listed his condo for $17.5 million in March of last year, according to Zillow. The sale price is more than double his purchase price five years ago.\nSince its completion,\nthe Bristol\nhas attracted a slew of high-profile buyers. In April, the estate of late Boston real estate mogul and art collector Gerald Fineberg sold his penthouse for\n$28 million\n. In 2023, an intellectual property lawyer bought a unit for\n$19.8 million\n, setting a price-per-square-foot record for the condominium.That same year,\nMotorola heir Christopher Galvin\nand his wife, Cindy Bardes Galvin, listed their Bristol condo for $29 million. It has yet to sell, and the current asking price is $22.9 million, Zillow shows.",
    "related_links": [
      "https://therealdeal.com/tag/the-bristol/",
      "https://therealdeal.com/miami/2024/04/08/late-gerald-finebergs-west-palm-beach-ph-sells-for-28m/",
      "https://therealdeal.com/miami/2023/05/25/attorney-pays-20m-for-bristol-condo-setting-price-per-square-foot-record/",
      "https://therealdeal.com/national/2023/06/18/motorola-heirs-list-bristol-condo-in-west-palm-beach-for-29m/"
    ],
    "market": "South Florida",
    "published": "Wed, 19 Mar 2025 14:30:00 +0000",
    "published_dt": "2025-03-19T14:30:00+00:00",
    "author": "Kate Hinsche"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/19/palm-beach-county-weekly-condo-report-22/",
    "title": "Bristol closing tops Palm Beach County weekly condo sales",
    "subhead": "Top 10 sales ranged from $1.8M to $14.9M",
    "authors": "ByKate Hinsche",
    "pub_date": "Mar 19, 2025, 9:45 AM",
    "pub_date_dt": "2025-03-19T09:45:00",
    "content": "Palm Beach County’s condo sales and dollar volume rose in the second week of March.\nBrokers closed 139 condo sales totaling $96.4 million from Mar. 9 to Mar. 16. The previous week, brokers closed 111 condo sales totaling\n$57 million\n.\nLast week’s units sold for an average of $693,338, higher than the $513,901 average price from the previous week. The average price per square foot rose to $387 from $311, according to data from Redfin.\nFor the top 10 sales, prices ranged from $1.8 million to $14.9 million.\nUnit 1401 at The Bristol, at 1100 South Flagler Drive in West Palm Beach, took the top spot with a $14.9 million closing. The sale closed at $3,419 per square foot after 349 days on market.\nSamantha Curry with Douglas Elliman had the listing, and Antoinette Vigilante with Sotheby’s International Realty brought the buyer.\nPH 5 at Sun &amp; Surf, at 100 Sunrise Avenue in Palm Beach, closed for the second highest amount, $9.9 million, or $3,301 per square foot after 181 days on market.\nDana Koch with the Corcoran Group had the listing, and Spencer Schlager with Douglas Elliman brought the buyer.\nHere’s a breakdown of the top 10 sales from Mar. 9 to Mar. 16:\n\nMost Expensive\nBristol, 1100 South Flagler Drive, unit 1401, in West Palm Beach | Price: $14,900,000 | $3,419 psf | Listing agent: Samantha Curry with Douglas Elliman | Buyer’s agent: Antoinette Vigilante with Sotheby’s International Realty\nLeast Expensive\nPlacide, 1800 South Ocean Boulevard, PH-C, in Boca Raton | Price: $1,815,000 | $1,027 psf | Listing agents: Michael Wells and Scot Karp with Premier Estate Properties | Buyer’s agent: Gregory Frank with Compass\nHighest Price Per Square Foot\nBristol, 1100 South Flagler Drive, unit 1401, in West Palm Beach | Price: $14,900,000 | $3,419 psf | Listing agent: Samantha Curry with Douglas Elliman | Buyer’s agent: Antoinette Vigilante with Sotheby’s International Realty\nLowest Price Per Square Foot\nOcean Place, 2155 South Ocean Boulevard, unit 24, in Delray Beach | Price: $2,300,000 | $695 psf | Listing agents: Candace Friis and Phillip Friis with the Corcoran Group | Buyer’s agent: Ryan Parker with Coldwell Banker",
    "related_links": [
      "https://therealdeal.com/miami/2025/03/12/palm-beach-county-weekly-condo-report-21/"
    ],
    "market": "South Florida",
    "published": "Wed, 19 Mar 2025 13:45:00 +0000",
    "published_dt": "2025-03-19T13:45:00+00:00",
    "author": "Kate Hinsche"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/19/real-estate-donates-to-andrew-cuomos-mayoral-campaign/",
    "title": "The Daily Dirt: Real estate pours money into Cuomo mayoral bid",
    "subhead": "Filings show industry donors favored the former governor’s campaign",
    "authors": "ByKathryn Brenzel",
    "pub_date": "Mar 19, 2025, 9:22 AM",
    "pub_date_dt": "2025-03-19T09:22:00",
    "content": "Stop me if you’ve heard this one before: People in real estate gave Andrew Cuomo money.\nIt has been a while since I’ve written a story about this, but there was a time when it was a regular thing.\nThe latest campaign filings (showing donations between Jan. 12 and March 13) show RXR CEO Scott Rechler, previously a\nconsistent\ndonor to Cuomo when he was governor, gave Fix the City,\na super PAC backing\nCuomo, $250,000. He also donated $2,100 directly to Cuomo’s campaign this month.\nAn entity tied to Lightstone contributed $100,000 to the PAC. Joseph Paolino Jr., former mayor of Rhode Island turned developer, gave $25,000. A&amp;E Real Estate’s Douglas Eisenberg donated $125,000 to the PAC. Anthony Scarmucci’s Skybridge Capital threw the PAC $100,000. Scarmucci and his wife also each gave $2,100 to Cuomo’s campaign.\nTwenty-one people who self-identified as working in real estate gave Cuomo’s campaign the maximum $2,100, or a total of more than $44,000. That group included Cammeby’s Avi Schron, KRE Group’s Jonathan Kushner, Capstone Equities’ Daniel Ghadamian, Ruben Companies’ Andrew and Richard Ruben, Somerset’s Keith Rubenstein, GFP’s Jeff Gural and BFC Partners’ Winthrop Wharton.\nSeveral employees of L+M Development Partners gave to Cuomo, including Ron Moelis ($400), as did employees of Two Trees Management (including founder David and principal Jed Walentas, with the latter having also donated to Whitney Tilson and Zellnor Myrie).\nDonors who indicated that they work in real estate gave more than $73,000 to Cuomo’s campaign. But many real estate folks are sneaky and list their occupation as CEO or chief executive or self-employed, which is a small part of why sifting through campaign donations is a nightmare.\nAmong that group, in addition to Gural and Rechler, I spotted MAG Partners’ MaryAnne Gilmartin, who donated $1,000 and Ashley Cotton (who\npreviously worked for Cuomo\n), who gave $250. Brown Harris Stevens CEO Bess Freedman donated $250, as did Douglaston Development’s Jessica Sherman.\nReal estate donors in the other campaigns are more scattered. Mayor Eric Adams previously could count on donations from heavy hitters in the industry, but many have\nbacked off\ngiving to his campaign since his indictment. His latest filing shows he only brought in a little more than $36,000 between Jan. 12 and March 13, with only a couple donations from smaller real estate players.\nA PAC tied to the Real Estate Board of New York (Taxpayers for an Affordable New York) gave City Council Speaker Adrienne Adams $2,100.\n“Adrienne Adams has advanced a pro-growth agenda as Speaker, most notably in her support for City of Yes,” REBNY President Jim Whelan said in a statement. He noted that the passage of the broker fee bill, known as the FARE Act, was “deeply disappointing” but said she is an “important voice to the Mayor’s race.”\nAdams is also remains an influential force in the city, given that even if she loses the primary, she will be the City Council Speaker through the end of the year.\n\nLaszlo Syrop, managing director of acquisitions at the Hudson Companies, donated $175 to Sen. Zellnor Myrie. Moelis also gave Myrie $400.\nA PAC tied to Airbnb has spent more than $400,000 on ads supporting City Council incumbents Kevin Riley, Oswald Feliz, Amanda Farias, Selvena Brooks-Powers and Mercedes Narcisse. The groups is also supporting Tyrell Hankerson’s bid for Adrienne Adams’ Council seat and Rafael Salamanca’s campaign for Bronx Borough President. The incumbents are all sponsors on a bill that would ease stringent short-term rental rules for allow one- and two-family homes, allowing owners to rent out their property for fewer than 30 days, using sites like Airbnb.\nWhat we’re thinking about:\nWhat do you make of real estate companies\nrolling back\ntheir diversity, equity and inclusion policies? Do you have any experiences with these programs and policies? Send a note to\nkathryn@therealdeal.com\n.\nA thing we’ve learned:\nThere was a time when mortgages were great? Bill Pulte, the new director of the Federal Housing Finance Agency,\nposted “Make Mortgages Great Again” on social media platform X\non Saturday. On Monday, Pulte removed eight members from the Fannie Mae board and six members from the Freddie Mac board.\nElsewhere in New York…\n— The city agreed to pay cab drivers $140 million in back pay to settle a lawsuit filed in 2006,\nGothamist reports\n. A federal court found that the Taxi and Limousine Commission unfairly revoked licenses from thousands of drivers after they were arrested, even though they were never convicted.\n— The state will pay $8 million to settle a claim brought by Carl Dukes, who spent nearly two decades in prison for a murder he did not commit,\nthe Times Union reports\n. The settlement comes after a state appellate court ruled that Albany detectives had coerced a confession from Dukes, related to the murder of a University at Albany student in 1997. The court found that Dukes was innocent and should be further compensated for the time he spent incarcerated.\n— Unless a court says otherwise, the city’s congestion pricing program will continue despite the Friday shutdown deadline set by the Federal Highway Administration,\nCBS New York reports\n. MTA Chair and CEO Janno Lieber said the “deadline will come and go and the congestion pricing program will continue to deliver much better traffic environment for New York and economic benefits as well.”\nClosing Time\nResidential:\nThe priciest residential sale Tuesday was\n$60 million\nfor a 5,840-square-foot condominium at 150 Charles Street in the West Village. Peter Zaitzeff, Jared Freedman and Samantha Germano of\nSerhant had the listing\n.\nCommercial:\nThe most expensive commercial closing of the day was\n$27.5 million\nfor a 9,765-square-foot commercial building at 34 East 61st Street in Lenox Hill. Christian Advocates Serving Evangelism (CASE) sold the property to Kassin Sabbagh Realty.\nNew to the Market:\nThe highest price for a residential property hitting the market was\n$29.5 million\nfor a 4,019-square-foot condominium at 432 Park Avenue in Midtown. The Eklund Gomes Team at Douglas Elliman has the listing.\nBreaking Ground:\nThe largest new building application filed was for a 226,342-square-foot, eight-story, 236-unit project at 694 East 142nd Street in North New York. Alen Moghaddam filed the permit on behalf of NYC’s Building &amp; Land Development Services.\n— Matthew Elo",
    "related_links": [
      "https://therealdeal.com/new-york/2018/02/25/cuomo-made-appointments-to-state-boards-then-in-apparent-defiance-of-his-own-executive-order-he-cashed-their-checks/",
      "https://www.nyccfb.info/ftmsearch/IndependentSpenders/Contributions?ec=2025&rt=ind&indId=Z193",
      "https://therealdeal.com/new-york/2016/02/29/real-estates-new-it-position-chief-of-staff/",
      "https://therealdeal.com/new-york/2025/01/18/real-estate-donates-to-eric-adams-in-a-stream-not-a-flood/",
      "https://therealdeal.com/national/2025/03/18/real-estate-firms-scrap-dei-after-trump-orders/",
      "mailto:kathryn@therealdeal.com",
      "https://x.com/pulte/status/1901119197070885082",
      "https://gothamist.com/news/nyc-settles-lawsuit-with-thousands-of-cab-drivers-for-140m-biggest-payout-of-its-kind",
      "https://www.timesunion.com/capitol/article/state-pay-8m-man-wrongly-convicted-1997-albany-20226209.php",
      "https://www.cbsnews.com/newyork/news/federal-deadline-to-stop-nycs-congestion-pricing-toll/",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025031800263001",
      "https://serhant.com/properties/150-charles-street-9a-new-york-city-ny-10014-rls20009115",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025030700903001",
      "https://www.elliman.com/newyorkcity/sales/detail/527-l-704-17_23385280/432-park-ave-66b-midtown-east-new-york-ny-10022"
    ],
    "market": "New York",
    "published": "Wed, 19 Mar 2025 13:22:45 +0000",
    "published_dt": "2025-03-19T13:22:45+00:00",
    "author": "Kathryn Brenzel"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/19/landlord-sues-brandon-millers-reec-over-abandoned-nolita-office-project/",
    "title": "Landlord sues Brandon Miller’s REEC over abandoned Nolita office project",
    "subhead": "Kinsmen alleges Miller, partner Mark Seigel guaranteed construction",
    "authors": "ByElizabeth CryanResearch byMatthew Elo",
    "pub_date": "Mar 19, 2025, 8:00 AM",
    "pub_date_dt": "2025-03-19T08:00:00",
    "content": "The owner of a Nolita property once slated for development by\nBrandon Miller’s\nReal Estate Equities Corporation is suing the developer and its principals for abandoning the ill-fated office project.\nAri Zagdanski’s Kinsmen Property Group\nclaims Real Estate Equities, or REEC, owes more than $2.9 million in ground rent at 156-166 Bowery Street, according to a new lawsuit filed in state Supreme Court. Kinsmen is suing REEC, principal Mark Seigel and Brandon Miller’s widow Candice, who’s the\nadministrator of his estate\n.\nThe landlord claims that REEC owes more than $5.3 million in back rent, demolition costs, tax reimbursements and outstanding liens on the property.\nREEC took over the leasehold for the 15,000-square-foot assemblage in February 2021 in a deal valued at $50 million. It agreed to demolish the property within 18 months and complete construction on a six- or seven-story mixed-use office building by February 2026, the suit alleges.\nBut that never happened. Instead, REEC failed to pay the ground rent or made partial payments for several months in 2024, the suit alleges. REEC also bailed on more than $600,000 in real estate taxes, which Kinsmen paid to avoid interest and penalties, the suit alleges. The landlord slapped REEC with a default notice in August, the month after\nMiller died\n.\n\nKinsmen filed permits in October to tear down the vacant, graffiti-covered buildings on the property and spent $1.7 million on demolition and related costs, the suit alleges. The landlord later demanded to be reimbursed by Seigel and Candice Miller, as successor to Brandon, who it says “jointly and severally” guaranteed the construction costs.\nLawyers for Kinsmen and Miller did not immediately respond to comment. Seigel did not immediately respond to a request for comment.\nBrandon Miller died by suicide on July 3, leaving behind a tangled web of\nunfinished real estate projects\nand delinquent payments. REEC has gone dark since Brandon’s death and the company’s website is now hidden behind a password, raising questions about the future of REEC and its projects.\nThe landlord terminated REEC’s ground lease in January.\nMeanwhile,\ntwo other properties\nonce envisioned by Miller are turning a corner. Leasing has begun at an East Village office property developed by REEC and a vacant lot in Chelsea where Miller once envisioned another office building is up for sale.\n",
    "related_links": [
      "https://therealdeal.com/magazine/october-2024/what-haunted-brandon-miller/",
      "https://therealdeal.com/new-york/2024/10/03/landlord-files-demo-plans-for-brandon-miller-property/",
      "https://therealdeal.com/new-york/2024/08/23/brandon-millers-chelsea-development-stuck-in-limbo-after-he-died-without-a-will/",
      "https://therealdeal.com/new-york/2024/07/08/developer-brandon-miller-dies-at-43/",
      "https://therealdeal.com/new-york/2024/07/17/what-was-brandon-millers-strategy-at-real-estate-equities/",
      "https://therealdeal.com/new-york/2025/02/14/a-new-chapter-begins-for-two-brandon-miller-projects/",
      "https://therealdeal.com/new-york/2024/08/23/brandon-millers-chelsea-development-stuck-in-limbo-after-he-died-without-a-will/",
      "https://therealdeal.com/new-york/2024/10/03/landlord-files-demo-plans-for-brandon-miller-property/",
      "https://therealdeal.com/magazine/october-2024/what-haunted-brandon-miller/"
    ],
    "market": "New York",
    "published": "Wed, 19 Mar 2025 12:00:00 +0000",
    "published_dt": "2025-03-19T12:00:00+00:00",
    "author": "Elizabeth Cryan, Matthew Elo"
  },
  {
    "url": "https://therealdeal.com/national/washington-dc/2025/03/19/brookfield-records-another-loss-on-an-office-sale/",
    "title": "Brookfield records another loss on an office sale",
    "subhead": "Firm sells property in Arlington for $47M",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 19, 2025, 7:00 AM",
    "pub_date_dt": "2025-03-19T07:00:00",
    "content": "Brookfield has sold yet another building at a loss.\nA Brookfield fund sold the eight-story office building at 1005 North Glebe Road in Arlington, Virginia for $47 million, the Washington Business Journal\nreported\n. The deal for the 148,000-square-foot building breaks down to $318 per square foot.\nThe asset manager sold the Arlington Medical Center last month, but the deal only appeared in Arlington County property records recently. Brookfield did not respond to a request for comment from the publication.\nThe sale represented a modest loss for Brookfield. The firm acquired the 1980s-built property, then known as Fairgate at Ballston, for $50.1 million in 2021. The seller at the time was WashREIT — since rebranded to Elme Communities — which bought the property in 2012 for $52.2 million.\nThe property’s tenants include the nonprofit Inova Health System and Virginia Heart, a cardiovascular care provider. Procon Consulting was a previous tenant.\n\nThe buyers appear to be affiliates of Chicago-based Remedy Medical Properties and Boca Raton-based Kayne Anderson Capital Advisors. An official from the former signed a deed of trust and collateral assignment, while someone from Kayne Anderson signed state corporation filings for the ownership entity. Neither company responded to requests for comment.\nRemedy used the building as part of a $73 million collateralized loan with Ally Bank.\nThe loss could’ve been worse. The county’s assessed value of the property is $40.4 million, well below the 2021 assessment of $55.4 million.\nIt’s also modest in comparison to another Brookfield sale in Manhattan. The firm recently sold a 10-story office building\nfor $150 million\nto iconic photography retailer B&amp;H Photo, sources told\nThe Real Deal.\nThat building went for $105 million less than what the company paid for in 2018.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.bizjournals.com/washington/news/2025/03/17/ballston-brookfield-office-remedy-kayne-anderson.html",
      "https://therealdeal.com/new-york/2025/03/18/bh-photo-buys-333-west-34th-street-from-brookfield/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/2025/03/17/brookfield-takes-100m-hit-on-garment-district-office/",
      "https://therealdeal.com/new-york/2025/03/18/bh-photo-buys-333-west-34th-street-from-brookfield/",
      "https://therealdeal.com/magazine/national-august-2023/how-brookfield-made-2b-in-defaults-disappear/"
    ],
    "market": "National",
    "published": "Wed, 19 Mar 2025 11:00:00 +0000",
    "published_dt": "2025-03-19T11:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/18/4terra-srm-plan-to-swap-offices-for-apartments-near-uc-berkeley/",
    "title": "4Terra, SRM plan to swap offices for apartments near UC Berkeley",
    "subhead": "JV would tear down a three-story office building to build 201 apartments",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 8:30 PM",
    "pub_date_dt": "2025-03-18T20:30:00",
    "content": "4Terra Investments and SRM Associates want to replace a three-story office building with a 201-unit apartment building near UC Berkeley.\nThe San Francisco-based developer and Alameda-based property owner have filed plans to build the eight-story building at 2100 Milvia Street, two blocks west of campus,\nthe San Francisco Business Times reported\n. The offices would be demolished.\nPlans call for a 209,000-square-foot building with 3,750 square feet of ground-floor commercial space. Of the project’s 201 apartments, four would be live-work spaces and 11 units would be set aside as affordable.\nThe developers would employ Senate Bill 330 to streamline approvals. A Berkeley Design Review Committee is slated to review the project on Wednesday.\nBerkeley, a city once challenging to build in, has approved dozens of residential towers in Downtown to meet a local housing crunch, while rezoning its\nSouthside\nto double the development potential.\nUC Berkeley provides housing for a quarter of its students, the lowest of all UC campuses.\n\nSRM Associates purchased the office building on Milvia in 1996 for an undisclosed price.\n4Terra Investments, founded in 2013 by Amir Massih, has built more than 30,000 apartments and student-oriented units across Northern California, according to its website, LinkedIn page and state business records.\n4Terra is behind several other Bay Area projects, including\na seven-story, 75-unit project at\n2550 Shattuck\nin Berkeley and a 169-unit project called the Kittredge at an unknown location in Downtown Berkeley, according to the Business Times.\nThe developer also plans to build a 203-unit apartment building at\n400 Divisadero in San Francisco\n, on the site of a former car wash.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.bizjournals.com/sanfrancisco/news/2025/03/17/berkeley-4terra-2100-milvia-office-residential-srm.html",
      "https://www.bizjournals.com/sanfrancisco/news/2023/11/22/berkeley-campus-housing-taller-buildings.html",
      "https://www.bizjournals.com/sanfrancisco/news/2025/01/21/berkeley-sb-230-2550-shattuck-apartment-4terrra.html",
      "https://www.bizjournals.com/sanfrancisco/news/2025/01/21/berkeley-sb-230-2550-shattuck-apartment-4terrra.html",
      "https://www.bizjournals.com/sanfrancisco/news/2024/06/17/4terra-400-divisadero-nopa-touchless-car-wash-sf.html",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/02/21/read-acquires-98-unit-berkeley-building-for-32m-38-off/",
      "https://therealdeal.com/san-francisco/2025/01/22/nx-ventures-advances-plan-for-apartment-building-in-berkeley/",
      "https://therealdeal.com/san-francisco/2023/03/23/six-proposed-highrises-would-tower-over-downtown-berkeley/"
    ],
    "market": "San Francisco",
    "published": "Wed, 19 Mar 2025 00:30:00 +0000",
    "published_dt": "2025-03-19T00:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/18/developers-trim-koreatown-vision-by-32-floors/",
    "title": "Developers trim Koreatown vision by 32 floors",
    "subhead": "Townline, Forme advance with 318-unit apartment complex in Koreatown",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 8:27 PM",
    "pub_date_dt": "2025-03-18T20:27:00",
    "content": "Townline and Forme Development have trimmed the towering height of a proposed apartment building in Koreatown, which won a preliminary nod for eight stories.\nThe Los Angeles City Planning Commission approved the latest plan by the Vancouver-based developers for a 318-unit complex at 550 South Shatto Place,\nUrbanize Los Angeles reported\n.\nInitial plans by the Canadian joint venture called for\na 32-story building\nin 2018 and a\n40-story, 367-unit tower\napproved by the City Council three years later. The apartments would be built next to the former First English Evangelical Lutheran Church at Shatto and 6th Street.\nIt’s not clear why the developers downsized the project.\nPlans call for an eight-story building with 318 studio, one- and two-bedroom apartments above a two-level parking garage for 194 cars. About 21,000 square feet of shops, restaurants or offices would partially take up the 89-year-old church building included in the project.\nThe developers employed density bonus incentives to permit a taller building than allowed by zoning rules in exchange for 35 affordable apartments for\nvery low-income households.\nThe beige complex, designed by Downtown-based KTGY, would include large windows and external balconies, with floor-to-ceiling windows on the ground floor, according to a rendering.\n\nOmgivning, based in Elysian Park, designed the adaptive-reuse of the\nSpanish Colonial Revival church, built in 1936\nand later used as a gym by the New Covenant Academy, a private school.\nA cost and timeline for the project were not disclosed. Construction is expected to take 18 months.\nTownline and Forme Development have also teamed up for a proposed 23-story, 178-unit highrise at 942 Broadway, in Chinatown, which was\nslated to break ground in 2021\n, according to Urbanize. It remains a dirt lot.\nTownline, founded by Rick Ilich in 1981, has built a range of residential properties, from multifamily to townhomes and single-family homes, according to its LinkedIn page.\nForme Development, founded by Damon Chan in 2017, focuses on mixed-use, high-rise multi-family residential, retail and office buildings along the West Coast, with offices in Vancouver and Los Angeles.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://la.urbanize.city/post/scaled-down-development-gets-approval-550-s-shatto-pl-koreatown",
      "https://la.urbanize.city/post/32-story-tower-planned-6th-shatto",
      "https://therealdeal.com/la/2021/10/26/koreatown-tower-trims-transient-units-grows-to-40-stories-gets-city-council-greenlight/",
      "https://la.urbanize.city/post/here-are-californias-affordable-housing-income-limits-2024",
      "https://planning.lacity.gov/eir/SCEAs/documents/Soul/files/II%20-%20Project%20Description.pdf",
      "https://la.urbanize.city/post/chinatown-downtown-942-broadway-harmony-construction-apartments",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2021/10/26/koreatown-tower-trims-transient-units-grows-to-40-stories-gets-city-council-greenlight/",
      "https://therealdeal.com/la/2021/04/23/41-story-koreatown-tower-project-clears-key-city-hurdle/",
      "https://therealdeal.com/la/2025/03/12/jamison-scores-50m-refi-for-koreatown-apartment-complex/"
    ],
    "market": "Los Angeles",
    "published": "Wed, 19 Mar 2025 00:27:56 +0000",
    "published_dt": "2025-03-19T00:27:56+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/18/savills-consolidates-expands-with-new-century-city-digs/",
    "title": "Savills to consolidate DTLA, Westwood offices in Century City",
    "subhead": "Brokerage takes 20K sf full floor at 1900 Avenue of the Stars",
    "authors": "ByLauren Elkies Schram",
    "pub_date": "Mar 18, 2025, 7:30 PM",
    "pub_date_dt": "2025-03-18T19:30:00",
    "content": "Savills is consolidating its two Los Angeles offices — one in Downtown and the other in Westwood — and expanding with a move to around 20,000 square feet in Century City.\nThe tenant-side brokerage plans to take the entire 11th floor at Anderson Real Estate’s 1900 Avenue of the Stars sometime this summer. It will relocate from 7,800 square feet at 777 South Figueroa Street and 9,973 square feet at 1100 Glendon Avenue, according to a person with knowledge of the deal.\nThe length of the lease, a Savills spokesperson said, is “multi-year.”\nAsking rent in the building ranges from $6.50 to $7.50, according to a spokesperson for CBRE.\nThe Century City building, a 28-story, 627,000-square-foot, Class-A high-rise office building, is undergoing a $100 million redevelopment together with 1800 Avenue of the Stars by owner\nCentury City-based\nAnderson. The redevelopment will be completed in the second quarter, per the Anderson spokesperson.\nThe new digs aim to “create a new, experiential office environment,” Savills Los Angeles region President Josh Gorin, who oversaw lease negotiations for the firm, said in a statement.\n\nPeter Best of LA Realty Partners and David Freitag, Kayla Rix and Rocky Binswanger of CBRE represented the building in lease negotiations. Best didn’t respond to a request for comment.\nWhen asked why Savills would want to leave Downtown L.A., Gorin said via a spokesperson: “Century City offers a prime location that puts us near key clients in industries such as entertainment, legal, financial, and other professional services firms.”\nOffice leasing bounced back across L.A. County at the end of last year, though the bulk of the deals were renewals.\nThe L.A. office market had its best quarter since the start of the pandemic in the fourth quarter, with 3.9 million square feet leased, from 1.7 million square feet a year earlier, according to Savills data.\nAmong the top 10 transactions in Q4, one was in Century City, according to a list from Savills. Loeb &amp; Loeb renewed its 130,000-square-foot space at 101000 Santa Monica Boulevard. Savills’ 40,000-person operations span seven countries.\n",
    "related_links": [
      "https://therealdeal.com/la/2024/11/26/anderson-signs-lease-renewal-for-fat-brands-beverly-hills-hq/",
      "https://therealdeal.com/la/2024/11/26/anderson-signs-lease-renewal-for-fat-brands-beverly-hills-hq/",
      "https://therealdeal.com/la/2024/04/02/jmb-gets-575m-loan-for-century-city-office-project/",
      "https://therealdeal.com/la/2024/01/30/office-vacancy-ticks-up-in-tony-century-city/"
    ],
    "market": "Los Angeles",
    "published": "Tue, 18 Mar 2025 23:30:00 +0000",
    "published_dt": "2025-03-18T23:30:00+00:00",
    "author": "Lauren Elkies Schram"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/18/investors-buy-distressed-chicago-ambassador-hotel-at-discount/",
    "title": "Investors snag distressed Chicago Ambassador Hotel at big discount",
    "subhead": "Gold Coast hotel changed hands after previous owner defaulted on $38.5M following pandemic shutdown",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 6:30 PM",
    "pub_date_dt": "2025-03-18T18:30:00",
    "content": "A group of high net worth investors has purchased the historic Ambassador Chicago Hotel out of receivership after years of financial distress for the Gold Coast landmark.\nA venture managed by Wheeling-based investor Marsha Forsythe acquired the 285-key property at 1301 North State Parkway, Crain’s\nreported\n, resolving a 2023 foreclosure lawsuit that accused the hotel’s previous owner — an affiliate of Chinese investment firm Gaw Capital — of defaulting on a $38.5 million loan when it matured last May.\nThe purchase price was not disclosed, but court records show the buyer reached a deal last summer to acquire the hotel for $30.5 million, or roughly $107,000 per key. It’s a sharp drop from the $60 million Gaw Capital paid for it in 2016.\nThe buyers have added the Ambassador to a cluster of independently managed hotels operated by the Chicago Hotel Collection, which also manages three other properties downtown and in Wrigleyville.\nSeller Gaw Capital invested $11 million in renovations and rebranded the hotel under the Hyatt Joie de Vivre collection in 2020.\n\nThe pandemic forced the hotel to shut down for nearly a year, and it struggled to recover amid a slow rebound for the city’s hospitality sector.\nDowntown Chicago hotels remain below pre-pandemic levels, when adjusted for inflation, despite some signs of a recovery. Revenue per available room was 11 percent higher last year than in 2019, but inflation-adjusted figures show the sector still lagging, according to CoStar.\nThe buyers must stabilize the hotel’s operations fast if they want to turn a profit. The hotel lost $1.2 million last year on $13.9 million in revenue, according to CMBS loan data from Bloomberg.\nThe Ambassador is now the largest hotel in the Chicago Hotel Collection’s portfolio. The company hasn’t revealed renovation plans but has stated the ownership will “honor the hotel’s storied legacy” while introducing upgrades.\n— Judah Duke\n",
    "related_links": [
      "https://www.chicagobusiness.com/commercial-real-estate/investors-buy-distressed-ambassador-hotel-out-receivership",
      "https://therealdeal.com/chicago/2025/03/18/chicago-approves-lgbtq-hotel-in-northalsted/",
      "https://therealdeal.com/chicago/2025/03/07/kim-kardashians-skims-opening-first-store-in-chicago/",
      "https://therealdeal.com/chicago/2025/03/10/gold-coast-penthouse-is-priciest-chicago-home-sale-this-year/"
    ],
    "market": "Chicago",
    "published": "Tue, 18 Mar 2025 22:30:00 +0000",
    "published_dt": "2025-03-18T22:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/18/two-ai-companies-sign-on-at-swigs-soma-building/",
    "title": "Two AI companies sign on at Swig’s 501 Second Street",
    "subhead": "LangChain, unitQ take combined 20,000 sf in SoMa, indicating AI demand in SF",
    "authors": "ByEmily Landes",
    "pub_date": "Mar 18, 2025, 6:30 PM",
    "pub_date_dt": "2025-03-18T18:30:00",
    "content": "The Swig Company has signed two new artificial intelligence tenants at 501 Second Street in SoMa, for nearly 20,000 square feet combined, according to a press release from the San Francisco-based owner and developer.\nLangChain, an open-source framework for building applications using large language models, is taking 11,800 square feet in the seven-story 200,000-square-foot former warehouse, while unitQ, an AI-enabled product quality and user experience analytics platform, has signed on for 7,500 square feet.\nA Swig representative said that the company could not comment on specific lease terms like length, price per square foot and tenant improvements, but did say unitQ moved in in February, while LangChain is expected to do so May 1.\nCory Kristoff, Swig’s director of leasing, said in a statement that the company was happy to welcome “two San Francisco-based enterprises advancing the application of artificial intelligence in business” and that it looked forward to “supporting their future growth.”\nMike McCarthy, Brian McCarthy and Maddie Meyersieck of Transwestern represented Swig in both transactions. They did not immediately reply to a request for comment via a spokesperson.\nA Transwestern marketing page for the property indicates that the recently snagged LangChain space is Suite 120, which is located directly off the lobby and has two large conference rooms, five smaller huddle rooms, a private shower, an open kitchen/dining area and 16-foot-high ceilings. The unitQ space appears to be Suite 212, which has 10 conference rooms and an open kitchen. A Swig representative would not confirm the suite numbers.\nThere are still seven vacant suites in the building totaling about 50,000 square feet, according to the site, which also shows three of those have been undergoing spec suite renovations. They will be delivered in April, Swig confirmed.\n\nBlake Walker and Caroline O’Loughlin Livermore of CBRE represented LangChain. Walker said LangChain would be moving into a furnished space, which “minimized disruption” so they could focus on their business and give their team “an office they enjoy coming into.”\n“The decision to move to 501 Second Street was driven by favorable economics, term flexibility, and a high-quality workspace that supports their growing team,” he said.\nWill Cassriel and Grant Dettmer of JLL represented unitQ. They did not immediately reply to a request for comment via a representative.\nAI has been touted as the likely taker for a substantial portion of San Francisco’s one-third-empty office space. There were\n86 AI leases signed last year\nin the city, according to Kilroy analysis, with AI expected to drive another 1 million to 1.5 million square feet in absorption this year. Tech office leasing was up 17 percent last year,\ndriven by AI\ndemand, according to CBRE.\nAI companies are “absolutely” having an impact on the office market, Walker said, adding that with 5 million square feet of leased space, the city’s 200 AI companies represent nearly 9% of the total occupied office space in the city.\n“These AI companies recognize the strategic value of being in San Francisco—not just for access to talent and investors, but for building in-office cultures that will help shape the future of downtown,” he said.\nIf more of these AI companies come to SoMa, it would be a much-needed boost to the neighborhood, which has been\nhit harder than other SF markets\nby tech’s office retreat since the pandemic. At the end of 2024, SoMa was 40 percent vacant, compared to 36.5 percent citywide, according to CBRE data.\n",
    "related_links": [
      "https://therealdeal.com/san-francisco/2025/02/14/sfs-86-ai-office-leases-last-year-driving-rebound/",
      "https://therealdeal.com/san-francisco/2024/12/23/tech-office-leasing-jumps-17-in-sf-half-driven-by-ai-firms/",
      "https://therealdeal.com/san-francisco/2024/10/18/where-are-new-hot-spots-in-san-francisco-office-market/",
      "https://therealdeal.com/san-francisco/2025/02/14/sfs-86-ai-office-leases-last-year-driving-rebound/",
      "https://therealdeal.com/san-francisco/2024/12/23/tech-office-leasing-jumps-17-in-sf-half-driven-by-ai-firms/",
      "https://therealdeal.com/san-francisco/2024/10/18/where-are-new-hot-spots-in-san-francisco-office-market/"
    ],
    "market": "San Francisco",
    "published": "Tue, 18 Mar 2025 22:30:00 +0000",
    "published_dt": "2025-03-18T22:30:00+00:00",
    "author": "Emily Landes"
  },
  {
    "url": "https://therealdeal.com/national/atlanta/2025/03/18/jp-morgan-affiliate-buys-massive-atlanta-rental-portfolio/",
    "title": "JP Morgan lands $176M to buy single-family rental portfolio",
    "subhead": "Brookfield loan on trend with institutional investment in Sun Belt built-to-rent market",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 5:32 PM",
    "pub_date_dt": "2025-03-18T17:32:00",
    "content": "A JPMorgan Asset Management-backed investment group has acquired a massive portfolio of single-family rentals across metro Atlanta, the Atlanta Business Chronicle reported.\nThe 709-home deal comes with a $176 million credit facility from New York-based Brookfield Asset Management to support the acquisition. That’s $248,000 per home.\nThe portfolio includes seven rental communities located in six growing Atlanta suburbs: McDonough, Loganville, Cartersville, Dallas, Hoschton and Jefferson.\nThe homes feature a mix of three-, four- and five-bedroom layouts, catering to renters seeking more space amid rising homeownership costs.\nWalker &amp; Dunlop’s New York capital markets team secured the loan and cited Atlanta’s strong job market and population growth as factors driving demand for suburban rental housing.\n\nIt aligns with a broader strategy among institutional investors to expand their presence in the built-to-rent sector, especially\nacross the relatively low-density Sun Belt\n. With\nhome prices continuing to rise\n, companies are increasing their stakes in single-family rentals to meet the demand from would-be buyers priced out of the market.\nThe deal follows\nanother JPMorgan-backed venture\n, with Georgia Capital and homebuilder Paran Homes, which is developing built-to-rent communities across the Southeast. At least one of those projects is already underway in the Atlanta suburbs.\nMetro Atlanta has emerged as a key market for institutional landlords, who see long-term potential in the region’s growing population and affordability compared to other Sun Belt cities.\nInvestors are betting demand for professionally managed rental communities will continue to rise as millennials and young families are priced out of homeownership.\n— Judah Duke\n",
    "related_links": [
      "https://therealdeal.com/texas/austin/2025/02/06/dallas-fort-worth-is-second-best-market-for-built-to-rent/",
      "https://therealdeal.com/national/2025/02/28/pending-home-sales-crater-to-all-time-low-again/",
      "https://therealdeal.com/national/atlanta/2025/02/19/jpmorgan-georgia-capital-target-built-to-rent-development/",
      "https://therealdeal.com/national/atlanta/2025/02/19/jpmorgan-georgia-capital-target-built-to-rent-development/",
      "https://therealdeal.com/texas/austin/2025/02/06/dallas-fort-worth-is-second-best-market-for-built-to-rent/",
      "https://therealdeal.com/national/atlanta/2025/02/03/dream-finders-homes-enters-atlanta-market-with-acquisition/"
    ],
    "market": "National",
    "published": "Tue, 18 Mar 2025 21:32:39 +0000",
    "published_dt": "2025-03-18T21:32:39+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/18/haley-hospitality-buys-hotel-in-laguna-hills-for-17m/",
    "title": "Haley Hospitality buys 121-room hotel in Laguna Hills for $17M",
    "subhead": "Deal comes after investor’s OC hotel deal with 107% return",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 5:30 PM",
    "pub_date_dt": "2025-03-18T17:30:00",
    "content": "Haley Hospitality Enterprises has snapped up a 121-room hotel in Laguna Hills for nearly $17 million after selling a hotel in Costa Mesa at a hefty profit for a hotel-to-residential conversion.\nThe Lake Forest-based hospitality firm led by Bhavesh Ahir bought the three-story Laguna Hills Lodge at 23932 Paseo De Valencia,\nthe Orange County Business Journal\nreported, citing CoStar. The seller was locally based LHMLP.\nThe deal works out to nearly $140,500 per room. Brokers Oliver Shah and Justin Myers of Atlas Hospitality Group represented the buyers. It’s not clear what LHMLP paid for the property, and when.\nThe 87,500-square-foot economy class hotel, built in 1968, is near Interstate 5 at El Toro Road. Its rooms were recently offered for discount rates for refugees of January’s fires in Pacific Palisades and Altadena.\nHotel sales in central and south OC have cooled, according to CoStar. Sales between Newport Beach and Dana Point were $125 million during the last “volume year,” compared to a three-year average of $340 million a year.\nThe market didn’t prevent Haley from doing well in its sale late last year of a 120-room Travelodge by Wyndham Orange County Airport/ Costa Mesa at 1400 Bristol Street\nIn December, the county agreed to buy the Travelodge from Haley for conversion into homeless housing under the state’s\nProject Homekey program\n. The hotel purchase and conversion into 78 supported apartments was to cost\n$45 million\n.\n\nThe $45 million redevelopment project, dubbed Homekey Bristol, included a $4 million contribution from Costa Mesa and $3 million from neighboring Newport Beach. Orange County kicked in $7 million and nearly 50 project-based vouchers. The grants totalled\n$14 million\n.\nThe bulk of the money came from a Project Homekey grant from the state Department of Housing and Community Development, which kicked in\n$29 million\nfor the project led by American Family Housing. The Midway City-based nonprofit developer was to revamp the motel and run it as supportive housing.\nSuch grants generally cover the purchase of the property. In the case of the Travelodge, that means Haley likely sold the 120-room hotel for $29 million, or $241,667 per room.\nHaley Hospitality bought the Travelodge, built in 1970, in 2021 for\n$14 million\n, or $116,667 per room, according to the Central OC Times. The purchase came at the height of the pandemic, when the\nhotel industry tanked\nwhile\ntens of thousands of rooms\nwent dark.\nThree years later, the county, via a grant from the state, bought the 54-year-old motor inn for a 107 percent markup for its last traded price. And Haley walked away with a windfall.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.ocbj.com/real-estate/orange-county-companies-exchange-laguna-hills-lodge/",
      "https://therealdeal.com/la/2022/08/29/project-homekey-to-pump-452m-into-la-market/",
      "https://www.ocregister.com/2024/08/22/costa-mesa-motel-will-be-converted-into-supportive-housing-with-29-million-state-grant/",
      "https://therealdeal.com/la/2024/12/19/oc-to-buy-travelodge-motel-in-costa-mesa-for-project-homekey/",
      "https://therealdeal.com/la/2024/08/26/american-family-housing-to-convert-costa-mesa-motel-to-homes/",
      "https://centraloctimes.com/stories/619309404-haley-hospitality-enterprises-llc-purchases-1400-bristol-st-costa-mesa-for-14m",
      "https://therealdeal.com/magazine/national-february-2021/check-out-anytime-you-like/",
      "https://therealdeal.com/new-york/2022/10/25/lights-out-why-more-than-10000-hotel-rooms-remain-closed/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2024/12/19/oc-to-buy-travelodge-motel-in-costa-mesa-for-project-homekey/",
      "https://therealdeal.com/la/2024/08/26/american-family-housing-to-convert-costa-mesa-motel-to-homes/",
      "https://therealdeal.com/la/2024/02/02/shangri-la-industries-loses-homekey-sites-to-receiverships/"
    ],
    "market": "Los Angeles",
    "published": "Tue, 18 Mar 2025 21:30:00 +0000",
    "published_dt": "2025-03-18T21:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/18/bullet-train-battle-could-impede-dallas-convention-center-project/",
    "title": "DFW bullet train threatens to derail convention center",
    "subhead": "Design plans still up in the air months after groundbreaking ceremony",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 5:30 PM",
    "pub_date_dt": "2025-03-18T17:30:00",
    "content": "A proposed high-speed rail line connecting Dallas and Fort Worth is throwing a wrench in plans\nfor Dallas’ new convention center.\nNearly a year after the city\ncelebrated the groundbreaking\nof the $3.7 billion expansion of the Kay Bailey Hutchison Convention Center, Hunt Realty proposed shifting the project toward Reunion Tower, the site of a\n$5 billion redevelopment project\nby Hunt, the Dallas Morning News\nreported\n.\nAt issue is the $6 billion high-speed rail line, which is being spearheaded by the North Central Texas Council of Governments.\nHunt has been trying to kill the project for years, arguing it would impede the Reunion redevelopment, which is set to include thousands of multifamily units, a hotel, office and retail, since the track will be seven stories high. Economic analyst the Perryman Group conducted a study that validated Hunt’s fears and found the train could lead to the closing of the Hyatt and billions in losses for the city.\n\nProponents of the rail line claim moving the convention center would delay the opening of the facility and stymie the development of the train, which the North Central Texas Council of Governments has spent years planning.\nHunt president Colin Fitzgibbons said in a statement that he heard the city was still exploring location options for the convention center. Although a groundbreaking ceremony was held last year, the convention center design hasn’t been finalized; plans for the facility have shifted multiple times.\nConcerns about the train project compelled Dallas City Council to back an alternative route for the train last summer; officials said they’d revisit the issue after reviewing the economic impact of various high-speed routes.\nHunt is also the developer behind NorthEnd, a $5 billion mixed-use development that will include a\n$500 million campus\nfor Goldman Sachs.\n–Jess Hardin\n",
    "related_links": [
      "https://www.dallasnews.com/news/2024/06/26/dallas-37b-convention-center-expansion-underway/",
      "https://therealdeal.com/texas/dallas/2023/12/15/hunt-pouring-5b-into-redevelopment-of-reunion-tower-area/",
      "https://www.dallasnews.com/business/real-estate/2025/03/17/could-dallas-convention-center-move-near-reunion-tower-hunt-realty-presents-plan-to-city/",
      "https://therealdeal.com/texas/dallas/2023/10/10/goldman-sachs-starts-500m-dallas-campus/",
      "https://therealdeal.com/texas/dallas/2023/10/10/goldman-sachs-starts-500m-dallas-campus/",
      "https://therealdeal.com/magazine/october-2024/wall-to-yall/",
      "https://therealdeal.com/texas/dallas/2023/12/15/hunt-pouring-5b-into-redevelopment-of-reunion-tower-area/"
    ],
    "market": "Texas",
    "published": "Tue, 18 Mar 2025 21:30:00 +0000",
    "published_dt": "2025-03-18T21:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/18/tourmaline-capital-buys-coral-gables-columbus-center/",
    "title": "Tourmaline pays $76M for Coral Gables office complex facing foreclosure",
    "subhead": "Lender Värde Partners had alleged the previous owner, Affinius Capital, defaulted on a $69M debt",
    "authors": "ByLidia Dinkova",
    "pub_date": "Mar 18, 2025, 5:00 PM",
    "pub_date_dt": "2025-03-18T17:00:00",
    "content": "A year into Coral Gables’ Columbus Center’s debt woes, Tourmaline Capital Partners paid $76 million for the property facing foreclosure.\nBryn Mawr, Pennsylvania-based Tourmaline bought the office complex consisting of a 14-story building and an eight-story building on a 2.5-acre site at 1 Alhambra Plaza, according to records and real estate database Vizzda. The buyer borrowed $71.6 million for the purchase from Banesco USA.\nThe 262,000-square-foot complex was sold by receiver Chris Neilson, who was appointed by the court to oversee Columbus Center and its financials in the foreclosure suit pending against its previous owner, San Antonio, Texas-based Affinius Capital.\nAffinius started facing issues with its Columbus Center debt in March of last year. At the time, Affinius’ $71.6 million loan on the property\nentered special servicing\ndue to its failure to renew an interest rate cap for its floating-rate loan, according to Morningstar Credit. That constituted a default under the financing agreement between Affinius and lender Värde Partners.\nAn interest rate cap is a hedge against rate increases.\nIn October, Minneapolis-based Värde filed the foreclosure suit against Affinius, alleging it defaulted on a\n$68.9 million\nloan. The total amount owed was $77.4 million, including interest and late fees, according to the complaint.\n\nThe $76 million sale to Tourmaline doesn’t satisfy the total debt owed, but “represents a reasonable and fair market value,” according to a motion to approve the sale filed by the receiver and Värde in January in the foreclosure case. Tourmaline bought the property free from liens or other financial obligations.\nAffinius’ attorney in the foreclosure case, Jamie Zysk Isani, didn’t immediately return a request for comment.\nAffinius, led by Len O’Donnell, paid $10.7 million for Columbus Center in 1989, financing the purchase with a $10.6 million loan, according to records. The loan was amended several times in the following decades and assigned to Värde in 2020.\nTourmaline, led by\nBrandon Huffman\n, also has an ownership stake in the 34-story\nCitigroup Center\nat 201 South Biscayne Boulevard in downtown Miami. In 2023, Tourmaline and New York-based Monarch Alternative Capital paid\n$250 million\nfor the 28-story office tower at 801 Brickell Avenue in Miami’s Brickell. It marked the\nbiggest\nSouth Florida office deal that year.\nSouth Florida’s office landlords have felt the\nsting\nfrom higher interest rates, skyrocketing property insurance and skittish lenders. While the tri-county region became a magnet for out-of-state companies from late 2020 through 2022, demand slowed in recent years. In some cases, even well-leased buildings have struggled due to higher interest rates.\nIn downtown Fort Lauderdale, lender Trimont filed a foreclosure suit in August against Alliance HP for allegedly defaulting on a\n$59.2 million\nloan for the 28-story One Financial Plaza at 100 Southeast Third Avenue. The case is pending, with Neilson serving as the court-appointed receiver for that property as well.\n",
    "related_links": [
      "https://therealdeal.com/miami/2024/06/21/affinius-capitals-columbus-center-loan-in-special-servicing/",
      "https://therealdeal.com/miami/2024/10/10/varde-files-foreclosure-against-coral-gables-office-owner/",
      "https://therealdeal.com/miami/2023/12/12/q-a-with-tourmaline-capital-partners-ceo-brandon-huffman/",
      "https://therealdeal.com/miami/2021/05/12/monarch-paying-300m-for-downtown-miami-office-tower/",
      "https://therealdeal.com/miami/2023/09/27/nuveen-selling-801-brickell-to-monarch-tourmaline-capital/",
      "https://therealdeal.com/miami/2023/12/20/inside-south-floridas-top-office-sales-of-2023/",
      "https://therealdeal.com/magazine/national-december-2023/tough-decisions-south-florida-to-feel-sting-as-office-debt-matures/",
      "https://therealdeal.com/miami/2024/08/23/alliance-hp-fort-lauderdale-office-tower-faces-foreclosure/",
      "https://therealdeal.com/magazine/national-june-2023/dont-believe-the-hype-the-true-story-of-south-floridas-office-space/"
    ],
    "market": "South Florida",
    "published": "Tue, 18 Mar 2025 21:00:00 +0000",
    "published_dt": "2025-03-18T21:00:00+00:00",
    "author": "Lidia Dinkova"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/18/santana-row-gets-in-on-ai-office-rush/",
    "title": "Santana Row gets in on AI office rush",
    "subhead": "Federal Realty inks leases for Etched, Securiti.ai in upscale San Jose district",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 5:00 PM",
    "pub_date_dt": "2025-03-18T17:00:00",
    "content": "Artificial intelligence firms are moving into San Jose’s upscale Santana Row.\nEtched, based in Cupertino, and Securiti.ai, based in San Jose, leased a combined 60,400 square feet in the One Santa West building at 3155 Olsen Drive,\nthe San Jose Mercury News reported\n.\nTerms of the separate deals with landlord Federal Realty Investment Trust, based in Maryland, developer and principal owner of the mixed-use Santa Row district, were not disclosed.\nEtched, which makes specialty AI semiconductor chips, leased the 49,500-square-foot second floor.\nSecuriti.ai, which provides software services to allow for safer use of artificial intelligence and data, leased 10,900 square feet on the third floor.\nWith these deals, the 375,000-square-foot One Santana West is now 80 percent leased, according to Jan Sweetnam, chief investment officer for Federal Realty.\n“Santana West is ideal for companies seeking a modern and efficient workspace and the deepest set of amenities and services available,” Sweetnam told the Mercury News.\n\nThe AI tech leases occurred after the real estate investment trust pivoted from its original strategy to lease the entire building to a single tenant.\nAfter Federal Realty decided to make chunks of the offices available to separate tenants, One Santana West began to draw firms interested in flexible leasing options.\nA\ncrush of companies that piled into the eight-story building\ninclude PwC U.S. Group, which leased 141,000 square feet; Acrisure, for  29,000 square feet; Couchbase for 23,700 square feet; Calix, for 23,000 square feet; Pivot Interiors, for 15,000 square feet; and  BetterHelp, for 10,400 square feet.\nThe Good Eating Company, a full-service cafe, has struck a deal to operate on the office building’s ground floor.\nThe building’s 20 percent vacancy compares to the\n21.8 percent vacancy\nfor Silicon Valley in the third quarter, according to a\nDecember report\nfrom Joint Venture Silicon Valley and JLL Silicon Valley, according to the San Jose Spotlight.\nSouth Bay office availability — empty offices plus offices being listed for sublease — was 25.9 percent in the fourth quarter ending in December,\naccording to Savills\n.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.mercurynews.com/2025/03/17/san-jose-tech-economy-office-property-build-real-estate-ai-develop/",
      "https://therealdeal.com/san-francisco/2025/02/06/one-santana-west-in-san-jose-70-leased/",
      "https://sanjosespotlight.com/silicon-valley-san-jose-commercial-real-estate-vacancy-rates-pass-20-percent/",
      "https://siliconvalleyindicators.org/special-reports/commercial-space-q3-2024/",
      "https://www.mercurynews.com/2025/01/07/san-jose-south-bay-tech-nvidia-google-amazon-economy-jobs-office-work/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/02/06/one-santana-west-in-san-jose-70-leased/",
      "https://therealdeal.com/san-francisco/2024/04/02/pwc-signs-141k-sf-lease-at-santana-row-in-san-jose/",
      "https://therealdeal.com/san-francisco/2024/02/23/silicon-valley-vies-with-sf-as-ai-capital-of-the-world/"
    ],
    "market": "San Francisco",
    "published": "Tue, 18 Mar 2025 21:00:00 +0000",
    "published_dt": "2025-03-18T21:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/austin/2025/03/18/19m-mansion-hits-austin-market-as-luxury-listings-swell/",
    "title": "$19M mansion hits market as luxury listings swell",
    "subhead": "Inventory jumped with 48 offerings over $2 million",
    "authors": "ByJudah Duke",
    "pub_date": "Mar 18, 2025, 4:39 PM",
    "pub_date_dt": "2025-03-18T16:39:00",
    "content": "A $19 million asking price for an estate on the Colorado River topped Austin’s offerings last week as listings over $2 million surged.\nThe property, at 4705 Island Cove, includes an updated modern home on just over an acre with an adjacent 2.1-acre lot at 4709 Island Cove.\nThe main residence features eight living spaces, including a game room, walk-in humidor, pool with swim-up bar and an outdoor kitchen. The property also includes three guest suites, a safe room, three-car garage and a two-slip boat garage. The asking price pencils out to $1,860 per square feet.\nA separate listing includes 4705 Island Cove, 4709 Island Cove and 4400 Island Avenue for $25.5 million, combining 4.85 acres and approximately 450 feet of Lake Austin frontage.\nEric Moreland of Moreland Properties has the listing; the identity of the seller, who owns all three properties, is hidden by a trust.\nForty-eight listings over $2 million were added to Austin’s inventory last week, 12 more than it added\nthe week prior\n, according to the Eklund Gomes luxury report.\n\nContracts on luxury homes dipped, from 12 the week before to six last week, five single-family homes and one $2.24 million condo. Purchases typically slow when the annual 9-day SXSW festival and conference takes over the city, Eklund Gomes’ Michael Reisor said.\nThe top contract was for a 5,800-square-foot home last listed for $5.3 million at 4900 Amarra Drive in Barton Creek. It has five bedrooms and a detached guesthouse. It asked $900 per square foot and was listed by Eric Moreland.\nThe other four single-family homes ranged in listed price from $2.5 to $3.25 million, with three in Tarrytown and one near Bee Cave, in the Bella Montagna neighborhood.\nThe condo deal went down for a penthouse asking about $900 per square foot at 901 West 9th Street, unit 704, at the Nokonah residences. The nearly 2,500-square-foot unit has 2 bedrooms, a balcony and an 800-bottle wine cellar.\nThe Nokonah was developed by Robert Barnstone and Perry Lorenz in 2001. The condo was listed by Moreland Properties’ Diane Humphreys.\n— Judah Duke",
    "related_links": [
      "https://therealdeal.com/texas/austin/2025/03/11/austin-luxury-condo-market-gains-steam/"
    ],
    "market": "Texas",
    "published": "Tue, 18 Mar 2025 20:39:56 +0000",
    "published_dt": "2025-03-18T20:39:56+00:00",
    "author": "Judah Duke"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/18/shoma-sells-hialeah-project-to-imc-equity/",
    "title": "Shoma sheds another property, sells Hialeah project to IMC for $81M",
    "subhead": "Coral Gables-based firm also recently sold Bird Road dev site to 13th Floor, Related Group and LeFrak",
    "authors": "ByFrancisco Alvarado",
    "pub_date": "Mar 18, 2025, 4:30 PM",
    "pub_date_dt": "2025-03-18T16:30:00",
    "content": "For the second time in less than a month, Shoma Group’s commercial portfolio got lighter — along with its overall debt.\nThe Coral Gables-based firm, led by power couple Masoud Shoajee and\nStephanie Shojaee\n, sold a fairly new Hialeah mixed-use project to Yoram Izhak’s North Miami-based IMC Equity Group, records and real estate database Vizzda show.\nAs part of the deal, IMC Equity assumed a\n$65 million\nloan from the U.S. Department of Housing and Urban Development that financed construction of Shoma Village, a complex of two eight-story apartment buildings with 304 units and a seven-story parking garage that Shoma completed in 2022. IMC Equity’s purchase also included two retail outparcels spanning 8,076 square feet built in 2023.\nIMC Equity representatives did not respond to requests for comment. “Shoma Group has sold tens of thousands of units since 1985 and has never kept any assets longer than two or three years,” A Shoma spokespeson said in a statement. “This has always been our business model — develop a project and sell the assets. There has been no change in our strategy.”\nRoughly three weeks ago, Shoma sold a 2.5-acre shuttered car dealership at 3650 Bird Road for\n$35 million\n, abandoning plans to redevelop the site into a two-tower mixed-use project with 748 apartments and 20,000 square feet of retail.\n\nShoma sold the property for $1 million above its\n$34 million\npurchase price in 2022. A joint venture between 13th Floor Investments and Related Group, two Coconut Grove-based firms, and New York-based LeFrak Organization bought the site.\nThe same day the deal closed, Shoma paid off a $38.8 million loan secured by the former dealership, records show.\nShoma and its top two executives have faced some turmoil in recent months. In December, a foreclosure complaint was filed against Masoud and Stephanie Shojaee and two trusts under his name for allegedly failing to repay a\n$10.5 million\nloan secured by the retail component of Shoma Village. The lender voluntarily dismissed the lawsuit two weeks after filing it.\nIn January,\nCity National Bank\nfiled a foreclosure lawsuit against Masoud Shojaee and a Shoma entity alleging default on loans totaling $14.1 million, including a mortgage on a Coral Gables condo where the Shojaees reside. The bank quickly dismissed the complaint and reinstated the loans after reaching a settlement.\nShoma is also facing a pending construction defects lawsuit by the condominium association for\nTen30\n, a boutique three-story condominium with 33 units in Miami Beach that Shoma built in 2022.",
    "related_links": [
      "https://therealdeal.com/miami/2024/11/25/stephanie-shojaee-joins-real-housewives-of-miami/",
      "https://therealdeal.com/miami/2020/07/17/shoma-group-scores-67m-loan-for-mixed-use-hialeah-project/",
      "https://therealdeal.com/miami/2025/03/07/13th-floor-lefrak-related-pay-35m-for-shoma-dev-site/",
      "https://therealdeal.com/miami/2022/05/06/shoma-pays-34m-for-miami-apartment-towers-dev-site/",
      "https://therealdeal.com/miami/2024/12/13/lender-sues-masoud-and-stephanie-shojaee-over-11m-debt/",
      "https://therealdeal.com/miami/2025/02/06/city-national-bank-drops-lawsuit-against-masoud-shojaee/",
      "https://therealdeal.com/miami/2024/12/05/ten30-condo-association-sues-shoma-group-for-alleged-defects/"
    ],
    "market": "South Florida",
    "published": "Tue, 18 Mar 2025 20:30:00 +0000",
    "published_dt": "2025-03-18T20:30:00+00:00",
    "author": "Francisco Alvarado"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/18/national-association-of-realtors-roundly-disliked-survey-finds/",
    "title": "NAR missteps alienate pros, public alike",
    "subhead": "Sexual harassment, commission collusion put organization in the doghouse",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 4:00 PM",
    "pub_date_dt": "2025-03-18T16:00:00",
    "content": "The National Association of Realtors is in the doghouse.\nThe Chicago-based organization’s reputation hasn’t recovered from recent setbacks, and it is unpopular with real estate professionals as well as the general public, according to the\nHousing Sentiment Survey\n, conducted by Lance Lambert’s real estate analytics site ResiClub. It ranked NAR near the bottom among 16 real estate-related entities, with 62 percent of real estate agents and brokers holding an unfavorable view of the organization, Crain’s\nreported\n.\nAmong executives in real estate and housing, 66 percent reported a negative perception, while 68 percent of the general public viewed NAR unfavorably.\nSome top Chicago-area agents weren’t surprised.\nNAR is “so far out of touch with reality” that it failed to anticipate the class-action lawsuits challenging its long-standing commission model, prominent Compass agent Mario Greco said.\nThe organization, which most agents must join to access multiple listing services, has been under intense scrutiny following a\nsexual harassment scandal in 2023\nand a federal jury ruling that found NAR and large brokerages\ncolluded to keep commissions artificially high\n, making homeownership costlier.\n\nIn response, NAR abandoned its previous commission standards\nlast August\n, but the lack of a unified standard to replace it has\nleft the industry in flux\n.\nJennifer Ames, head of Engel &amp; Völkers Chicago, offered a more measured view, acknowledging that while NAR’s lobbying has been “important” for homeowners, its reputation has taken a major hit. The group has been instrumental in shaping fair housing efforts and advocating for policies like the mortgage interest income-tax deduction.\nNAR CEO Nykia Wright has been\nworking to repair the trade group’s image\n, introducing conduct standards and focusing on restoring trust.\nThe organization responded to the survey results by stating it is committed to strengthening relationships with brokerages, local associations and industry partners.\nAgents are skeptical despite the efforts. Marina Carney, a Compass agent in Lake Forest, said NAR is “a fine mess” but added that meaningful change will take time.\n— Judah Duke\n",
    "related_links": [
      "https://www.resiclubanalytics.com/p/housing-market-2025-q1-resiclub-housing-sentiment-survey%20",
      "https://www.chicagobusiness.com/residential-real-estate/national-association-realtors-scores-poorly-new-survey",
      "https://therealdeal.com/national/2023/08/26/kenny-parcell-accused-of-sexual-harassment-creating-toxic-culture-at-nar/",
      "https://therealdeal.com/national/2024/03/15/nar-resolves-commission-lawsuits/",
      "https://therealdeal.com/national/2024/09/10/nars-remaining-legal-battles-doj-pressure/",
      "https://therealdeal.com/national/2024/03/15/heres-what-nars-landmark-commissions-settlement-means/",
      "https://therealdeal.com/national/2024/08/19/nar-taps-nykia-wright-as-permanent-ceo/",
      "https://therealdeal.com/national/2025/01/13/scotus-denies-to-hear-nars-petition-over-doj-probe/",
      "https://therealdeal.com/national/2024/09/10/nars-remaining-legal-battles-doj-pressure/",
      "https://therealdeal.com/national/2024/08/19/nar-taps-nykia-wright-as-permanent-ceo/"
    ],
    "market": "Chicago",
    "published": "Tue, 18 Mar 2025 20:00:00 +0000",
    "published_dt": "2025-03-18T20:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/tristate/2025/03/18/wilf-familys-west-orange-development-raising-local-worries/",
    "title": "Wilf family’s West Orange development raising local worries",
    "subhead": "Plan to build nearly 500 units far exceeds previous proposal for area",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 3:47 PM",
    "pub_date_dt": "2025-03-18T15:47:00",
    "content": "The Wilf family thinks its revamped development can go event bigger in New Jersey as West Orange looks to contribute its fair share of affordable housing.\nGarden Homes, the development company led by Minnesota Vikings owner Zygi Wilf, proposed building an apartment community of nearly 500 units across four buildings in a forest on top of a mountain in West Orange, Gothamist\nreported\n. A previous 136-home plan for the same land was rejected by the town.\nThe development would include 100 apartments for low- and medium-income residents, which would help West Orange on the path to contributing its fair share of affordable housing, as required under state law.\nLocal opposition is hitched to environmental concerns and the possibility the retraction of the forestland would lead to worse flooding. Environmental experts fear developing the 120-acre land — the largest undeveloped tract in a densely populated part of the state — could also lead to dangers for residents living atop a mountain.\nWest Orange Township Council president Joe Krakoviak doesn’t support the project, but voted in favor of including it in West Orange’s affordable housing plan in 2020, fearing the possibility of a lawsuit and a loss of control over what is ultimately built on the site through builder’s remedy, a court order that allows developers to bypass town control to build affordable housing.\n\nWhen the Wilfs first proposed an initial project in the early 2000s, it was rejected and public safety was the chief reason given. The deputy fire chief testified it would be dangerous and inefficient for both residents and emergency responders.\nAfterwards, local residents banded together to try and preserve the forest as protected open space, but couldn’t come up with the necessary financing.\nWest Orange officials and the Fair Share Housing Center kicked off negotiations over utilizing the land in 2015 to work towards affordable housing goals. At the time, the land was analyzed and there was no objection in including it in the town’s settlement agreement, according to a Fair Share director.\nThe West Orange planning board is set to hold a hearing regarding the project on Wednesday.\n—\nHolden Walter-Warner",
    "related_links": [
      "https://gothamist.com/news/amid-environmental-concerns-billionaire-family-plans-to-build-housing-in-nj-forest",
      "https://therealdeal.com/author/holden-walter-warner/"
    ],
    "market": "New York",
    "published": "Tue, 18 Mar 2025 19:47:01 +0000",
    "published_dt": "2025-03-18T19:47:01+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/18/13th-floor-jsb-nab-68m-davie-rentals-construction-loan/",
    "title": "13th Floor scores $68M construction loan for Davie rentals",
    "subhead": "Complex will consist of 383 apartments, including 77 workforce",
    "authors": "ByLidia Dinkova",
    "pub_date": "Mar 18, 2025, 3:31 PM",
    "pub_date_dt": "2025-03-18T15:31:00",
    "content": "13th Floor Investments and JSB Capital Group scored a $67.5 million construction loan for a 383-unit apartment complex near Broward College in Davie.\nCoconut Grove-based 13th Floor and Miami Beach-based JSB Capital plan the five-story Parks at Davie with some workforce apartments on the northwest corner of Davie Road and Southwest 37th Street, according to a 13th Floor news release. The developers lease the site from Broward College.\nSantander Bank is the lender for the construction financing. Houston-based Marble Capital made a preferred equity investment for an undisclosed amount.\nPeter Mekras led the Aztec Group team that represented the developers in the loan and equity investment.\nParks at Davie will consist of studios and one- to three-bedroom apartments, with units ranging from 568 square feet to 1,415 square feet. It will include 6,200 square feet of retail and co-working space.\nAbout 77 of the units will be at workforce rents, according to a 13th Floor spokesperson. The targeted area median income will be determined when the project is closer to completion.\nConstruction will start this month, and is expected to be completed in 2027, the release says.\n13th Floor\n, led by Arnaud Karsenti, has completed about 3,900 residential units since its founding in 2008 and has more than 4,800 units in the pipeline, according to the release.\n\nIn July, the firm completed the\n420-unit Savio\napartment complex at 1874 Heron Club Drive in Delray Beach. The Ardid family’s Key International, Wexford Real Estate Investors and CDS International Holdings partnered with 13th Floor on Savio, which marked the first phase of their Parks at Delray development slated for a total of 693 apartments and 54 townhouses.\nIn Hallandale Beach, 13th Floor is developing the five-story, 398-unit\nParks at Hallandale\napartment complex at 2002 Pembroke Road.\nJSB, led by J. Jay Lobell, is a private equity and alternative investment firm that focuses on real estate, according to its website. It has ramped up its South Florida investment in recent years.\nIn December, JSB paid\n$69 million\nfor the 197-unit Stellar at Emerald Hills apartment complex at 5800-5840 Lakeshore Drive in Dania Beach. JSB also bought the Havn Residences &amp; Yacht Club condo complex with 36 units and 54 boat slips at 176 Lake Drive in Palm Beach Shores for\n$58.5 million\nin 2023.\nThe Parks at Davie construction loan comes as South Florida faces a multifamily supply overhang. Developers completed a record\n18,600 apartments last year\n, outpacing 15,000 new leases signed, according to CoStar Group data. That’s led to slower lease-ups, an increase in concessions and a slight decrease in rents. South Florida’s median rent dropped by nearly 2 percent in February, year-over-year, a\nRealtor.com report\nshows.\nDemand is expected to catch up to supply this year and next year due to a slowdown of construction starts.\nSouth Florida multifamily\nconstruction lending\ncontinues to flow. This month, TM Real Estate landed\n$53.5 million\nto build the 250-unit Shalimar at Boynton Beach complex at 3570 West Boynton Beach Boulevard in Boynton Beach. That came on the heels of Savanna scoring a\n$380 million\nconstruction loan for the two 26-story Olara project with 170 apartments and 287 condos at 1919 North Flagler Drive in West Palm Beach.\n",
    "related_links": [
      "https://therealdeal.com/tag/13th-floor/",
      "https://therealdeal.com/miami/2022/11/28/13th-floor-jv-nab-102m-construction-loan-for-delray-project/",
      "https://therealdeal.com/miami/2024/08/14/arnaud-karsentis-13th-floor-nabs-rentals-construction-loan/",
      "https://therealdeal.com/miami/2024/12/12/stellar-sells-dania-beach-rental-complex-to-jsb-capital/",
      "https://therealdeal.com/miami/2023/11/01/jsb-capital-buys-singer-island-condos-and-marina-for-59m/",
      "https://therealdeal.com/miami/2025/01/24/after-record-south-florida-rental-completions-lease-ups-slow/",
      "http://realtor.com",
      "https://therealdeal.com/tag/construction-loans/",
      "https://therealdeal.com/miami/2025/03/13/tm-real-estate-nabs-construction-loan-for-boynton-rentals/",
      "https://therealdeal.com/miami/2025/03/07/savanna-lands-380m-construction-loan-for-olara-in-west-palm/",
      "https://therealdeal.com/miami/2025/01/09/13th-floor-plans-340-rentals-at-boca-raton-tri-rail-stop/",
      "https://therealdeal.com/miami/2025/02/27/white-oak-ares-management-plan-davie-apartment-project/",
      "https://therealdeal.com/miami/2025/02/11/calta-group-nabs-construction-loan-for-hollywood-rentals/"
    ],
    "market": "South Florida",
    "published": "Tue, 18 Mar 2025 19:31:17 +0000",
    "published_dt": "2025-03-18T19:31:17+00:00",
    "author": "Lidia Dinkova"
  },
  {
    "url": "https://therealdeal.com/new-york/tristate/2025/03/18/moshe-silber-sentenced-after-mortgage-fraud/",
    "title": "Mortgage fraud co-conspirator sentenced to “significant” 30 months",
    "subhead": "Moshe Silber, now banned from industry, once held $1B in real estate",
    "authors": "ByKeith Larsen",
    "pub_date": "Mar 18, 2025, 3:15 PM",
    "pub_date_dt": "2025-03-18T15:15:00",
    "content": "A federal judge in New Jersey sentenced Moshe Silber to 30 months in prison for his involvement in a\nbroad mortgage fraud scandal\n.\nSilber\n, 35, had turned himself in three weeks ago for violating the terms of his bond. He faced up to five years after pleading guilty to one count of conspiracy to commit mortgage fraud in 2024.\nThe U.S. district court judge, Robert Kirsch, repeatedly said that Silber had committed a “significant crime” and a “significant sentence was necessary.” Silber, a co-conspirator of Boruch Drillman, had teamed up to buy an Ohio apartment building, the Department of Justice said. The group picked up the building, called the Williamsburg of Cincinnati, for $70 million, using a stolen identity, then flipped it to Drillman for $96 million, receiving a $74 million loan based on the second, inflated price.\nKirsch noted he deemed the fraud significant because of the “layers and labyrinth of chicanery.”\nThe sentence is shorter than another one Kirsch handed out in the scandal:  Aron Puretz, who pleaded guilty last year to one count of wire fraud, got\n60 months\n, though his son, Chaim “Eli” Puretz, only\ngot 24.\n\nSilber showed up to the packed court handcuffed, wearing a green jumpsuit with a white undershirt. Dozens of members of\nhis community\nwere present. Women read prayer books and cried during the course of the two-hour hearing.\nAs the judge was reading Silber’s sentencing, someone’s phone went off, and security asked the person to leave.\nKirsch observed that Silber had\nlived the American dream\n, with cars and jewelry worth $2.2 million, but still decided to commit fraud. He also noted how Silber had an annual salary of over $3 million from his father and from someone named Mr. Hoffman, yet claimed to be “in the red” financially.\nThis article has been updated to remove a mention that Mark Nussbaum attended the sentencing. Nussbaum’s attorney, Ethan Kobre, said Nussbaum was not in attendance.\n",
    "related_links": [
      "https://therealdeal.com/magazine/may-2024/too-small-to-fail/",
      "https://therealdeal.com/tag/moshe-silber/",
      "https://therealdeal.com/new-york/tristate/2024/12/17/aron-puretz-sentenced-to-five-years-in-prison-for-fraud/",
      "https://therealdeal.com/new-york/tristate/2025/01/02/eli-puretz-sentenced-to-prison-for-mortgage-scheme/",
      "https://therealdeal.com/magazine/february-2025/lakewood-nj-confronts-a-widening-commercial-mortgage-fraud-scandal/",
      "https://therealdeal.com/new-york/2025/01/28/moshe-silbers-attorney-accuses-doj-of-lying/",
      "https://therealdeal.com/new-york/2024/12/06/new-york-investor-moshe-silber-banned-from-real-estate/",
      "https://therealdeal.com/new-york/2025/01/28/moshe-silbers-attorney-accuses-doj-of-lying/",
      "https://therealdeal.com/magazine/february-2025/lakewood-nj-confronts-a-widening-commercial-mortgage-fraud-scandal/"
    ],
    "market": "New York",
    "published": "Tue, 18 Mar 2025 19:15:50 +0000",
    "published_dt": "2025-03-18T19:15:50+00:00",
    "author": "Keith Larsen"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/18/henry-crown-scores-chicago-lease-expansion-from-fintech-firm/",
    "title": "Henry Crown and Co scores another lease expansion from fintech firm",
    "subhead": "Bucks trend of companies downsizing; office market’s average lease size increased for first time since pandemic",
    "authors": "ByEmma Whalen",
    "pub_date": "Mar 18, 2025, 3:13 PM",
    "pub_date_dt": "2025-03-18T15:13:00",
    "content": "Henry Crown and Company brushed off the Loop’s bleak office leasing landscape with a tenant’s second expansion.\nFintech company NinjaTrader is adding 15,700 square feet at 222 North LaSalle for a second time, bucking the post-pandemic trend of office downsizing. The expansion brings the firm’s space up to nearly 42,000 square feet, spanning a full floor in the 1 million-square-foot building.\nAvison Young’s Chris O’Leary and Jeff Lindenmeyer represented NinjaTrader; Tishman and Speyer represented the landlord.\nNinjatrader previously occupied 6,400 square feet at 363 West Erie Street in River North before relocating to a 19,500-square-foot space at 222 North LaSalle in 2021. The firm added 6,600 square feet in 2023.\n\nThe city’s average office lease size has increased for the first time since the pandemic, a promising sign of resilience, O’Leary said.\nIt’s likely too soon to tell if the broader office market in Chicago is headed for a noticeable turnaround. The downtown office vacancy rate hit 26.3 percent in the fourth quarter, up from 23.8 percent at the end of 2023 and more than double the 13.8 percent rate recorded at the start of the pandemic, according to CBRE.\nHenry Crown and Co. bought the 27-story building at 222 North LaSalle for $112 million in 2006 with a $100 million loan from the Teachers Insurance and Annuity Association of America.\nThe investment firm dates back to 1959 and is tied to one of Chicago’s wealthiest families. One of its scions, the businessman and philanthropist Jim Crown, died in 2023, and his Gold Coast condo at\n65 Goethe Street\n, was listed the following year for $17.5 million.\n",
    "related_links": [
      "https://therealdeal.com/chicago/2024/10/31/the-late-jim-crowns-chicago-condo-lists-for-17-5-million/",
      "https://therealdeal.com/chicago/2025/03/13/chicago-developer-sterling-bay-downsizes-office-space/",
      "https://therealdeal.com/chicago/2025/03/13/beacon-capital-partners-lists-indebted-chicago-office-tower/",
      "https://therealdeal.com/chicago/2025/03/12/investor-pitches-conversion-for-chicagos-pittsfield-building/"
    ],
    "market": "Chicago",
    "published": "Tue, 18 Mar 2025 19:13:59 +0000",
    "published_dt": "2025-03-18T19:13:59+00:00",
    "author": "Emma Whalen"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/18/bh-photo-buys-333-west-34th-street-from-brookfield/",
    "title": "B&H Photo bought Brookfield’s 34th Street office building",
    "subhead": "Iconic camera retailer picked up 333 West 34th Street at steep discount",
    "authors": "ByRich Bockmann",
    "pub_date": "Mar 18, 2025, 2:52 PM",
    "pub_date_dt": "2025-03-18T14:52:00",
    "content": "The identity of the buyer that snapped up Brookfield’s 34th Street office building has come into focus.\nIconic photography retailer B&amp;H Photo is the mystery buyer that purchased Brookfield’s 333 West 34th Street for a\nhefty discount\n, sources told\nThe Real Deal\n.\nProperty records hit yesterday showing Brookfield sold the 10-story building for $150 million — $105 million less than the company paid for the property in 2018. The buyer’s identity had been hidden behind an LLC, which was signed for by Zalman Gottlieb.\nGottlieb is the financial controller for B&amp;H. Representatives for B&amp;H and Brookfield did not immediately respond to requests for comment.\nThe sale of the 287,000-square-foot office property works out to $523 per square foot.\nIt’s not clear what the new owner has planned for the 287,000-square-foot building, which is located around the corner from B&amp;H’s iconic store at 420 Ninth Avenue. The retailer was previously reported to have\nexecutive offices at 440 Ninth Avenue\n.\n\nThe tenants at 333 West 34th Street include the Metropolitan Transportation Authority, Sam Ash Music and Godiva Chocolatier. The MTA leases at least 100,000 square feet on a lease that isn’t set to expire until 2035, according to\nCompStak\n.\nB&amp;H originally opened in Tribeca in 1973 and moved into its current store in 1997. The property is owned by the Kibel Company, which purchased it in 1994, according to property records.\nKnown as the Smith Barney Building, 333 West 34th Street was developed in 1954. SL Green bought the property in 2007 for $184 million and reportedly invested about $26 million worth into it. SL Green sold it to Nicholas Schorsch’s American Realty Capital New York Recovery REIT in 2013 for $220 million.\nThe owner changed its name to New York REIT and then eventually went into liquidation, selling the property to Brookfield.\nThe West Side of Manhattan on 34th Street saw a surge of investment as the Related Companies’ Hudson Yards and Brookfield’s Manhattan West started to rise.\n",
    "related_links": [
      "https://therealdeal.com/new-york/2025/03/17/brookfield-takes-100m-hit-on-garment-district-office/",
      "https://therealdeal.com/new-york/2018/08/02/unizo-holdings-looks-to-sell-another-building-out-of-1-3b-portfolio/",
      "https://property.compstak.com/333-West-34th-Street-New-York/p/81",
      "https://therealdeal.com/new-york/2025/03/17/brookfield-takes-100m-hit-on-garment-district-office/",
      "https://therealdeal.com/new-york/2013/10/21/bh-planning-exit-from-brooklyn-navy-yard/",
      "https://therealdeal.com/new-york/2017/11/09/brookfield-buying-new-york-reits-333-west-34th-for-255m/"
    ],
    "market": "New York",
    "published": "Tue, 18 Mar 2025 18:52:35 +0000",
    "published_dt": "2025-03-18T18:52:35+00:00",
    "author": "Rich Bockmann"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/18/chicago-approves-lgbtq-hotel-in-northalsted/",
    "title": "LGBTQ+ hotel with rooftop pool among handful of rooms in pipeline",
    "subhead": "51-key hotel in Northalsted will replace former Yoshi’s Cafe",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 2:30 PM",
    "pub_date_dt": "2025-03-18T14:30:00",
    "content": "A boutique hotel project geared toward LGBTQ+ travelers is moving forward in Lakeview after receiving Chicago City Council approval, clearing the way for construction to begin.\nThe proposed hotel at 3257 North Halsted Street will have six-stories and 51 rooms, Block Club\nreported\n.\nIt would replace the former Yoshi’s Cafe, a neighborhood staple that closed in 2021 after 39 years in business.\nThe project is led by local developer Allan O’Brien, owner of the Men’s Room Chicago at 3343 North Halsted Street, which sells clothing and accessories for the gay community. His partners in the deal are Andrias Campbell and Bob Sievers.\nThe development will feature a restaurant on its ground floor, a rooftop bar with a pool and cabanas and a speakeasy-style lounge in the basement. The lobby, restaurant, speakeasy and rooftop lounge will be open to the public when not reserved for private events.\nThe rainbow-themed building was designed by Chicago-based Jonathan Splitt Architects.\n\nO’Brien’s team secured the approval with strong community support, having worked with Alderman Bennett Lawson and neighborhood groups. No timeline for construction has been announced.\nThe developer’s “good-neighbor agreement” with the city includes 24-hour on-site staff and security, hosting community events with discounted offerings for neighbors and reinstating a three-car standing zone on Aldine Avenue for guest drop-offs and pickups.\nTo ease congestion, the developers are also working with city officials to establish a second standing zone on Halsted Street for ride-share and taxi access.\nChicago’s hotel development pipeline has fallen to the lowest level in recent years as construction lending froze up, with fewer than 1,500 rooms under construction in the fourth quarter, CoStar\nreported\n— Judah Duke\n",
    "related_links": [
      "https://blockclubchicago.org/2025/03/12/lgbtq-hotel-with-rooftop-bar-speakeasy-in-lakeview-gets-city-council-ok/",
      "https://www.costar.com/article/1060761240/chicago-hotel-development-pipeline-slows-more-than-national-average",
      "https://therealdeal.com/chicago/2025/03/06/skokie-developer-em-hit-with-24m-hotel-site-foreclosure/",
      "https://therealdeal.com/chicago/2025/03/04/struggling-sonder-ditching-hotel-in-chicagos-river-north/",
      "https://therealdeal.com/chicago/2024/11/21/chicago-hotel-owners-push-back-on-massive-tax-valuations/"
    ],
    "market": "Chicago",
    "published": "Tue, 18 Mar 2025 18:30:00 +0000",
    "published_dt": "2025-03-18T18:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/tristate/2025/03/18/baking-powder-heirs-list-the-last-piece-of-their-ct-holdings/",
    "title": "Baking powder heirs list private island in last of Darien holdings",
    "subhead": "Private Hay Island hits the market for $35M",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 2:00 PM",
    "pub_date_dt": "2025-03-18T14:00:00",
    "content": "The Zieglers are continuing their long and expensive farewell to Darien, Connecticut.\nCynthia Ziegler, a descendant of baking powder magnate William Ziegler, listed the private Hay Island off the Gold Coast for $35 million, the New York Post\nreported\n. The 18-acre island is the last piece of real estate held by the Zieglers in Darien, where they’ve embarked on a long-winded selloff.\nThe listing was first reported by\nMansion Global\n. Cynthia and her husband, Renfrew Brighton, are planning to relocate to the south.\nThe island with views of the Long Island Sound is accessible by a gated causeway. Not simply a plot of land, the island also has an 8,700-square-foot colonial home with six bedrooms, seven bathrooms and six fireplaces, and a two-bedroom guest house constructed 15 years ago.\nThere’s also an infinity-edge pool, a private dock and a spa. It takes only minutes to get to the heart of Darien, an affluent town on Connecticut’s Gold Coast.\n\nSotheby’s International Realty’s Lesle McElwreath has the\nlisting\n. She’s pitching the two-lot listing as a way for a buyer to mold a family compound, like the Zieglers did. They’ve since moved “far and wide,” according to McElwreath.\nIn May 2023, the town of Darien\npaid $85 million\nfor Great Island, a peninsula off of the Gold Coast. The Steinkraus family, descended from Ziegler’s granddaughter, put the property up for sale in 2016 for $175 million. The town floated a museum, youth camps, pickleball and a community pool among options for the land, which it aimed to preserve from extensive development.\nIn late 2023, descendants of the industrialist\nsold Ziegler Farm\nto an anonymous buyer for $57.5 million, more than $1 million per acre. The largely undeveloped 51-acre parcel was listed for $85 million, meaning the sellers took a 32 percent discount from the original ask.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://nypost.com/2025/03/13/real-estate/hay-island-in-connecticut-lists-for-35m/",
      "https://www.mansionglobal.com/articles/gilded-age-industrialists-new-england-private-island-hits-the-market-for-35-million-139b19e7",
      "https://www.lesliemcelwreath.com/greenwich/sales/54e7f850-9b1a-4e5b-9d70-332927261063",
      "https://therealdeal.com/new-york/tristate/2023/05/05/fairfield-county-town-closes-on-85m-island-purchase/",
      "https://therealdeal.com/new-york/tristate/2023/12/28/connecticut-waterfront-parcel-sells-for-57m-32-below-ask/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/tristate/2023/12/28/connecticut-waterfront-parcel-sells-for-57m-32-below-ask/",
      "https://therealdeal.com/miami/2024/03/22/baking-powder-heiress-sells-palm-beach-house-for-16m/",
      "https://therealdeal.com/new-york/tristate/2023/05/05/fairfield-county-town-closes-on-85m-island-purchase/"
    ],
    "market": "New York",
    "published": "Tue, 18 Mar 2025 18:00:00 +0000",
    "published_dt": "2025-03-18T18:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/18/saks-fifth-avenue-may-be-poised-to-exit-sfs-union-square/",
    "title": "Retail chain reaction casts doubt on Saks flagship at Union Square",
    "subhead": "Department store’s lease expires in 2027",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 1:59 PM",
    "pub_date_dt": "2025-03-18T13:59:00",
    "content": "The dominoes of department stores and boutique shops falling around San Francisco’s Union Square may include another luxury retail store: Saks Fifth Avenue.\nCanada-based Hudson Bay Company, which owns Saks, appears ready to cut the cord for its appointment-only store at 384 Post Street when its lease expires in 2027,\nthe San Francisco Chronicle reported\n.\nThe move comes after an affiliate of Hudson Bay, Saks Global Enterprises, picked up the Union Square flagship store from Neiman Marcus late last year at 150 Stockton Street during its acquisition of Neiman Marcus and its real estate properties for\n$2.7 billion\n.\nThe transfer of the six-story, 208,900-square-foot building at 150 Stockton assigned a new market value of $160 million, or $766 per square foot, according to public records and an unidentified source.\nThat left Saks, which for decades has leased a 136,000-square-foot building at 384 Post diagonally across the street from Neiman, vulnerable.\nSaks Fifth Avenue faces an expiring lease in January  2027, Charlie McCabe, a locally based real estate investment broker, told the Chronicle. The department store’s ongoing tenure in that building “may be tenuous,” he said.\nSaks pays more than $6 million a year in rent to landlord Lincoln Property, based in Dallas. Last summer, Saks laid off workers as it converted the store to\n“appointment only,”\ncurtailing its retail clout in Union Square.\nKazuko Morgan, a veteran retail broker who specializes in leasing around Union Square, said that she was told Saks doesn’t plan to renew its lease — and hasn’t heard that Saks could move in with Neiman Marcus across the street.\n\n“If Saks does exit the market, it’s not such a terrible thing today, since they have been appointment-only for months,” Morgan told the newspaper. “They’ve already diminished their presence.”\nLincoln Property and Germany-based Cara Investment bought the building in 2021 for $156 million, or $115 per square foot. They now plan to redevelop it as “mixed use,” Morgan said.\nThe loss of Saks could be inscribed into a larger retail tombstone for greater Union Square, once the city’s golden shopping district.\nNordstrom, which for decades anchored the mall at 865 Powell Street, packed up in 2023. Bloomgindale’s, which occupied more than 300,000 square-feet at the nearly empty San Francisco Centre mall,\nwill close this month\n.\nMacy’s, which for decades has occupied its three-building flagship store in Union Square plaza, plans to\nsell the property and close the doors\nof its only San Francisco store.\nOther retailers that have pulled up stakes include Saks Off Fifth, Nordstrom Rack, H&amp;M and Uniqlo, according to the Chronicle. Meanwhile, luxury retailers may be drifting over to historic Jackson Square.\nThis month, Ralph Lauren has returned to San Francisco with a\nnew store at 441 Jackson Street\n, following an\ninflux of luxury retailers\nlike Paul Smith, Isabel Marant and Zimmermann.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.sfchronicle.com/realestate/article/union-square-nieman-marcus-saks-fifth-avenue-20226191.php",
      "https://www.neimanmarcusgroup.com/HBC,-Parent-of-Saks-Fifth-Avenue,-to-Acquire-Neiman-Marcus-Group-for-2-65-Billion-and-Establish-Saks-Global,-a-Technology-Powered-Luxury-Retail-Company",
      "https://www.sfchronicle.com/realestate/article/s-f-union-square-saks-appointment-shopping-19582844.php",
      "https://therealdeal.com/san-francisco/2025/01/23/bloomingdales-to-close-flagship-in-san-francisco-centre-mall/?firstLevel=sanfrancisco&secondLevel=2025&thirdLevel=01&fourthLevel=23&fifthLevel=bloomingdales-to-close-flagship-in-san-francisco-centre-mall",
      "https://therealdeal.com/la/2025/03/03/macys-downtown-los-angeles-closure/",
      "https://therealdeal.com/san-francisco/2025/03/10/star-chef-brick-timber-join-up-on-sf-jackson-square-buy/",
      "https://www.sfchronicle.com/realestate/article/postscript-business-san-francisco-19986839.php",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/03/10/star-chef-brick-timber-join-up-on-sf-jackson-square-buy/",
      "https://therealdeal.com/la/2025/03/03/macys-downtown-los-angeles-closure/",
      "https://therealdeal.com/san-francisco/2025/01/29/sf-retail-agents-read-tea-leaves-on-bloomingdales-exit/"
    ],
    "market": "San Francisco",
    "published": "Tue, 18 Mar 2025 17:59:22 +0000",
    "published_dt": "2025-03-18T17:59:22+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/18/real-estate-firms-scrap-dei-after-trump-orders/",
    "title": "Real estate companies ditch DEI",
    "subhead": "More than a dozen firms removed or tempered information about statistics and programs from annual reports",
    "authors": "ByKathryn Brenzel",
    "pub_date": "Mar 18, 2025, 1:59 PM",
    "pub_date_dt": "2025-03-18T13:59:00",
    "content": "Real estate companies are making sure the words “diversity,” “equity” and “inclusion” do not appear next to each other in public filings.\nMore than a dozen publicly traded firms that had dedicated sections about DEI in last year’s annual reports removed that language in Securities Exchange Commission filings this year. Some swapped diversity lingo for words like “culture” or “workforce,” modifying sections to express that the company values diverse viewpoints or inclusivity in the workplace, while others eliminated once-robust sections bragging about their efforts — but didn’t replace them.\nThe changes coincide with a major political aboutface on DEI.\nPresident Donald Trump began targeting DEI initiatives on his first day in office. He issued one executive order\ndirecting\nfederal agencies to eliminate all DEI programs, policies and positions.\nAnother\nrequires institutions receiving federal grants or contracts to certify that they do not “operate any programs promoting DEI that violate any applicable Federal anti-discrimination laws.” The orders also go after the private sector, instructing federal agencies to identify up to nine potential investigations into public companies, large nonprofits and others related to their DEI practices.\nThe Real Deal\nreviewed 20 public commercial and residential real estate companies with DEI language in their reports. Of those, 15 added or ramped up DEI language in their annual reports after the death of George Floyd in 2020 only to remove it by 2025. Of these, at least two had already reduced or amended the sections in 2024 before eliminating them completely. (Corporations across sectors similarly disposed of their DEI policies, several reports revealed.) It is unclear whether any of these efforts are continuing despite the changes to the reports.\nAfter Floyd was killed, several real estate companies publicly\npledged\nto encourage diversity within their ranks and in the C-suites.\nTRD\n’s review included companies that previously disclosed DEI programs.\nIn its 2020 annual report,\nreleased in February 2021\n, BXP, formerly Boston Properties, indicated that it took “concrete steps to formalize and elevate our focus on diversity and equity within our company and in the communities we serve.” The company pointed to the creation of a Diversity &amp; Inclusion Committee that year, describing its mission as “promoting diversity, inclusion, equality and transparency as part of our culture, business activities and decision-making practices.”\nThe report\nreleased in 2024\nincluded graphics detailing the makeup of the company’s workforce as of 2023, showing that 62 percent of its total workforce is white, 10 percent Black, 10 percent Hispanic, 8 percent Asian and 10 percent other.\nThe annual report\nreleased this year\ndoes not include the “Diversity &amp; Inclusion” section that appeared in reports published over the last four years. Neither of those words appear in reference to BXP’s employees. Instead, the report notes that its policy “has been, and will continue to be” hiring without regard to race, sex, gender identity, disability or any other protected status.\n“Our hiring practices do not, and have not, included quotas or numerical targets based on any of these characteristics,” the report states.\n\nVornado Realty Trust similarly added a diversity and inclusion section to its annual report in 2022 and published employee demographic data. Both disappeared from the report filed in 2025. DEI-related sections were eliminated from annual reports filed this year by several commercial brokerages, including JLL, Cushman &amp; Wakefield, CBRE and Newmark.\nMost of the real estate companies whose reports\nTRD\nreviewed did not respond to requests seeking information on why they eliminated diversity-related sections from their fillings. Timing of the removal of the language suggests that the threat of losing federal contracts or grants, or potentially being investigated, may have contributed to the decisions. A representative for Marcus &amp; Millichap indicated that the removal of its DEI section was not related to the Trump administration’s orders but would not explain the reasons for the change.\nVornado, Newmark and Cushman declined to comment. A person familiar with the reasons for the changes to Newmark’s annual report this year suggested the “Employee Diversity, Inclusion and Equal Opportunity” section was deleted as part of a broader slimming down of the “Human Capital Management” portion of the report, though they couldn’t specify what else had been eliminated. Newmark’s website still features a\ndiversity and inclusion policy\n.\nTrump’s order “escalated” a risk that was already there, according to Andrew Turnbull, an attorney with Morrison Foerster who co-chairs a task force dedicated to DEI strategy and defense at the firm. The 2023 U.S. Supreme Court decision\nstriking down affirmative action\npolicies at colleges and universities had opened the door to legal challenges to DEI programs at corporations, and some companies began scaling back their DEI initiatives before the Trump administration’s actions.\nEmpire State Realty Trust added a “Diversity &amp; Inclusion” section in its annual\nreport released in 2021\n, which disappeared from its annual report in 2024. That report still spoke about the importance of its “diverse workforce.”\n“We strive to attract, hire and retain diverse candidates who meet our high standards,” the report released in 2024 states.\nThat language, however, was removed from the report filed in February 2025.\nReal estate companies, of course, are not alone in changing their diversity and inclusion policies after the Trump administration’s actions. The number of S&amp;P 500 companies that used “diversity, equity and inclusion” language in their public filings so far this year has dropped nearly 60 percent from 2024,\naccording to an analysis\nby the New York Times.\nTurnbull said some companies may have gotten out over their skis with DEI programs, referring to fellowships, internships or hiring targets based on race or gender as high-risk. Still, he advised against wholesale elimination of such initiatives.\n“If they just go in and haphazardly strike their DEI stuff, it could send the wrong message to their employees, and stakeholders,” Turnbull said. “It can have reputational risks if you roll back too far.”\n",
    "related_links": [
      "https://www.whitehouse.gov/presidential-actions/2025/01/ending-radical-and-wasteful-government-dei-programs-and-preferencing/",
      "https://www.whitehouse.gov/presidential-actions/2025/01/ending-illegal-discrimination-and-restoring-merit-based-opportunity/",
      "https://therealdeal.com/magazine/national-july-2022/after-george-floyd/",
      "https://www.sec.gov/ix?doc=/Archives/edgar/data/0001037540/000165642321000006/bxp-20201231.htm",
      "https://www.sec.gov/ix?doc=/Archives/edgar/data/0001037540/000165642324000007/bxp-20231231.htm",
      "https://www.sec.gov/ix?doc=/Archives/edgar/data/0001037540/000165642325000009/bxp-20241231.htm",
      "http://nmrk.imgix.net/uploads/images/Newmark-DI-Policy-FINAL.pdf",
      "https://www.supremecourt.gov/opinions/22pdf/20-1199_hgdj.pdf",
      "https://www.sec.gov/ix?doc=/Archives/edgar/data/0001541401/000162828021003417/esrt-20201231.htm",
      "https://www.nytimes.com/interactive/2025/03/13/business/corporate-america-dei-policy-shifts.html",
      "https://therealdeal.com/magazine/national-july-2022/after-george-floyd/",
      "https://therealdeal.com/magazine/new-york-january-2017/real-estate-diversity-problem/",
      "https://therealdeal.com/new-york/2020/07/21/real-estate-is-acknowledging-its-diversity-problem-now-what/"
    ],
    "market": "National",
    "published": "Tue, 18 Mar 2025 17:59:08 +0000",
    "published_dt": "2025-03-18T17:59:08+00:00",
    "author": "Kathryn Brenzel"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/18/paramount-ceo-brian-robbins-in-contract-on-bev-hills-home/",
    "title": "Paramount Pictures, Nickelodeon CEO in contract to sell Beverly Hills home",
    "subhead": "Trousdale Estates five-bedroom listed for $20.8M",
    "authors": "ByKari Hamanaka",
    "pub_date": "Mar 18, 2025, 1:41 PM",
    "pub_date_dt": "2025-03-18T13:41:00",
    "content": "Media and entertainment honcho\nBrian Robbins\nmoved closer to striking a deal on his Beverly Hills contemporary pad in what marked last week’s top Los Angeles County home under contract.\nThat’s according to the Douglas Elliman Eklund Gomes team’s weekly report, tracking homes that went into contract. The team counts properties in the Multiple Listing Service priced at $4 million or more and lists them by asking dollar volume in its report.\nRobbins, who has been president and CEO of Paramount Pictures and Nickelodeon since 2021, placed the home at 1335 Carla Lane on the market in late January with a $20.8 million asking price.\nThe executive bought the Trousdale Estates property in 2020 for $16.8 million through an entity called Stella Properties LLC, state records show. He nabbed a deal on the home, which was originally listed for nearly $24 million, about a year before he bought it.\nThe Beverly Hills Estates’ Rayni Williams and Branden Williams hold the listing and did not respond to a request for comment.\nThe home is 11,000 square feet with five bedrooms and eight bathrooms. Features include a two-story courtyard, glass walls, oak ceilings, infinity pool and Japanese garden.\n\nSouth of Beverly Hills, a beachfront property on The Strand in Manhattan Beach came in second on the Eklund Gomes report.\nThe home at 304 The Strand in\nManhattan Beach\nis listed at just under $14 million, with Strand Hill Properties’ Kevin Pratt and Amy Olivares marketing the property.\nThe seller is a limited liability company tied to a New York address, property and state records show.\nThere’s a three-bedroom, three-and-a-half bath home on the 3,326-square-foot lot. Above the property’s garage is a one-bed, one-bath unit.\nOverall, Los Angeles County saw 23 signed contracts last week, adding up to asking dollar volume of $161.8 million, according to the Eklund Gomes report. The majority of those contracts, 22, were single-family homes as\ncondo activity\nnormalized from the burst of signings within the segment seen for the week ended March 9.\n",
    "related_links": [
      "https://therealdeal.com/la/2019/09/06/this-week-in-celeb-real-estate-ellen-degeneres-flips-for-santa-barbara-and-jonah-hill-settles-down-in-santa-monicaand-more/",
      "https://therealdeal.com/la/2024/07/22/manhattan-beachs-priciest-home-trade-fetches-24-5m/",
      "https://therealdeal.com/la/2025/03/12/las-condo-market-drives-luxury-resi-contract-activity/",
      "https://therealdeal.com/la/2025/03/12/las-condo-market-drives-luxury-resi-contract-activity/",
      "https://therealdeal.com/la/2025/03/04/la-luxury-residential-contract-activity-slows-to-76m/",
      "https://therealdeal.com/la/2025/02/25/la-inks-120m-in-signed-resi-contracts/"
    ],
    "market": "Los Angeles",
    "published": "Tue, 18 Mar 2025 17:41:01 +0000",
    "published_dt": "2025-03-18T17:41:01+00:00",
    "author": "Kari Hamanaka"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/18/trinity-launches-indian-creek-condo-sales-near-faena/",
    "title": "Trinity leading development of JMH’s former condo project near Faena District",
    "subhead": "Developer tapped Serhant to lead sales in Miami Beach; Jason Halpern’s firm to remain involved",
    "authors": "ByKatherine Kallergis",
    "pub_date": "Mar 18, 2025, 1:30 PM",
    "pub_date_dt": "2025-03-18T13:30:00",
    "content": "Bill and Dana Lozito’s Trinity Southern is taking over development of a long-planned luxury condo project in Miami Beach called 29 Indian Creek,\nThe Real Deal\nhas learned.\nDeveloper Jason Halpern’s JMH Development will remain an investor-partner and adviser on the planned 22-unit development at\n2901 and 2911 Indian Creek Drive\n, near the Faena District, Bill Lozito said. It marks the first South Florida development for New York-based Trinity, an owner-builder that has been involved in the ownership, assemblage or construction of more than 1 million square feet in its history, according to a press release.\nJMH launched sales of an 11-unit building on the site about\ntwo years ago\n.\nTrinity bought into the project for an undisclosed amount in September, Lozito said, declining to disclose more details about the deal.\n“We took the hard work that JMH has done and put our own spin on it,” he said.\nThe development, which will overlook the Indian Creek waterway, will now include a 20-unit condo building with one- and two-bedroom units, and two two-story townhouses, the release said. Prices will range from $1.4 million to just over $3 million, and the developers tapped Ryan Serhant’s\neponymous firm\nto lead sales. Serhant’s other South Florida projects include Mercedes-Benz Places and MG Developer’s\nThe George\ntownhouse development in Coral Gables.\nThe 29 Indian Creek condos will range from 820 square feet to 1,750 square feet. The townhouses will include 500-square-foot terraces with summer kitchens and wet bars.\n\nThe project will have “as many [amenities] as the big developments,” including a rooftop pool, gym and fitness area,” Lozito said. Urban Robot is designing the development.\nBuyers will also receive membership to the beach club at the nearby Miami Beach Edition, according to the release.\nThe team could begin demolition work in April and begin construction shortly after that. The project could be completed by the end of 2026. Trinity is bringing its team down and will supplement construction labor with local subcontractors.\nThe developers will self-fund construction at the start and later take out a construction loan, Lozito said. Trinity is looking to work on additional projects in South Florida, he added.\nThe 0.3-acre Indian Creek development site previously traded in 2017 for $7.8 million. Halpern’s JMH was tied up in\nlitigation\nwith former partners who included investor Dhruv Piplani. In 2022, a judge in New York dismissed the lawsuit filed by Piplani’s PSB Indian Creek and affiliated entities, allowing JMH to move forward with the project.\nIt’s a few blocks away from Len Blavatnik’s Faena District, a luxury complex that includes the Faena House condo building and Faena Hotel Miami Beach, both developed with Alan Faena.\nAman Residences\n, developed by Vlad Doronin and backed by Blavatnik, is under construction in the district.\n",
    "related_links": [
      "https://therealdeal.com/miami/2022/04/12/court-ruling-allows-jason-halpern-to-develop-miami-beach-resi-project/",
      "https://profilemiamire.com/miamirealestate/2023/2/1/twenty-nine-indian-creek-launches-sales-of-luxury-residences-in-the-faena-district",
      "https://therealdeal.com/company/serhant/",
      "https://therealdeal.com/miami/2024/09/17/mg-developer-taps-serhant-to-sell-coral-gables-townhomes/",
      "https://therealdeal.com/miami/2017/03/20/jason-halperns-partner-in-miami-beach-deals-sues-him-seeks-10m/",
      "https://therealdeal.com/miami/2023/01/10/vlad-doronin-len-blavatnik-score-242m-construction-loan-for-aman-miami-beach/",
      "https://therealdeal.com/miami/2022/04/12/court-ruling-allows-jason-halpern-to-develop-miami-beach-resi-project/",
      "https://therealdeal.com/miami/2023/01/10/vlad-doronin-len-blavatnik-score-242m-construction-loan-for-aman-miami-beach/"
    ],
    "market": "South Florida",
    "published": "Tue, 18 Mar 2025 17:30:00 +0000",
    "published_dt": "2025-03-18T17:30:00+00:00",
    "author": "Katherine Kallergis"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/18/dallas-gets-meeting-with-saks-to-save-downtown-neiman-marcus/",
    "title": "Dallas gets Saks to negotiating table in effort to save Neiman Marcus",
    "subhead": "City manager to pitch “financially beneficial” deal for downtown flagship",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 1:30 PM",
    "pub_date_dt": "2025-03-18T13:30:00",
    "content": "Dallas officials secured a meeting with Saks Global as they make a final push to keep the Neiman Marcus flagship open downtown, but the retailer insists its decision to close remains unchanged.\nDallas City Manager Kimberly Bizor Tolbert will meet with Saks executives next week following the city’s latest attempt to pitch what it describes as a “financially beneficial” offer, the Dallas Morning News\nreported\n. Where the meeting will take place wasn’t reported.\nThe meeting comes after Tolbert and the Dallas Consortium, a coalition of business and civic leaders,\nsent a letter\nto Saks Executive Chairman Richard Baker and others, urging a discussion before the store shutters on March 31.\nSaks has “always been open to speaking with the city manager of Dallas,” it said in a statement, but reaffirmed that its decision to close the downtown Neiman Marcus location, which it\nmade in February\n, has not changed.\nThe letter to Baker claimed that keeping the store open for a few more months would allow Saks to “capture the opportunity we wish to discuss.”\n\nThe city has not publicly disclosed details of its proposal but previously worked to remove a major barrier to keeping the store open by securing the deed to a disputed portion of the property earlier this month.\nSaks, which acquired Neiman Marcus for $2.7 billion last year, has\npushed back on the city’s efforts\n, arguing that the situation is “far more complicated than what the public is being led to believe.” The company, which is owned by Hudson Bay Company, has also claimed that some of its previous attempts to engage with Dallas officials were rejected.\nThe meeting is the latest development in an ongoing effort to preserve the store, which has been a landmark in downtown Dallas for over a century. The closure threatens to leave a major void in the city’s retail core, as Neiman Marcus also plans to vacate its 82,000-square-foot headquarters at Cityplace Tower.\nWhile Dallas officials hold out hope for a deal, Saks is already moving forward with plans to invest $100 million into its Neiman Marcus location at NorthPark Center, suggesting its focus is shifting away from downtown.\n— Judah Duke\n",
    "related_links": [
      "https://www.dallasnews.com/business/retail/2025/03/17/dallas-gets-meeting-with-saks-global-over-downtown-neiman/",
      "https://therealdeal.com/texas/dallas/2025/03/17/dallas-officials-make-another-pitch-to-keep-neiman-marcus/",
      "https://therealdeal.com/texas/dallas/2025/02/18/hudson-bay-company-slashes-neiman-marcus-dallas-presence/",
      "https://therealdeal.com/texas/2025/03/05/saks-to-close-historic-neiman-marcus-store/",
      "https://therealdeal.com/texas/dallas/2025/03/17/dallas-officials-make-another-pitch-to-keep-neiman-marcus/",
      "https://therealdeal.com/texas/dallas/2025/02/18/hudson-bay-company-slashes-neiman-marcus-dallas-presence/",
      "https://therealdeal.com/texas/2025/03/05/saks-to-close-historic-neiman-marcus-store/"
    ],
    "market": "Texas",
    "published": "Tue, 18 Mar 2025 17:30:00 +0000",
    "published_dt": "2025-03-18T17:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/18/nasdaq-to-open-second-headquarters-in-dallas-suburb-irving/",
    "title": "Nasdaq joins Y’all Street movement with Dallas expansion",
    "subhead": "Wall Street index to open first regional headquarters in Irving",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 1:05 PM",
    "pub_date_dt": "2025-03-18T13:05:00",
    "content": "The financial migration to “Y’all Street” is accelerating as Nasdaq plans to open its first regional headquarters in Dallas.\nThe stock exchange, long associated with its Times Square presence in New York City, will establish a regional management division at its existing office at 5030 Riverside Drive in Irving later this year to serve Texas and the broader Southeast, The Dallas Morning News\nreported\n.\nThe exchange tapped Rachel Racz, a Texas native and oil-and-gas industry veteran, as senior vice president, head of listings for the Texas, Southern U.S. and Latin America division.\nThe office will house parts of Nasdaq’s technology and financial crime management divisions, which clients use to detect fraud and money laundering, but will not primarily focus on acquiring stock listings.\nNasdaq’s Texas, Southern U.S. and Latin America region serves more than 480 clients across various industries, collectively valued at $1.9 trillion. Within Texas alone, over 200 companies trade on Nasdaq, accounting for $1.3 trillion in market capitalization, the firm said.\nIt’s another sign of Texas’ growing influence in the financial world, and for Dallas, proof that\nY’all Street\nis still filling out.\nThe New York Stock Exchange plans to launch an electronic exchange in Dallas,\nrebranding the Chicago Stock Exchange as NYSE Texas\nand further shifting trading operations to the Southwest.\nMeanwhile, the Texas Stock Exchange, a startup seeking to challenge Wall Street’s longstanding dominance, is awaiting regulatory approval to launch in Dallas next year. The fully electronic exchange has raised $120 million, with backing from BlackRock and Citadel Securities.\n\nNasdaq’s move comes as Dallas developers push a $1 billion transformation of Uptown Dallas into a financial hub that could rival New York’s stronghold.\nThe area has attracted a wave of finance firms in recent years, with its own pool of developers. Hunt Realty hired Ross Perot Jr.’s Hillwood to manage construction of a\n$500 million campus\nfor Goldman Sachs. KDC and Pacific Elm Properties are building a\n30-story tower\nthat will house Bank of America and Granite Properties’ $173 million office tower\nsigned Deloitte for four floors\n, over 100,000 square feet of space.\nGoldman Sachs and Bank of America’s offices are slated to deliver in 2027. Deloitte will enter its offices when Granite Properties’ 23Springs tower opens this year.\nGoldman Sachs recently gave its managers in New York and London an ultimatum to move to either its Dallas hub or to Salt Lake City or face termination.\nThe Lone Star State recently introduced Texas Business Courts to handle corporate matters, part of the state’s play to offer an alternative to Delaware’s Court of Chancery system.\nTexas’ pro-business stance has fueled speculation that more financial firms could shift operations to Dallas, where commercial real estate costs and corporate taxes are significantly lower than in the Northeast.\n— Judah Duke\n",
    "related_links": [
      "https://www.dallasnews.com/business/economy/2025/03/18/nasdaq-plants-roots-in-dallas-with-new-hq-as-north-texas-draws-attention-from-wall-street/",
      "https://therealdeal.com/magazine/october-2024/wall-to-yall/",
      "https://therealdeal.com/chicago/2025/02/14/chicago-stock-exchange-moving-to-texas-yall-street/",
      "https://therealdeal.com/texas/dallas/2023/10/10/goldman-sachs-starts-500m-dallas-campus/",
      "https://therealdeal.com/texas/dallas/2024/04/16/pacific-elm-scores-construction-loan-for-bank-of-america-tower/",
      "https://therealdeal.com/texas/dallas/2024/01/16/deloitte-leases-100k-sf-in-uptown-dallas/",
      "https://therealdeal.com/magazine/october-2024/wall-to-yall/",
      "https://therealdeal.com/chicago/2025/02/14/chicago-stock-exchange-moving-to-texas-yall-street/",
      "https://therealdeal.com/texas/dallas/2024/11/19/oaktree-capital-launches-formida-capital-in-dallas/"
    ],
    "market": "Texas",
    "published": "Tue, 18 Mar 2025 17:05:36 +0000",
    "published_dt": "2025-03-18T17:05:36+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/18/trump-begins-push-to-use-federal-land-for-new-housing/",
    "title": "Trump begins push to use federal land for new housing",
    "subhead": "A taskforce will identify federal land suitable for affordable homes",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 1:00 PM",
    "pub_date_dt": "2025-03-18T13:00:00",
    "content": "Donald Trump is preparing to leverage federal land to boost the nation’s housing stock.\nThe Trump administration is launching a taskforce to identify government land that is suitable for housing development, the Wall Street Journal\nreported\n. The Interior Department and the Department of Housing and Urban Development will lead the taskforce.\nThe initiative will brush up against challenges well known in the homebuilding industry. Infrastructure and zoning — and NIMBYism — could make building more difficult on the local level. Environmental and logistical concerns could also end up at play, not to mention material costs at risk of surging during the trade war with Canada and other countries.\nThe government could sell land to private developers, though that would be on a case-by-case basis, according to a HUD representative. The administration may also work to transfer or lease suitable parcels to local governments, nonprofits or public housing authorities.\nFreeing up federal land for development — either by leasing or transferring parcels — could yield big results. The Bureau of Land Management, which falls under the Interior, has 512,000 acres in its footprint, which would be enough to yield between three and four million homes, according to the American Enterprise Institute.\n\nMuch of the federal land, however, is located in rural states like Utah and Idaho, which aren’t facing the same level of housing shortages as other parts of the nation. Only 7.3 percent of federal land — 47 million acres — is within metro areas in need of more homes, according to data from the National Association of Realtors.\nThe idea has been touted by both parties.\nDuring last year’s vice presidential debate\n, both J.D. Vance and Tim Walz supported building housing on federal land. Walz, however, cited concern for preserving national parks and noted the limited availability of federal land in hot housing markets.\nThe federal government owns 650 million acres, more than a quarter of all land in the country, making it the biggest landlord in the United States.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.wsj.com/economy/housing/trump-wants-to-build-homes-on-federal-land-heres-what-that-would-look-like-6b8fb82e",
      "https://therealdeal.com/new-york/2024/10/03/jd-vance-tim-walz-talk-building-housing-on-federal-land/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/2024/10/03/jd-vance-tim-walz-talk-building-housing-on-federal-land/",
      "https://therealdeal.com/new-york/2024/09/20/the-daily-dirt-the-next-big-housing-developer-isthe-federal-government/",
      "https://therealdeal.com/new-york/2024/08/22/adams-has-agencies-study-city-owned-property-for-housing/"
    ],
    "market": "National",
    "published": "Tue, 18 Mar 2025 17:00:00 +0000",
    "published_dt": "2025-03-18T17:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/18/real-estate-columnist-responds-to-liberal-label/",
    "title": "Engquist’s truth revealed: Closet liberal or industry stooge?",
    "subhead": "To be credible on real estate policies, choose facts over ideology",
    "authors": "ByErik Engquist",
    "pub_date": "Mar 18, 2025, 12:30 PM",
    "pub_date_dt": "2025-03-18T12:30:00",
    "content": "An odd thing happened Sunday after I tweeted about Lee Zeldin’s\nabout-face\non climate change: I was attacked on X by an owner of rent-stabilized housing.\nUsually, we are on the same side. But this landlord’s message accused me of being a left-wing “activist.”\nAgitated, I\nfired back\n:\n“Find one reporter on the planet who has written more about the failure of rent control. Let me know when you do.”\nThis isn’t the only social media commentator to accuse me of bias. X users on the left have accused me of being an enemy of working people and a mouthpiece for the real estate industry.\nWhy? Because I advocate for privately-developed multifamily projects and don’t believe social housing can solve the affordability crisis. Moreover, these critics note that I am employed by a real estate publication.\nI can see why people are confused. They want to assign everyone a label — liberal, conservative, Democrat, Republican, progressive, socialist, even libertarian. This way, instead of considering the contents of what someone says, they can just dismiss it based on a presumed tribal affiliation or financial motive.\nLet me be clear: I don’t take positions on issues for the sake of a political party, ideology, employer or bank account. (No one goes into journalism to make money.)\nCredibility comes from basing your positions on economics, science, data and facts — even if it upsets your audience.\n\nTrying to live up to a label only biases your thinking. You’ll start at the end — “I’m progressive, so I support rent control” or “I’m conservative, so I support free markets” — and then work backward, crafting a rationale for a predetermined conclusion.\nBetter to judge things on a case-by-case basis, even if the results don’t fit a neat pattern. In my case:\nI favor regulation in the form of\ncongestion pricing\nbut not the\nHousing Stability and Tenant Protection Act\n.\nI support affordable housing, but not in a way that\nconcentrates poverty\n.\nI support a minimum wage, but not one that limits apartment projects to 99 units,\nas 485x has\n.\nI cheer the fundamental\nwork standards\nwon by organized labor but not the hotel workers union’s special permit requirement that\nstopped hotel development cold\n.\nSometimes, a policy that seems reasonable — such as giving poor people but not high earners a break on sales tax — is impractical, which is why clothing items priced under $110 in New York are\ntax-free\neven for billionaires.\nThen there’s the\nscaffold law\n, which sounds unreasonable, but on further exploration, is …\neven worse\n.\nThe landlord who questioned my motives was gracious enough to delete the tweet after another reader came to my defense. And the owner then complimented my column about the legislature’s\nbaseless bills\nagainst investors’ buying houses.\nFor the record, on housing issues, we generally agree.\n“We’ll never have enough housing in NYC until it becomes profitable to build, own, operate it,” he\nposted\nrecently. “You can’t\nregulate\nyour way out of a supply problem.”\n",
    "related_links": [
      "https://x.com/erik_engquist/status/1901254175339516372",
      "https://x.com/erik_engquist/status/1901500841841799254",
      "https://therealdeal.com/new-york/2025/02/22/congestion-pricing-results-validate-real-estates-support/",
      "https://therealdeal.com/tag/housing-stability-and-tenant-protection-act/",
      "https://therealdeal.com/new-york/2024/12/02/why-south-bronx-savior-majora-carter-was-deemed-sellout/",
      "https://therealdeal.com/new-york/2024/05/02/how-nyc-investors-value-421a-extension-485x-tax-break/",
      "https://en.wikipedia.org/wiki/Fair_Labor_Standards_Act_of_1938",
      "https://therealdeal.com/new-york/2022/12/09/how-special-are-these-permits-no-one-got-any/",
      "https://portal.311.nyc.gov/article/?kanumber=KA-01675",
      "https://therealdeal.com/new-york/2013/03/18/builders-insurers-wage-war-on-nycs-scaffold-law/",
      "https://www.crainsnewyork.com/article/20130607/OPINION/130609905/editorial-new-york-s-stupidest-law",
      "https://therealdeal.com/new-york/2025/03/13/nys-senate-assembly-make-hochuls-bad-housing-plan-worse/",
      "https://x.com/WestHarlm/status/1901449931644149775",
      "https://x.com/WestHarlm/status/1901308870590369907",
      "https://therealdeal.com/new-york/2025/03/17/can-city-solve-housing-crisis-and-keep-vacancy-under-5-no/",
      "https://therealdeal.com/new-york/2025/03/12/nyc-housing-disparity-unfair-but-projects-arent-a-burden/",
      "https://therealdeal.com/new-york/2024/02/29/2019-rent-law-wrecked-rent-stabilized-buildings-report/"
    ],
    "market": "New York",
    "published": "Tue, 18 Mar 2025 16:30:00 +0000",
    "published_dt": "2025-03-18T16:30:00+00:00",
    "author": "Erik Engquist"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/18/kairoi-lands-62-million-refinancing-for-dallas-apartments/",
    "title": "Kairoi scores $62M refi for Oak Cliff apartments as pipeline slows",
    "subhead": "Boheme was delivered in 2023; rent growth on horizon with drop off in development",
    "authors": "ByJess Hardin",
    "pub_date": "Mar 18, 2025, 12:15 PM",
    "pub_date_dt": "2025-03-18T12:15:00",
    "content": "Kairoi Residential’s apartment development in Oak Cliff scored a refinancing deal in a sign that lenders could be warming up with rent growth on the horizon.\nThe 352-unit complex it delivered in 2023 landed $62 million in fresh financing, according to a release from Sunrise Realty Trust, the lender on the deal. That works out to $176,000 per unit.\nSunrise Realty Trust, an affiliate of TCG Real Estate, is providing $46.5 million of the loan; the rest was syndicated to an affiliate on the TCG Real Estate platform, the release said.\nThe Class A property, at 1207 North Zang Boulevard, is located across the street from Methodist Dallas Medical Center and was built on the site of El Fenix restaurant. It features a rooftop pool and a remote work lounge with private meeting rooms.\nSan Antonio-based developer Kairoi is known for its upscale apartments. In Dallas, it also built the 297-unit Amelia at Farmers Market, at 999 South Harwood Street, and the 146-unit Selene, at 2620 Maple Avenue, next to the Crescent. Its fourth project is under construction at 4939 North Central Expressway in Knox-Henderson.\n\nSince interest rates began trending downward, lending has been a little easier to come by.\nPlus, the bottom of this cycle for Dallas-Fort Worth’s multifamily market is in the rearview mirror. The Metroplex has survived a historic deluge of deliveries, which peaked last year, and the attendant pressure on rental rates and vacancy levels.\nNearly 39,000 units were delivered in DFW from the beginning of last year to mid-November, an increase from the year before, when 36,209 were completed, according to Partners Real Estate.\nAbout 22,000 units are expected to be delivered this year. The narrowing of the pipeline is expected to shrink vacancy levels and elevate rental rates.\nClass A properties have shown more resilience amid this period of growth, Partners said.",
    "related_links": [],
    "market": "Texas",
    "published": "Tue, 18 Mar 2025 16:15:08 +0000",
    "published_dt": "2025-03-18T16:15:08+00:00",
    "author": "Jess Hardin"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/18/integra-launches-sales-for-sereno-fort-lauderdale-condos/",
    "title": "Integra launches sales for Sereno Fort Lauderdale condos",
    "subhead": "Prices at 14-story, 76-unit project start at $1.4M",
    "authors": "ByKate Hinsche",
    "pub_date": "Mar 18, 2025, 10:30 AM",
    "pub_date_dt": "2025-03-18T10:30:00",
    "content": "Integra Investments is launching sales for Sereno Fort Lauderdale, a condo project with prices starting at $1.4 million.\nThe Miami-based developer is planning the 14-story, 76-unit condominium for 2901 Northeast 9th Court in Fort Lauderdale, according to a press release. It was\noriginally planned\nas an 11-story, 54-unit condominium with a 12-story, 100-key hotel.\nIntegra, led by principals Paulo Tavares de Melo, Victor Ballestas and Nelson Stabile, amended plans for the previous Ocean Park Residences project and renamed it Sereno Fort Lauderdale. The developer\nwon approval for the new concept\nin November.\n\nThe updated condo plan includes one-, two- and three-bedroom units that span 1,100 square feet to 2,400 square feet, the release shows. Amenities will include two rooftops, one with a pool and an outdoor kitchen, the other with a pickleball court, fitness center and spa facilities. Sereno will also have a lounge, children’s playroom and a pet spa, the release shows.\nThe design team includes FSMY Architects + Planners, interiors firm 1508 London and landscape architecture firm Design Studio Boca, according to the release. One Sotheby’s International Realty is leading sales and marketing for the project. Construction is expected to be completed in 2028, the release shows.\nFort Lauderdale\nhas emerged as a magnet for luxury condo developers.\nMore than 3,900 condos\nare in the development pipeline across Broward County, the majority of which are planned for Fort Lauderdale. Earlier this month, Regency Development Group launched sales for\nRegency Park\n, a 24-unit townhouse project planned in Fort Lauderdale, with prices starting at $2 million. In December, Naftali Group launched sales for\nViceroy Residences Fort Lauderdale\n, a planned 45-story, 370-unit branded condo tower with prices starting at $520,000.\n",
    "related_links": [
      "https://therealdeal.com/miami/2022/06/09/integra-scores-approval-for-ocean-park-hotel-and-condo-project-in-fort-lauderdale/",
      "https://therealdeal.com/miami/2024/11/22/integra-to-launch-sales-of-14-story-condo-in-fort-lauderdale/",
      "https://therealdeal.com/tag/fort-lauderdale/",
      "https://therealdeal.com/miami/2025/01/15/inside-broward-countys-condo-development-pipeline/",
      "https://therealdeal.com/miami/2025/03/04/regency-launches-luxe-townhouse-project-in-fort-lauderdale/",
      "https://therealdeal.com/miami/2024/12/03/naftali-launches-viceroy-branded-fort-lauderdale-condos/",
      "https://therealdeal.com/miami/2025/01/15/inside-broward-countys-condo-development-pipeline/"
    ],
    "market": "South Florida",
    "published": "Tue, 18 Mar 2025 14:30:00 +0000",
    "published_dt": "2025-03-18T14:30:00+00:00",
    "author": "Kate Hinsche"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/18/fhfa-director-overhauls-fannie-mae-freddie-mac-boards/",
    "title": "Trump-appointed FHFA director overhauls Fannie Mae, Freddie Mac boards",
    "subhead": "Bill Pulte will chair boards of both enterprises amid uncertain future",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 10:00 AM",
    "pub_date_dt": "2025-03-18T10:00:00",
    "content": "The futures of Fannie Mae and Freddie Mac remain up in the air, but a Trump appointee is already making major shakeups.\nThe Federal Housing Finance Agency, under its new director Bill Pulte, removed eight members from the Fannie Mae board and six members from the Freddie Mac board on Monday, the Wall Street Journal\nreported\n. Four new members were appointed to each board, including Pulte, who will chair both boards.\nThese moves come only three days after Pulte was sworn in as director of the FHFA. Donald Trump\ntapped the private equity businessman\nto serve as the nation’s top housing regular two months ago.\nThe mortgage giants have been under government control since the housing bubble burst in 2008. Chatter about taking them back private has persisted over the years but has yet to result in action.\nDuring Trump’s first administration, there was an effort to take the two enterprises private once more. That attempt was\ndropped in the waning days\nof his presidency, however, and Joe Biden’s incoming administration didn’t pursue it, instead shifting attention towards improving housing affordability and ownership.\n\nEarlier this year, the FHFA and the Treasury Department agreed to amend the senior preferred stock purchase agreements between the Treasury and the two enterprises, according to\nCNBC\n. This was viewed as a step towards the eventual release of Fannie Mae and Freddie Mac from government control.\nShould the enterprises go private, the ramifications could be myriad. Mortgage rates may jump, for example, depending on how the transition unfolds. Investors of mortgage-backed securities could also face bigger risks without the government backstop.\nFannie Mae and Freddie Mac support approximately 70 percent of the country’s mortgage market, according to the National Association of Realtors.\nPulte told\nCNN\nlast week that privatizing the two enterprises is not a top priority, though he added that they “shouldn’t be in conservatorship forever.” Instead, keeping in line with Trump’s overall mandate, Pulte said he is focusing on finding and eliminating fraud within the companies.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.wsj.com/finance/regulation/fhfa-director-to-head-fannie-mae-freddie-mac-boards-amid-shake-ups-0b8ef5a6",
      "https://therealdeal.com/national/2025/01/17/trump-taps-bill-pulte-to-lead-federal-housing-finance-agency/",
      "https://therealdeal.com/national/2021/01/15/treasury-quits-bid-to-privatize-fannie-mae-freddie-mac/",
      "https://www.cnbc.com/2025/02/12/heres-what-privatization-of-fannie-mae-freddie-mac-may-mean-for-your-mortgage.html",
      "https://www.cnn.com/2025/03/13/business/fannie-freddie-privatization-fhfa-director/index.html",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/national/2025/01/17/trump-taps-bill-pulte-to-lead-federal-housing-finance-agency/",
      "https://therealdeal.com/national/2021/01/15/treasury-quits-bid-to-privatize-fannie-mae-freddie-mac/",
      "https://therealdeal.com/national/2024/08/05/fannie-mae-freddie-mac-to-tighten-cre-loan-rules-even-more/"
    ],
    "market": "National",
    "published": "Tue, 18 Mar 2025 14:00:00 +0000",
    "published_dt": "2025-03-18T14:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/18/miami-dade-county-weekly-condo-report-54/",
    "title": "Estates at Acqualina closing tops Miami-Dade weekly condo sales",
    "subhead": "Top 10 sales ranged from $3.5M to $25M",
    "authors": "ByKate HinscheResearch byAdam Farence",
    "pub_date": "Mar 18, 2025, 9:45 AM",
    "pub_date_dt": "2025-03-18T09:45:00",
    "content": "Miami-Dade County’s condo sales and dollar volume rose last week.\nBrokers closed 135 condo sales totaling $177.2 million from Mar. 9 to Mar. 16. The previous week, brokers closed 117 condo sales totaling\n$120.8 million\n.\nLast week’s units sold for an average of $1,312,551, higher than the $1,032,863 average price from the previous week. The average price per square foot rose to $685 from $653, according to data from Redfin.\nFor the top 10 sales, prices ranged from $3.5 million to $25 million.\nUnit 4701/4702 at\nEstates at Acqualina\n, at 17975 Collins Avenue in Sunny Isles Beach, took the top spot with\na $25 million closing\n. The sale closed at $2,747 per square foot after 123 days on market. It marked the latest pricey deal in the complex’s north tower, following a $26 million penthouse sale in September that was linked to\nIranian-Canadian billionaire Michael Latifi\n.\nMichael Goldstein with Acqualina Realty had the listing, and Benjamin Moss and Liz Hogan with Compass represented the buyer.\nThe penthouse at Ocean House, at 125 Ocean Drive in Miami Beach, closed for the second highest amount,\n$24 million, or $6,098 per square foot\nafter 35 days on market. Private equity mogul Marc Leder, co-founder of Boca Raton-based Sun Capital Partners, sold the penthouse to Kayak CEO Steve Hafner. It marked  a South of Fifth price-per-square-foot record.\nSarah Williams with Societe Real Estate had the listing, and Michael Duchon and Eloy Carmenate with the Corcoran Group represented the buyer.\n\nHere’s a breakdown of the top 10 sales from Mar. 9 to Mar. 16:\nMost Expensive\nEstates at Acqualina, 17975 Collins Avenue, unit 4701/4702, in Sunny Isles Beach | Price: $25,000,000 | $2,747 psf | Listing agent: Michael Goldstein with Acqualina Realty | Buyer’s agents: Benjamin Moss and Liz Hogan with Compass\nLeast Expensive\nContinuum South Beach, 50 South Pointe Drive, unit 1207, in Miami Beach | Price: $3,500,000 | $2,426 psf | Listing agent: Lisa Yanowitz with Luxe Realty Group | Buyer’s agent: Sonia Toth with Brown Harris Stevens\nHighest Price Per Square Foot\nOcean House, 125 Ocean Drive, penthouse, in Miami Beach | Price: $24,000,000 | $6,098 psf | Listing agent: Sarah Williams with Societe Real Estate | Buyer’s agents: Michael Duchon and Eloy Carmenate with the Corcoran Group\nLowest Price Per Square Foot\nBellamare, 6000 Island Boulevard, unit 2604, in Aventura | Price: $4,775,000 | $1,131 psf | Listing agents: Richard Goihman and Ivonne Goihman with Douglas Elliman | Buyer’s agent: Richard Goihman with Douglas Elliman",
    "related_links": [
      "https://therealdeal.com/miami/2025/03/11/miami-dade-county-weekly-condo-report-53/",
      "https://therealdeal.com/tag/estates-at-acqualina/",
      "https://therealdeal.com/miami/2025/03/17/trust-buys-estates-at-acqualina-condo-for-25m/",
      "https://therealdeal.com/miami/2024/09/26/trust-tied-to-michael-latifi-buys-26m-estates-at-acqualina-ph/",
      "https://therealdeal.com/miami/2025/03/14/marc-leder-sells-miami-beach-ph-to-kayaks-steve-hafner/"
    ],
    "market": "South Florida",
    "published": "Tue, 18 Mar 2025 13:45:00 +0000",
    "published_dt": "2025-03-18T13:45:00+00:00",
    "author": "Kate Hinsche, Adam Farence"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/18/beltway-capital-seizes-west-loop-offices-with-r2-still-aboard/",
    "title": "R2’s loft office debt workout cuts Heitman out of the picture",
    "subhead": "Nonperforming loan purchaser Beltway Capital kept Matt Garrison’s firm on board",
    "authors": "ByEmma Whalen",
    "pub_date": "Mar 18, 2025, 7:15 AM",
    "pub_date_dt": "2025-03-18T07:15:00",
    "content": "Office properties hit hard by the pandemic often end up in the hands of their lenders or bargain-hunting buyers before they get a chance at a revival.\nYet for a West Loop office portfolio that plunged from 90 to 50 percent occupied, co-owner R2 has managed to remain in the drivers’ seat and go debt-free through a new partnership. Public records show its joint venture with Beltway Capital Management — finalized last month with a deed-in-lieu of foreclosure that took its former co-owner Heitman out of the picture — also adds a fifth building to the 350,000-square-foot portfolio.\nR2 bought six West Loop loft office buildings in 2016 for $86 million in a joint venture with Chicago-based Walton Street Capital. R2 later recapitalized a four-building portion of the portfolio in a joint venture with Chicago-based Heitman in 2019. The Heitman venture paid $65 million for the portfolio with a $42 million loan from Truist Financial. It’s unclear how much R2 paid to maintain its stake in the properties.\nThe joint venture struggled to hold onto the four assets, located at 641 West Lake Street, 901 West Jackson Boulevard and 130 South Jefferson Street, after the pandemic hit.\nMaryland-based Beltway, which specializes in buying distressed debt, bought the loan note from Truist last May, when the properties and their owners faced a murky path forward. The loan was labeled nonperforming at the time of its sale, meaning it likely traded for less than its face value.\nIt’s not uncommon for distressed debt buyers to file foreclosure actions shortly after acquiring a struggling loan.\nWhen Truist put the $42 million debt on the market, R2 and Heitman hadn’t technically defaulted on the loan, but it was in cash management, people familiar with the offering said. That means its excess cash flow was being used to cover debt service costs.\nIn this case, Beltway tapped R2 as its partner in managing the assets. R2 CEO Matt Garrison declined to share how much the firm invested into the portfolio to maintain its stake or what terms dictated Heitman’s departure from the joint venture.\nRepresentatives of Heitman did not respond to requests for comment.\nGarrison said R2 will be investing in “aggressive retention efforts for existing tenants,” and upgrades to common areas.\n\nIt was worth it for R2 to hang onto the assets because loft offices are often the type of buildings targeted for residential conversions, he said, meaning the number of competing properties could dwindle. Others aren’t in a position to fund the costs of competing for tenants.\n“Many of the (loft office) owners are undercapitalized or lack a rationale to invest capital in new leases, because their properties are worth less than the debt,” Garrison said. “This makes the effective inventory even smaller. We think there will always be demand for well executed loft buildings in the West Loop, and supply and demand looks better today for the right buildings than it has in a long time.”\nA few months before it bought the distressed note from Truist, Beltway also pounced on another struggling loan issued by Sun Life Assurance Company of Canada to the Feil Organization for a loft office building at 730 North Franklin Street. Beltway also partnered with R2 to take over that asset.\nNow the firms co-own all five properties outright. Debt-free buildings\nhave emerged as an appealing strategy\nfor office investors seeking flexibility in making significant building upgrades and attracting tenants with competitive lease terms.\n“Debt is just financial engineering. It isn’t required from this entry basis to generate great returns,” Garrison said. “One of the first questions tenant reps ask is about debt. Is the building in trouble, etc. Owning a property in all cash is the best answer to this question.”\nWhether the new approach will kickstart a turnaround for the full portfolio remains to be seen.\nThe office at 901 West Jackson is 90 percent occupied but the offices at 641 West  Lake and 130 South Jefferson are 50 percent occupied. Garrison said the firm is negotiating several leases across the properties.\n“In the office business, it is hard to stay flat,” he said. “You are either growing or you are declining. The Chicago office market is really two markets today, with almost half of the buildings effectively offline.”\n",
    "related_links": [
      "https://therealdeal.com/chicago/2024/03/04/debt-free-office-buildings-can-give-chicago-landlords-an-edge/",
      "https://therealdeal.com/chicago/2023/06/23/r2-buying-michigan-avenue-office-tower-for-70m-as-cbre-takes-loss/",
      "https://therealdeal.com/chicago/2024/02/16/feil-facing-beltways-foreclosure-on-river-north-office/",
      "https://therealdeal.com/chicago/2024/07/26/beltway-capital-seizes-chicago-office-building-from-feil/"
    ],
    "market": "Chicago",
    "published": "Tue, 18 Mar 2025 11:15:00 +0000",
    "published_dt": "2025-03-18T11:15:00+00:00",
    "author": "Emma Whalen"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/18/fannie-mae-gets-receiver-for-mendel-steiners-rentals/",
    "title": "Fannie Mae secures receiver for Mendel Steiner’s properties",
    "subhead": "Judge granted emergency motion over late investor’s rentals in Cleveland",
    "authors": "ByKeith Larsen",
    "pub_date": "Mar 18, 2025, 7:00 AM",
    "pub_date_dt": "2025-03-18T07:00:00",
    "content": "The receivers are coming for the late Mendel Steiner’s rental properties.\nA federal judge recently granted Fannie Mae’s request to appoint a receiver to take control of Steiner’s 308-unit portfolio around Cleveland.\nThe Borough Park investor had amassed thousands of multifamily units across the U.S. But in January, Steiner died by suicide at the age of 33, sending\nshockwaves\nthrough Brooklyn’s close-knit commercial real estate community.\nFannie Mae’s lawsuit, which sought to foreclose and appoint a receiver for Steiner’s properties in Cleveland, offers new details about the financial pressure Steiner faced prior to his death.\nFannie\nsued Steiner and his affiliated entities in 2024, alleging he defaulted on a $22.7 million loan originated by Greystone. Fannie alleges Steiner’s companies failed to pay taxes, falsified rent rolls and failed to provide information during an inspection. Steiner guaranteed the loan, making him personally liable, according to the lawsuit.\nThe lawsuit alleges Steiner neglected the properties, failing to service any of the fire extinguishers at the properties for two years. Gas was shut off for months and trash piled up at some of his properties, according to Fannie’s lawsuit.\nDuring two years of Steiner’s ownership, occupancy fell from 99 percent to 25 percent.\n\nBy September 2024, Fannie sought to appoint a receiver for the properties in Cleveland and Shaker Heights spanning 15 parcels and totaling 333,580 square feet.\nBut Steiner’s lawyers contested the receivership. They argued a receiver would add an extra layer of cost and Steiner was working hard to address the issues with the properties. Steiner’s father Lieb Steiner filed a declaration supporting the motion to oppose the receiver.\nOn February 10, Steiner’s counsel filed a “Notice of Suggestion of Death,” which stated that Steiner died a month prior. In late February, Fannie sought an immediate appointment of a receiver for the properties.\nThe judge ruled in favor of Fannie and appointed Michael Guggenheim as the receiver.\n“The evidence submitted by Fannie Mae reveals significant and ongoing damage to the properties due to mismanagement,” Judge Bridget Meehan Brennan said in the order.\nIn late February, a judge approved Bank of Montreal’s request to appoint a\nreceiver\nfor Steiner’s 800-unit rental properties in Baltimore. Steiner secured a $160 million refinancing from BMO for the properties in early 2024.\n",
    "related_links": [
      "https://therealdeal.com/new-york/tristate/2025/01/15/mark-nussbaum-shuts-down-law-firm/",
      "https://therealdeal.com/tag/fannie-mae/",
      "https://therealdeal.com/new-york/2025/02/04/bank-of-montreal-seeks-receiver-for-mendel-steiners-properties/",
      "https://therealdeal.com/new-york/2025/02/04/bank-of-montreal-seeks-receiver-for-mendel-steiners-properties/",
      "https://therealdeal.com/new-york/2025/01/10/mendel-steiner-dead-at-33/",
      "https://therealdeal.com/new-york/tristate/2025/01/15/mark-nussbaum-shuts-down-law-firm/"
    ],
    "market": "National",
    "published": "Tue, 18 Mar 2025 11:00:00 +0000",
    "published_dt": "2025-03-18T11:00:00+00:00",
    "author": "Keith Larsen"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/17/east-bay-architect-eyes-15-homes-next-to-war-memorial-in-lafayette/",
    "title": "East Bay architect wants to build 15 homes next to war memorial in Lafayette",
    "subhead": "Lara Dutto to preserve Lafayette Hillside Memorial from development",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 8:22 PM",
    "pub_date_dt": "2025-03-17T20:22:00",
    "content": "Architect-turned-builder Lara Dutto plans to build 15 homes next to a war memorial of thousands of white wooden crosses in Lafayette.\nDutto, principal of Orinda-based Laraarchitecture, bought the\nLafayette Hillside Memorial\nat 3600 Deer Hill Road two years ago to save the 3.1-acre parcel from development,\nthe San Francisco Chronicle reported\n.\nNow Dutto, a professor of architecture at Diablo Valley College, has pitched a plan to develop 15 homes on the northern two-thirds of the site.\nShe wants to split off the southern portion to preserve the memorial conceived in 2006 by contractor Jeff Heaton as a “place to recognize, honor, and commemorate individual national service contribution” of those dying in the Iraq and Afghanistan wars.\nNonprofit Lafayette Hillside Memorial would continue to maintain the crosses.\n“Its scale and rawness and simplicity somehow makes me stop, forces me to take a deep breath, and in that moment I am so grateful for my freedoms,” she told the Chronicle.\nDutto, who has worked since 2010 to support the memorial and once sat on its board, grew concerned when the family that owned it put it up for sale, fearful that whoever bought it would remove the crosses. So she bought it in 2023 for an undisclosed price.\nPlans now call for preserving the memorial and half the property as open space, while building a subdivision of 15 single-family homes around a “village green,” with an outdoor cooking and dining area, according to the Chronicle.\nFive of the homes would have accessory dwelling units, or granny flats. The development would climb up the slope along Oak Hill Road, below a ridgeline of preserved open space.\n\nDutto has employed a state density bonus and Senate Bill 330 for streamlined approvals. On Monday, the Lafayette Planning Commission was slated to hold an informational hearing.\nThe application came as housing advocates\nsued the East Bay city\nfor creating “misleading and unrealistic housing sites” to satisfy state-mandated housing goals.\nThe lawsuit by the Housing Action Coalition accused Lafayette of “pretending” to comply with the state housing element, a planning blueprint required of every city and county across the state every eight years.\nMayor Susan Candell took issue with the lawsuit, according to the Chronicle, saying the City Council has approved all housing projects that have come before it. She said the city will have no choice but to approve the Deer Hill Road project.\nLafayette, a wealthy city with $2 million homes, was once a battleground for the region’s housing wars, with two lawsuits, a ballot referendum and more than 100 public hearings that delayed a 315-unit apartment building for almost a dozen years.\nWithin a 10-year span, 115 homes were built in the city of 25,000 residents, including 10 in 2010, 76 in 2018 and 29 in 2019. The city must rezone to build 2,114 homes, 943 of them affordable, by 2031.\nLast year, the\nstate Supreme Court declined\nto hear an appeal from a neighborhood group, allowing the development to move forward. The project has not broken ground.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.lafayettehillsidememorial.org/",
      "https://www.sfchronicle.com/bayarea/article/housing-war-memorial-lafayette-20217913.php",
      "https://therealdeal.com/san-francisco/2025/03/11/housing-advocate-sues-lafayette-for-misleading-housing-plan/",
      "https://www.sfchronicle.com/realestate/article/lafayette-housing-project-court-17844162.php",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/03/11/housing-advocate-sues-lafayette-for-misleading-housing-plan/",
      "https://therealdeal.com/san-francisco/2025/03/14/developer-saj-eyes-office-to-resi-conversion-in-lafayette/",
      "https://therealdeal.com/san-francisco/2024/03/14/former-sf-giant-buster-posey-buys-lafayette-home-for-8-3m/"
    ],
    "market": "San Francisco",
    "published": "Tue, 18 Mar 2025 00:22:50 +0000",
    "published_dt": "2025-03-18T00:22:50+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/tampa/2025/03/17/developer-offers-260-million-for-tropicana-field/",
    "title": "$260M cash offer for Tropicana Field plays off Rays exit",
    "subhead": "Blake Investment Partners, unnamed firm offered $60M upfront to repair damage from Hurricane Milton ahead of MLB team’s 2028 lease expiration",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 7:12 PM",
    "pub_date_dt": "2025-03-17T19:12:00",
    "content": "A developer’s $260 million cash offer for the hurricane-beaten Tropicana Field is about $70 million less than what the city of St. Petersburg says it’s worth.\nBlake Investment Partners, a prominent local private equity firm, has teamed up with an unnamed “household” New York investment firm for the offer, setting the stage for a potential redevelopment of the Rays’ stadium, the Tampa Bay Business Journal\nreported\n.\nThe unsolicited offer comes after the Major League Baseball team exited a\nprevious $1.3 billion redevelopment deal\nwith Hines. The offer includes a $60 million upfront payment for urgent stadium repairs from damage caused by Hurricane Milton and a second installment following the expiration of the Rays’ lease in 2028.\nThe city previously valued the 86-acre site at $331 million ($3.8 million per acre), but Blake argued that hurricanes, rising interest rates and development constraints have lowered its market potential, estimating it could take a decade to maximize its value.\nBlake has also committed to having at least $500 million in vertical construction permitted and ready to start by the time the lease concludes.\n\nThe developer would parcel out the land and sell it to various developers, targeting high-end hotels, restaurants and architects to shape a “varied” mixed-use district, Blake said.\nThe offer is likely to trigger an open bid process, inviting competing proposals, with any final agreement requiring approval from the St. Petersburg City Council.\nBlake is also working with the city on preserving up to 15 acres for a park around Booker Creek and another 2 acres for an African American museum. He suggested Pinellas County could use tourist tax dollars to fund a future convention center.\nMeanwhile, the Rays are playing this season’s home games at Steinbrenner Field, the New York Yankees’ spring training stadium.\n— Judah Duke\n",
    "related_links": [
      "https://www.bizjournals.com/tampabay/news/2025/03/13/tropicana-field-land-purchase-proposal.html",
      "https://therealdeal.com/national/tampa/2024/06/14/tampa-bay-rays-1-3b-stadium-development-moves-forward/",
      "https://therealdeal.com/national/tampa/2025/03/06/400-central-developer-talks-next-projects-rays-future/",
      "https://therealdeal.com/national/tampa/2024/06/14/tampa-bay-rays-1-3b-stadium-development-moves-forward/",
      "https://therealdeal.com/national/tampa/2025/02/11/bank-ozk-loans-182-million-for-tampas-gasworx-development/"
    ],
    "market": "National",
    "published": "Mon, 17 Mar 2025 23:12:01 +0000",
    "published_dt": "2025-03-17T23:12:01+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/17/kb-home-pays-58m-for-office-to-resi-plan-in-san-ramon/",
    "title": "KB Home pays $58M to get into office-to-resi redevelopment in San Ramon",
    "subhead": "Developer plans to raze 276,000 sq building to make way for 190 townhomes, single-family homes in Bishop Ranch",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 6:32 PM",
    "pub_date_dt": "2025-03-17T18:32:00",
    "content": "KB Home has paid $57.8 million for a 276,000-square-foot building it wants to replace with 190 homes in San Ramon’s Bishop Ranch.\nAn affiliate of the Los Angeles-based developer paid cash for the three-story office building at 2527-2545 Camino Ramon,\nthe San Jose Mercury News reported\n.\nThe seller of the Bishop Ranch 7 building was locally based Sunset Development, the principal owner and developer of Bishop Ranch.\nThe deal works out to $209 per square foot.\nPlans by the developer include bulldozing the offices at Camino Ramon and Executive Parkway to clear the way for 190 homes.\nKB Home wants to develop\nBartlett\n, a walkable neighborhood on the north side of Bishop Ranch, according to the Mercury News.\nThe project would have 396,100 square feet of housing, including 118 townhomes and 72 single-family homes, according to a planning document. The detached homes would range from 1,800 to 2,400 square feet with three to four bedrooms and two and a half to three bathrooms, with two-car garages.\nRenderings by SDG Architects show gray and white townhouses surrounding green courtyards with jacaranda trees. The project would be built next to City Village, a\n404-unit project\nnow being built by SummerHill Homes, a local unit of Calabasas-based Marcus &amp; Millichap.\n\nCost and timeline for the KB Home development were not disclosed.\nSunset, owned by the Mehran family, wants to redevelop the\n585-acre office campus at Bishop Ranch into a retail village\nwith up to\n10,000 homes\n.\nThe developer’s CityWalk Master Plan, approved in 2020, would redevelop 135 acres with thousands of homes, a hotel, shops and restaurants in three distinct neighborhoods.\nThe master developer, led by Alex Mehran Jr., also plans to build another\n2,600 homes at the former Chevron headquarters\nat 6001 Bollinger Canyon Road, along with 125,000 square feet of open-air shops and restaurants and a 2.5-acre park. Sunset, which sold Chevron the land for its headquarters in 1981, bought it back in 2022 for $174.5 million.\nMehran told\nThe Real Deal\nthis month that Sunset had made random selections as to which offices would be torn down for homes.\n“I threw a dart at the wall,” he joked, explaining how he decided which of his family’s office properties should be razed to create 300,000 square feet of retail and entertainment options at Bishop Ranch’s CityCenter, which opened in 2018, and 8,000 planned homes.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.mercurynews.com/2025/03/11/san-ramon-home-build-property-east-bay-office-economy-real-estate-jobs/",
      "https://sanramonca.iqm2.com/Citizens/FileOpen.aspx?Type=1&ID=3748&Inline=True",
      "https://therealdeal.com/san-francisco/2022/01/13/summerhill-homes-spends-108m-on-31-office-park-acres-in-san-ramon/?firstLevel=sanfrancisco&secondLevel=2022&thirdLevel=01&fourthLevel=13&fifthLevel=summerhill-homes-spends-108m-on-31-office-park-acres-in-san-ramon",
      "https://therealdeal.com/san-francisco/2024/01/25/former-chevron-hq-to-become-housing-and-retail-in-east-bay/",
      "https://www.bishopranch.com/press/bishop-ranchs-first-batch-of-homeowners-move-in/",
      "https://therealdeal.com/sanfrancisco/2024/01/25/former-chevron-hq-to-become-housing-and-retail-in-east-bay/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/03/10/bishop-ranchs-transformation-with-sunset-development-ceo/",
      "https://therealdeal.com/san-francisco/2025/02/10/eden-housing-sunset-plan-200-affordable-units-in-san-ramon/",
      "https://therealdeal.com/san-francisco/2022/01/13/summerhill-homes-spends-108m-on-31-office-park-acres-in-san-ramon/"
    ],
    "market": "San Francisco",
    "published": "Mon, 17 Mar 2025 22:32:51 +0000",
    "published_dt": "2025-03-17T22:32:51+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/17/mesirow-lists-apartment-complex-in-hot-suburban-chicago/",
    "title": "Tax stability, retail galore grease Mesirow’s multifamily listing",
    "subhead": "294-unit apartment complex hits market in Vernon Hills",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 6:24 PM",
    "pub_date_dt": "2025-03-17T18:24:00",
    "content": "Mesirow is betting on strong rental demand, tax certainty and proximity to redeveloping retail with the listing of a Vernon Hills apartment complex.\nThe Chicago financial services firm is selling its 294-unit apartment complex at 1155 Museum Boulevard in Vernon Hills, Crain’s\nreported\n. The asking price wasn’t disclosed. Mesirow purchased the complex in 2018 for $87.1 million, or $296,000 per unit, according to CoStar Group.\nThe seven-story complex, the Mil’Ton, is 94 percent occupied, with an average unit size of 1,117 square feet and average rents of $2,546 per month, or $2.28 per square foot. The rents range from about $2,500 to $3,800, according to listing sites.\nMesirow tapped CBRE brokers John Jaeger, Justin Puppi and Jason Zyck to market the property.\nThe apartments benefit from proximity to the Hawthorn Mall, which is undergoing a\n$252 million redevelopment\n, along with Mellody Farm, a 270,000-square-foot retail and residential center completed in 2019.\n\nRegency Centers’ Mellody Farm development has been so successful that Vernon Hills officials are\nlooking at early retirement for the tax increment financing district\ncreated for the area.\nSuburban rental demand is strong,\noutpacing the city core\neven as elevated interest rates have made commercial deals more challenging. Suburban Chicago rents rose 4.4 percent year over year in the fourth quarter to $2.09 per square foot, according to Integra Realty Resources.\nAnother potential draw for buyers is the complex’s “Non-Cook County tax certainty.” Mesirow secured an agreement with the local assessor that stabilizes the property’s assessed value at $77.3 million, with tax increases capped at 3 percent annually for the next three years.\n— Judah Duke\n",
    "related_links": [
      "https://www.chicagobusiness.com/commercial-real-estate/vernon-hills-apartment-complex-sale",
      "https://therealdeal.com/chicago/2022/09/14/vernon-hills-approves-second-phase-of-hawthorn-mall-plan/",
      "https://therealdeal.com/chicago/2024/04/04/tif-revenue-for-regency-centers-vernon-hills-project-skyrockets/",
      "https://therealdeal.com/chicago/2024/11/11/why-suburban-chicago-multifamily-sales-outperform-city/",
      "https://therealdeal.com/chicago/2024/01/21/mesirow-downsizes-chicago-hq-in-lease-extension/",
      "https://therealdeal.com/chicago/2024/11/11/why-suburban-chicago-multifamily-sales-outperform-city/",
      "https://therealdeal.com/chicago/2025/03/11/downtown-chicago-apartment-rents-reach-new-peak/"
    ],
    "market": "Chicago",
    "published": "Mon, 17 Mar 2025 22:24:18 +0000",
    "published_dt": "2025-03-17T22:24:18+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/17/gehry-designed-office-building-proceeds-in-playa-vista/",
    "title": "Gehry-designed office building proceeds in Playa Vista",
    "subhead": "NSB’s plan for 196K sf project suffered 2020 legal setback",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 5:39 PM",
    "pub_date_dt": "2025-03-17T17:39:00",
    "content": "NSB Associates is back on track for an approved 196,000-square-foot office building designed by Frank Gehry in Playa Vista, which stalled four years ago because of a lawsuit.\nThe Beverly Hills-based developer was reapproved by the Los Angeles City Planning Commission to build the eight-story building at 12575 West Beatrice Street,\nUrbanize Los Angeles reported\n.\nThe offices, approved in 2017, were forced by a court to undergo further environmental review. This month, the Planning Commission approved the revised environmental impact report for the project known as New Beatrice West.\nPlans include 3,400 square feet of shops and restaurants. An existing office building, home to Gehry Partners, would be retained.\nThe U-shaped, 135-foot-tall project, designed by Gehry, will have upper level setbacks to create terrace decks.\nConstruction is expected to take 18 months. A project cost and when NSB is expected to break ground were not disclosed.\n\nKarney Management, a property owner nearby, had repeatedly appealed the office building to attempt to force the project to undergo further environmental review, without success.\nThe company led by Aliza Karney Guren\nsued the City of Los Angeles\nto block the project. In January 2020, a Los Angeles judge ruled that the mitigated negative declaration conducted for the project had not sufficiently considered impacts to aesthetics, noise and traffic congestion.\nAs a result, the Planning Department was forced to redo the environmental review process, although project entitlements were not overturned by the decision, according to Urbanize.\nNew Beatrice West is the second collaboration between Larry Field, founder of NSB Associates, and his longtime friend Frank Gehry. In 2023, NSB completed its two-building,\n80,000-square-foot offices\n, designed by Gehry,\nin El Segundo\n.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://la.urbanize.city/post/city-planning-commission-signs-eir-gehry-designed-offices-12575-beatrice-street-playa-vista",
      "https://casetext.com/case/karney-mgmt-v-city-of-los-angeles",
      "https://therealdeal.com/la/2017/03/20/jll-to-lease-nsbs-gehry-designed-creative-office-in-el-segundo/",
      "https://urbanize.city/la/post/gehry-designed-office-building-completed-el-segundo",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2017/03/20/jll-to-lease-nsbs-gehry-designed-creative-office-in-el-segundo/",
      "https://therealdeal.com/la/2016/04/13/playa-vista-is-getting-a-new-campus/",
      "https://therealdeal.com/la/2023/01/18/frank-gehry-project-with-approvals-for-sale-in-hollywood/"
    ],
    "market": "Los Angeles",
    "published": "Mon, 17 Mar 2025 21:39:33 +0000",
    "published_dt": "2025-03-17T21:39:33+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/17/accesso-faces-dilution-in-69-million-chicagoland-debt-trouble/",
    "title": "Hamilton seeks reprieve for big office debt as Accesso bleeds equity",
    "subhead": "Minority owner of Esplanade building in Downers Grove is putting up capital to hang onto property as $69M debt transfers to special servicer",
    "authors": "BySam Lounsberry",
    "pub_date": "Mar 17, 2025, 5:30 PM",
    "pub_date_dt": "2025-03-17T17:30:00",
    "content": "Hamilton Partners is maneuvering to save a struggling suburban Chicago office deal without getting much help from its distressed ownership companion, Accesso Partners, which faces foreclosures at a handful of properties in the area.\nItasca-based Hamilton is a minority owner of the Esplanade I, a 609,000-square-foot office complex at 2001 Butterfield Road in Downers Grove, a property that had its $69 million loan transferred last month to special servicer CW Capital, a sign of financial trouble for the landlord.\nAccesso, based in the Miami suburb of Hallandale Beach, has the larger ownership stake in the 19-story property of the two firms, but it’s either unable or unwilling to commit the capital necessary to work out the debt trouble alongside Hamilton, said Hamilton partner Ron Lunt.\nAs a result, Hamilton is seeking to delay the maturity of the property’s loan, which comes due in July of next year, and is starting debt workout talks with CW Capital around how to fund the costs of turning the property around, such as tenant allowances for workspace buildouts and leasing broker commissions, Lunt said.\n“We have some lease talks going, but if we’re going to spend a ton of money, we would like to work out an extension of some sort,” Lunt said. “Offices are low priority for lenders today, which is why you need to start the discussion early.”\nCW Capital declared the loan is headed toward “imminent monetary default,” although Lunt said the loan terms were only breached on a technicality because its previous loan servicer, Iowa-based Principal, was allowing rents to be collected and debt costs to be paid later in the month than the special servicer.\nCW is reviewing Hamilton’s request for a modification to the deal terms, and it’s unclear when it will come to a resolution. Accesso, meanwhile, will have its equity in the property diluted further with each dollar Hamilton kicks into the deal as it attempts to rescue the loan from the brink of distress, Lunt said.\nAccesso didn’t return requests for comment. It surrendered its office tower at 20 North Clark Street in the Chicago Loop to its lender earlier this year, and it is also facing a\n$75 million foreclosure at 200 West Monroe Street\n, which is next door to a property the firm previously sold at a major loss from its previous purchase price. Accesso made other\nsuburban office investments that recently ended up in foreclosure\n, too. The firm bought several of those properties from Hamilton, and entered the Esplanade deal in a 2015 joint venture.\nAccesso also lost a\nHouston office portfolio\nto financial distress last year.\n\nThe suburban Chicago property was appraised at $105 million ($172 per square foot) in 2016, when the joint venture’s commercial mortgage-backed securities loan was originated. That’s far more than what it’s likely worth today as interest rates and subdued demand from tenants have eaten into property values. The loan’s $57.3 million balance pencils out to $94 per square foot.\nThe property’s financial trouble was triggered in part by the 2023 exit of Hillshire Brands, an affiliate of Tyson Foods, that previously leased a 72,000-square-foot annex building that serves as a research and development facility on the Downers Grove campus.\nThat space hasn’t been refilled, and the asset is only 72 percent leased, about average for suburban Chicago office buildings amid one of the worst downturns of all time for the sector. The lackluster occupancy has sunk the property’s revenue to well below the level required to meet debt service obligations, public loan data shows.\nThe property’s debt-service coverage ratio was just 0.43 for 2024 through the end of September, loan data compiled by Morningstar Credit shows — anything less than 1.0 is below breakeven, meaning the Esplanade property was bringing in less than half the rent needed to cover its costs.\nStill, Hamilton is working with a brokerage team focused on food processing companies to help lease the space Hillshire vacated, with the hope it can get the deal back on track in time to dodge penalties with its lender.\nYet it’ll be vying for tenants with other office properties in the suburbs that have already been through foreclosure or deeply discounted sales in\nnearby suburban markets\n, allowing their buyers to offer lower rents in some cases, Lunt noted.\n“Major projects in\nSchaumburg\nhave gone through ownership changes and the bases are all reset, and it makes it tougher competition,” Lunt said.\n",
    "related_links": [
      "https://therealdeal.com/chicago/2024/11/27/deutsche-files-75m-loop-foreclosure-against-accesso/",
      "https://therealdeal.com/chicago/2023/06/20/accesso-juggling-loan-deadlines-in-rough-suburban-office-market/",
      "https://therealdeal.com/texas/houston/2024/12/13/accesso-partners-loses-devalued-houston-office-portfolio/",
      "https://therealdeal.com/chicago/2024/03/29/alfred-teo-buys-distressed-schaumburg-towers-near-chicago/",
      "https://therealdeal.com/chicago/2023/08/29/lender-slams-gluck-with-83m-schaumburg-office-foreclosure-suit/",
      "https://therealdeal.com/chicago/2025/01/10/accesso-partners-surrenders-chicago-office-tower-to-lender/",
      "https://therealdeal.com/chicago/2024/07/03/downers-grove-office-building-saddled-with-45m-delinquency/",
      "https://therealdeal.com/texas/houston/2024/12/13/accesso-partners-loses-devalued-houston-office-portfolio/"
    ],
    "market": "Chicago",
    "published": "Mon, 17 Mar 2025 21:30:00 +0000",
    "published_dt": "2025-03-17T21:30:00+00:00",
    "author": "Sam Lounsberry"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/17/former-kb-home-ceo-bruce-karatz-sells-flats-home-for-27m/",
    "title": "Former KB Home CEO lands $27M for Beverly Hills Flats manse",
    "subhead": "Deal marks yet another trade for city’s Flats neighborhood",
    "authors": "ByKari HamanakaResearch byAbigail Nehring",
    "pub_date": "Mar 17, 2025, 5:25 PM",
    "pub_date_dt": "2025-03-17T17:25:00",
    "content": "Former KB Home CEO Bruce Karatz inked a deal to sell his Beverly Hills mansion for $27 million as activity continues in the Flats.\nKaratz and his wife, socialite and philanthropist Lilly Tartikoff, sold 620 North Beverly Drive for about 17 percent less than the $32.5 million ask the home had when it went on the market in mid-October.\nA limited liability company registered with a Westlake Village address is the buyer, according to property and state records.\nThe nine-bedroom, eight-bathroom home totals 10,554 square feet. Built in the 1920s, the traditional-style home sits on nearly an acre.\nIt has a screening room, library, pool house, tennis court, two-bedroom guest house and was renovated by acclaimed architect Paul Williams.\nCarolwood Estates’\nDrew Fenton\nlisted the property, while The Beverly Hills Estates’\nJack Harris and Michael Fahimian\nrepresented the buyer.\n\nThe Beverly Drive estate is the latest move in a steady flow of activity in Beverly Hills’ Flats neighborhood.\nLast month, the home at\n622 North Elm Drive\nsold for $19.9 million. It was a quick trade with the home on the market for less than a month and purchased by a trust tied to accountant Marc Sniderman and Michael Karlin, a business manager for celebrities and other high-profile clients.\nIn January TV executive\nDavid Salzman\nsold his former home at 702 North Sierra Drive for $17 million.\nInventory in the Flats has also seen a boost.\nCompass’ Josh Flagg listed the\nGloria Vanderbilt estate\nat 719 North Maple Drive for $16.5 million in late January. About two weeks later the home went into contract.\nFormer supermodel\nChristina Estrada\nlisted her home at 722 North Maple Drive earlier this month, with an asking price currently at $24 million — $2 million less than the original ask.\nHasbro CEO\nBrian Goldner and his wife Barbara Goldner lopped some off the asking price at 610 North Canon Drive. The couple placed the home on the market for $27 million in December and last month reduced it to $23.5 million.\n",
    "related_links": [
      "https://therealdeal.com/magazine/august-2024/how-las-boutique-brokerages-juggle-closing-deals-with-managing-the-business/",
      "https://therealdeal.com/la/2024/10/21/meet-las-youngest-team-of-luxury-home-mega-brokers/",
      "https://therealdeal.com/la/2025/02/14/beverly-hills-flats-manse-on-elm-drive-sells-for-20m/",
      "https://therealdeal.com/la/2025/01/30/fresh-prince-producers-beverly-hills-home-sells-for-17m/",
      "https://therealdeal.com/la/2025/01/30/gloria-vanderbilt-estate-asks-16m-in-beverly-hills/",
      "https://therealdeal.com/la/2025/03/03/model-christina-estrada-lists-beverly-hills-villa-for-26m/",
      "https://therealdeal.com/la/2025/01/06/beverly-hills-manse-owned-by-late-hasbro-ceo-lists-for-27m/",
      "https://therealdeal.com/la/2025/03/03/model-christina-estrada-lists-beverly-hills-villa-for-26m/",
      "https://therealdeal.com/la/2025/02/14/beverly-hills-flats-manse-on-elm-drive-sells-for-20m/",
      "https://therealdeal.com/la/2025/01/30/gloria-vanderbilt-estate-asks-16m-in-beverly-hills/"
    ],
    "market": "Los Angeles",
    "published": "Mon, 17 Mar 2025 21:25:20 +0000",
    "published_dt": "2025-03-17T21:25:20+00:00",
    "author": "Kari Hamanaka, Abigail Nehring"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/17/jim-halperin-pitches-tower-to-replace-dallas-strip-mall/",
    "title": "Jim Halperin pitches resi tower to replace Oak Lawn strip mall",
    "subhead": "Local stakeholders support rezoning for development plan, which includes retail",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 5:11 PM",
    "pub_date_dt": "2025-03-17T17:11:00",
    "content": "A Dallas developer’s plans to transform an Oak Lawn strip mall into a mixed-use development received a warm welcome from local stakeholders.\nJim Halperin, co-founder of Irving-based Heritage Auctions, envisions a 24-story residential tower and upscale restaurants at 2615 Oak Lawn Avenue, which the Oak Lawn Committee gave unanimous support, the Dallas Business Journal\nreported\n.\nThe proposal aims to reshape a corner that could be a key gateway into the neighborhood. The 1.93-acre property has been owned by the Halperin family for the past 19 years.\nThe development would feature 310 residential units covering about 40 percent of the site, while the remainder will focus on open space, pedestrian-friendly amenities and two or three restaurants, some spanning multiple levels with roof terraces. GFF Design is attached to the project.\nTenants of the strip mall include Open Sesame Lebanese Grill, whose owners have been in discussions with Halperin about remaining in the neighborhood, though whether it stays on-site or relocates is still undecided.\n\nThe project’s design takes a cue from the Old Parkland campus redevelopment by Crow Holdings at 3819 Maple Avenue, which GFF CEO Evan Beattie called “transformational” for the neighborhood.\nThe redevelopment requires rezoning, which could take up to two years to finalize.\nThe project is set to add to the wave of redevelopment reshaping Oak Lawn, a neighborhood known for its nightlife and identity as the heart of Dallas’ LGBTQ+ community.\nSeveral office and residential developments are underway nearby, like McCourt Partners and HN Capital Partners’ 40-acre mixed-use development at\n1650 Oak Lawn Avenue\nas well as\nThe Oak Lawn Design Plaza\n, covering nine acres at 1444 Oak Lawn Avenue from Charlotte, North Carolina–based investor Asana Partners.\n— Judah Duke\n",
    "related_links": [
      "https://www.bizjournals.com/dallas/news/2025/03/12/oak-lawn-avenue-strip-mall-redevelopment-plans.html",
      "https://therealdeal.com/texas/dallas/2024/12/12/mccourt-hn-capitals-mixed-use-vision-for-design-district/",
      "https://therealdeal.com/texas/dallas/2024/07/18/asana-partners-spending-27m-on-dallas-retail-redevelopment/",
      "https://therealdeal.com/texas/dallas/2025/02/13/henry-s-miller-clears-hurdle-for-controversial-mixed-use-plans/",
      "https://therealdeal.com/texas/dallas/2024/12/12/mccourt-hn-capitals-mixed-use-vision-for-design-district/",
      "https://therealdeal.com/texas/dallas/2024/07/18/asana-partners-spending-27m-on-dallas-retail-redevelopment/"
    ],
    "market": "Texas",
    "published": "Mon, 17 Mar 2025 21:11:33 +0000",
    "published_dt": "2025-03-17T21:11:33+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/17/trust-buys-estates-at-acqualina-condo-for-25m/",
    "title": "Trust buys Estates at Acqualina condo for $25M, adding to slew of pricey deals",
    "subhead": "Unit spans 9,100 sf with six bedrooms, hit market for nearly $28M in November",
    "authors": "ByKate Hinsche",
    "pub_date": "Mar 17, 2025, 5:00 PM",
    "pub_date_dt": "2025-03-17T17:00:00",
    "content": "A trust bought a 9,100-square-foot Estates at Acqualina condo for $25 million, marking the latest pricey closing in the oceanfront luxury complex.\nRecords show Casa Numa Land Trust bought unit 4701/4702 in the north tower at 17975 Collins Avenue from an affiliate of Jules and Eddie Trump’s development firm, Trump Group. The Trumps have no relation to President Donald Trump.\nMichael Goldstein with Acqualina Realty had the listing, and Liz Hogan and Ben Moss with Compass brought the buyer.\nThe condo has six bedrooms and seven bathrooms and sold fully furnished, according to the listing.\n\nEstates at Acqualina\nis an oceanfront luxury condo complex that includes a 52-story, 94-unit north tower and a 49-story, 154-unit south tower. The towers have lobbies designed by the late Karl Lagerfeld, 45,000 square feet of amenities that include a bowling alley, ice skating rink and a movie theater, and the restaurant Avra Miami Estiatorio.\nThe Trump brothers started construction on the $1.8 billion project in 2018. Years of construction delays culminated in litigation between the Trumps and their general contractor, Suffolk Construction, that resulted in\nthe developer firing Suffolk\nfrom the project in 2023.\nClosings began in 2022, with some notable buyers like\nLeBron James\n,\nKimber gunmaker Leslie Edelman\nand\nEuropean Wax Center co-founder Joshua Coba\ndropping millions on Estates at Acqualina condos.\nMore recently, a trio of pricey deals closed in September. A trust linked to Iranian-Canadian billionaire Michael Latifi bought\na penthouse for $26 million\n. The heads of Mexico’s largest real estate investment trust, Fibra Uno, bought a unit for\n$20 million\n. A different trust bought a condo for\n$16.9 million\n.",
    "related_links": [
      "https://therealdeal.com/tag/estates-at-acqualina/",
      "https://therealdeal.com/miami/2023/07/07/estates-at-acqualina-developer-fires-general-contractor/",
      "https://therealdeal.com/miami/2022/10/19/lebron-james-buys-oceanfront-sunny-isles-condo/",
      "https://therealdeal.com/miami/2022/12/08/kimber-gunmaker-buys-estates-at-acqualina-condo-for-21m/",
      "https://therealdeal.com/miami/2024/05/16/european-wax-center-co-founder-buys-sunny-isles-beach-condo/",
      "https://therealdeal.com/miami/2024/09/26/trust-tied-to-michael-latifi-buys-26m-estates-at-acqualina-ph/",
      "https://therealdeal.com/miami/2024/09/10/mexican-reit-bosses-buy-20m-estates-at-acqualina-condo/",
      "https://therealdeal.com/miami/2024/09/30/trust-buys-estates-at-acqualina-condo-for-17m/"
    ],
    "market": "South Florida",
    "published": "Mon, 17 Mar 2025 21:00:00 +0000",
    "published_dt": "2025-03-17T21:00:00+00:00",
    "author": "Kate Hinsche"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/17/drw-holdings-founder-sells-lakefront-mansion-for-7-million/",
    "title": "DRW Holdings founder banks profit in $7M sale of lakefront mansion",
    "subhead": "Beachfront home in Michigan’s Harbor Country scored while sellers often take price cuts in Chicago’s luxury market",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 4:00 PM",
    "pub_date_dt": "2025-03-17T16:00:00",
    "content": "Real estate heavyweight Don Wilson Jr. turned a tidy profit on a lakefront property he bought five years ago.\nThe founder and CEO of DRW Holdings sold his mansion at 16096 Lake Avenue in Union Pier, Michigan, for $7 million in one of the region’s biggest deals of last year, the Chicago Tribune\nreported\n.\nThe 10,750-square-foot home sold for $651 per square foot; Wilson bought it for $4.05 million ($377 per square foot) in 2020.\nHarbor Country has become a sought-after vacation and second-home destination for Chicagoans.\nAt least one off-market deal in nearby New Buffalo topped $8.5 million last year, but Wilson’s sale is believed to be one of the highest publicly listed sales in the area recently.\nThe region has long been a favored retreat for Chicagoans due to its proximity — just over an hour’s drive from the city. But\ndemand for vacation homes in the area\nhas surged in recent years, with limited inventory and rising prices proving its value as a second-home market.\nThe median listing home price in Union Pier, for example, jumped 50.6 percent year over year in February to $1.3 million,\naccording to Realtor.com\n.\n\nThe 28,000-square-foot property has 99 feet of Lake Michigan frontage. Built in 2007, the home has eight bedrooms, six full bathrooms, a wine cellar, a 12-seat theater, a gym and a lake-facing deck with a pool.\nElizabeth Roch and Toni Philander Morris of @properties Christie’s International Real Estate had the listing. The buyer was represented by @properties Christie’s agent Janice Smith.\nWilson listed the home for $9.2 million in 2023 before cutting the asking price to $8.5 million later that year. The buyer’s identity is hidden by a Delaware LLC that owns homes in Chicago suburb Oak Park and Palm Beach, Florida.\nWilson owns a Lincoln Park mansion and is\nstill marketing\nhis Wicker Park residence at 1407 North Hoyne Avenue for $6 million after extensive renovations that combined the historic property with an adjacent coach house. He listed the Wicker Park mansion for almost $7 million in 2023.\nWilson manages broad real estate interests, including projects led by Convexity Properties, DRW’s real estate arm. Convexity is known for redeveloping Chicago landmarks like the\nRobey Hotel\nand the Three Arts Club.\n— Judah Duke\n",
    "related_links": [
      "https://www.chicagotribune.com/2025/03/14/drw-holdings-michigan/",
      "https://therealdeal.com/chicago/2024/08/16/luxury-agents-explain-second-home-market-in-chicagoland/",
      "https://www.realtor.com/realestateandhomes-search/Union-Pier_MI/overview",
      "https://therealdeal.com/chicago/2023/07/17/historic-wicker-park-mansion-listed-for-7m/",
      "https://therealdeal.com/chicago/2018/09/12/new-union-station-plan-ditches-apartments-adds-retail-and-park/",
      "https://therealdeal.com/chicago/2023/07/17/historic-wicker-park-mansion-listed-for-7m/",
      "https://therealdeal.com/chicago/2024/08/16/luxury-agents-explain-second-home-market-in-chicagoland/",
      "https://therealdeal.com/chicago/2024/05/02/goodman-scores-17m-to-replace-don-wilson-development-site-debt/"
    ],
    "market": "Chicago",
    "published": "Mon, 17 Mar 2025 20:00:00 +0000",
    "published_dt": "2025-03-17T20:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/17/figure-ai-leases-99k-sf-for-new-san-jose-headquarters-plant/",
    "title": "Figure AI leases 99K sf for new headquarters plant in San Jose",
    "subhead": "Humanoid robotics firm nearly quadruples base in move from Sunnyvale",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 4:00 PM",
    "pub_date_dt": "2025-03-17T16:00:00",
    "content": "Figure AI has moved its headquarters to San Jose from Sunnyvale, nearly quadrupling the size of its office and manufacturing hub.\nThe artificial intelligence robotics firm now occupies a 98,700-square-foot industrial flex building at the Assembly at North First tech campus at 3960 North First Street,\nthe SiliconValley.com reported\n.\nTerms of the lease with landlord EQT Exeter, based outside of Philadelphia, were not disclosed.\nFigure AI’s former Sunnyvale office totaled 27,900 square feet, according to LoopNet.\nIts new “robot campus” in San Jose will support “manufacturing, fleet operations and overall engineering/design build-out,” Brett Adcock, founder and CEO Figure AI, said on his LinkedIn page.\nThe headquarters sits next to the\nhub for Logitech\nwithin the six-building Assembly at North First complex once occupied by Lam Research, a semiconductor firm.\n\nIn 2021, EQT Exeter bought the 27-acre, 489,100-square-foot  campus for\n$192 million\n, or $393 per square foot, according to\nThe Real Deal\n. The campus, built in 1984, was renovated in 2018, according to Loopnet.\nFigure AI is working to “bring humanoid robots into commercial operations,” according to Adcock.\nIn February last year,\nFigure AI landed $675 million through a capital raise\nfrom Microsoft, OpenAI Startup Fund, Nvidia, Amazon founder Jeff Bezos, Parkway Venture Capital, Intel Capital and others.\nEQT Exeter, founded in 2006 as Exeter Property Group, has more than $30 billion in assets under management, including more than 2,000 properties and 375 million square feet of warehouses, office and life sciences buildings and homes, according to its website.\nIn early 2021, Swedish private equity manager EQT AB acquired Exeter Property Group and renamed it EQT Exeter, which serves as its real estate arm.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.siliconvalley.com/2025/03/11/san-jose-ai-artificial-intelligence-robot-jobs-work-tech-build-property/",
      "https://www.mercurynews.com/2025/03/07/san-jose-logitech-bay-area-tech-jobs-economy-silicon-valley-computer/",
      "https://therealdeal.com/san-francisco/2021/10/01/eqt-exeter-buys-north-san-jose-office-and-research-campus-for-192m/",
      "https://www.prnewswire.com/news-releases/figure-raises-675m-at-2-6b-valuation-and-signs-collaboration-agreement-with-openai-302074897.html",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2021/10/01/eqt-exeter-buys-north-san-jose-office-and-research-campus-for-192m/",
      "https://therealdeal.com/san-francisco/2025/03/07/super-micro-to-forge-ahead-with-north-san-jose-tech-campus/",
      "https://therealdeal.com/national/phoenix/2025/03/12/kenco-takes-up-642k-sf-warehouse-outside-phoenix/"
    ],
    "market": "San Francisco",
    "published": "Mon, 17 Mar 2025 20:00:00 +0000",
    "published_dt": "2025-03-17T20:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/2025/03/17/dallas-mushroom-house-at-risk-under-car-dealers-ownership/",
    "title": "Highland Park “Mushroom House” at risk under Clay Cooley ownership",
    "subhead": "Car dealer and wife bought iconic property, two adjacent historic homes",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 3:20 PM",
    "pub_date_dt": "2025-03-17T15:20:00",
    "content": "The future of Dallas’ iconic “Mushroom House” is uncertain after car dealer Clay Cooley acquired the home along with two adjacent Highland Park properties, sparking speculation about potential teardowns.\nThe house at 4200 Armstrong Parkway, known for its curved design and green-blue copper roof, is one of three multimillion-dollar mansions Cooley and his wife, Lisa, own at Armstrong Parkway and Bordeaux Avenue, The Dallas Morning News\nreported\n. The other two are at 4208 Armstrong Parkway and 4209 Bordeaux Avenue.\nThe couple’s plans for their 2.5 acres of prime properties are a mystery. They haven’t commented, but it’s led to questions about whether the unique home, and the historic residences next to it, will survive or be cleared to make way for new construction.\nThe Cooleys haven’t filed any demolition or major renovation permits, though plumbing and mechanical permits were submitted for two of the properties. Preservationists are hopeful that at least the 1920s Tudor-style home on Bordeaux, designed by famed architect Hal Thomson, will be spared.\nThe group Preservation Park Cities recently toured two of the homes but wasn’t allowed inside 4208 Armstrong Parkway due to structural concerns.\nClay Cooley attended a Preservation Park Cities meeting in February, where he expressed a desire to avoid community conflict. Preservationists suggested a design that would retain the Bordeaux home as a guesthouse while allowing for a new build on the Armstrong lots.\n\nThe couple bought the home at 4208 Armstrong Parkway first, in 2020, county records show. They then purchased 4209 Bordeaux Avenue and the Mushroom House in a five-month period, transferring them into their name by December 2024.\nThe Mushroom House, completed in 1997 by Dallas architect Tom Workman, has long divided opinion for its whimsical, storybook-like design. Its price history is unavailable, but its market value is estimated at over $7.5 million, according to Zillow.\nPreservationists admit that while the house is architecturally significant, it may be less defensible due to its modern construction and location on a highly visible lot.\nLocal ordinances also complicate the equation. Highland Park rules prohibit combining all three parcels into a single lot, which could influence Cooley’s final decision.\n— Judah Duke\n",
    "related_links": [
      "https://www.dallasnews.com/business/real-estate/2025/03/13/dallas-car-man-snaps-up-three-highland-park-mansions-but-his-plans-remain-unclear/",
      "https://therealdeal.com/",
      "https://therealdeal.com/texas/dallas/2025/02/21/home-in-dallas-preston-hollow-listed-for-13-7-million/",
      "https://therealdeal.com/texas/dallas/2025/01/06/dallas-most-expensive-home-listings-of-2024/"
    ],
    "market": "Texas",
    "published": "Mon, 17 Mar 2025 19:20:34 +0000",
    "published_dt": "2025-03-17T19:20:34+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/17/whats-smaller-than-a-bungalow-small-lot-homes-on-melrose/",
    "title": "What’s smaller than a bungalow in East Hollywood?",
    "subhead": "Aaron Belliston-led affiliate plans to convert century-old apartments into small-lot homes on Melrose",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 3:00 PM",
    "pub_date_dt": "2025-03-17T15:00:00",
    "content": "Melrose Ten wants to turn century-old bungalow apartments in East Hollywood into single-family homes and a duplex.\nThe North Hollywood-based limited liability company led by Aaron Belliston has filed plans to convert the 1920s bungalow court at 4061-4069 West Melrose Avenue,\nUrbanize Los Angeles reported\n. No demolition or new construction are in the works.\nInstead, the owner of the property wants to convert the historic bungalows into single-family homes through a Los Angeles small lot subdivision ordinance.\nThe application said the Belliston affiliate wants to create nine single-family homes and one duplex, not far from Vermont Avenue and Los Angeles City College.\nThe potential increase in value to the property was not disclosed. It’s also not clear when the Belliston affiliate bought the property, and for how much.\n\nThe bungalow court, built in 1923 on a third of an acre in Virgil Village, was once listed for $211,500 per unit, or $2.1 million, according to a 2023 Marcus &amp; Millichap\nmarketing brochure\n.\nAnother small lot subdivision has been\nproposed nearby at 627 North Juanita Avenue\n, where Scott Barth of Barth Partners plans to build 10 townhomes on a vacant lot, according to Urbanize.\nBelliston is president of BMR Enterprises, a vertically integrated real estate firm based at the same North Hollywood address as Melrose Ten, according to state business records.\nMembers of the Melrose Ten LLC include Encino-based Bow Hunter Development, Prosper Fund, based in North Hollywood and Mark Priceman of Valley Village.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://la.urbanize.city/post/bungalow-court-4061-w-melrose-ave-be-converted-small-lot-homes",
      "https://app.box.com/s/v556o0mu5bfqzzwof8us2dqjzdzgi7qy",
      "https://la.urbanize.city/post/10-townhomes-planned-627-n-juanita-avenue-east-hollywood",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2024/11/14/advanced-properties-eyes-51-apartments-in-east-hollywood/",
      "https://therealdeal.com/la/2024/12/20/category-plans-145-affordable-apartments-in-east-hollywood/",
      "https://therealdeal.com/la/2024/10/07/nba-stars-pitch-affordable-housing-in-east-hollywood/"
    ],
    "market": "Los Angeles",
    "published": "Mon, 17 Mar 2025 19:00:00 +0000",
    "published_dt": "2025-03-17T19:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/17/chicagos-tax-assessor-corrects-massive-undervaluation/",
    "title": "Cook County corrects tax roll error after $444M undervaluation",
    "subhead": "Assessor reclassified hundreds of properties, owners hit with steep back taxes",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 2:33 PM",
    "pub_date_dt": "2025-03-17T14:33:00",
    "content": "Cook County Assessor Fritz Kaegi has fixed hundreds of property misclassifications after a months-long audit, but questions remain over how many errors are still unresolved.\nAt least 620 properties were\nmisclassified or undervalued\nduring the 2023 tax year, resulting in an estimated $444 million in missed taxable value.\nThe assessor’s office has since corrected 491 of those errors, adding nearly $489 million in taxable value to county rolls — about 17 percent of the new construction value added countywide in 2023, the Chicago Tribune\nreported\n. An investigation by Illinois Answers and the outlet reported the misclassified properties last year.\nStill, 129 properties identified in the investigation remain incorrectly classified, with fixes delayed due to a backlog at the Cook County Board of Review and what Kaegi’s office described as “quirks in the tax calendar.”\nThe office also blamed inconsistent permit data from local municipalities as a key factor behind delayed corrections.\nThe misclassifications carried major financial consequences.\nSome homeowners, like those in suburban Lynwood, have already received back tax bills as high as $23,000 after belated reassessments. State law allows for up to three years of back taxes, though Kaegi’s office maintains that it won’t issue back taxes in cases where it failed to act on construction permits it had on file.\nIn 46 out of 55 back-taxed cases, Kaegi’s office did have relevant permit information, but missed it.\n\nMany affected properties were either new construction or had undergone significant renovations, but the assessor’s records failed to reflect those changes. In some cases, properties were still being taxed based on outdated classifications.\nFor instance, a home in Gilmore Park built in 2021 and sold for $843,000 continued to be assessed as a vacant lot, with its value listed at less than $45,000.\nKaegi’s office has since hired a dozen more staffers, including two permit specialists and 10 field inspectors, and promoted a veteran staffer to oversee data integrity. The office also plans to launch a sales validation team this year to help catch discrepancies, such as multimillion-dollar sales on properties incorrectly recorded as vacant.\nKaegi is pushing for broader systemic changes.\nLast week, he\ncalled on the Federal Housing Finance Agency\nto release appraisal data from Fannie Mae and Freddie Mac to local assessors. Kaegi argued that access to this data —\ncurrently restricted\n— would help improve the accuracy of property assessments, particularly in addressing long-standing issues like regressivity, where lower-value homes are often over-assessed relative to their market value. His office released a public dataset on Monday morning with building permits submitted to the office by municipalities, another bid to bring transparency to the process.\nCritics argue the long delays and lingering errors undermine confidence in Cook County’s property tax system — especially when homeowners can be hit with massive, unexpected tax bills for mistakes they had no hand in.\nKaegi’s office is reviewing the 46 back tax bills for errors, as delays in delivering the permits to the assessor’s office can slow its ability to make corrections, a spokesperson said.\n— Judah Duke\n",
    "related_links": [
      "https://therealdeal.com/chicago/2024/08/05/chicago-property-tax-assessors-mistakes-left-444m-undervalued/",
      "https://www.chicagotribune.com/2025/03/16/cook-county-assessor-fixing-mistakes-misclassified-properties/",
      "https://therealdeal.com/chicago/2025/03/13/chicago-tax-assessor-pushes-feds-to-release-appraisal-data/",
      "https://therealdeal.com/national/2025/03/05/new-names-on-fannie-maes-blacklist/",
      "https://therealdeal.com/chicago/2024/08/05/chicago-property-tax-assessors-mistakes-left-444m-undervalued/",
      "https://therealdeal.com/chicago/2025/03/13/chicago-tax-assessor-pushes-feds-to-release-appraisal-data/",
      "https://therealdeal.com/national/2025/03/05/new-names-on-fannie-maes-blacklist/"
    ],
    "market": "Chicago",
    "published": "Mon, 17 Mar 2025 18:33:56 +0000",
    "published_dt": "2025-03-17T18:33:56+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/17/dallas-officials-make-another-pitch-to-keep-neiman-marcus/",
    "title": "Dallas makes last-ditch pitch to keep Neiman Marcus downtown",
    "subhead": "City manager tells parent company that “financially beneficial” offer is on the table",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 2:26 PM",
    "pub_date_dt": "2025-03-17T14:26:00",
    "content": "Dallas officials are mounting a last-ditch effort to stop the clock on Neiman Marcus’ closure of its downtown flagship store at 1618 Main Street.\nCity Manager Kimberly Bizor Tolbert and the Dallas Consortium, a coalition of city and business leaders, requested a meeting with executives from the brand’s parent company, Saks Global, within the next week to pitch their plan, The Dallas Morning News\nreported\n.\nThe letter, addressed to Saks Executive Chairman Richard Baker, said the city has crafted a “financially beneficial” offer that would support both Neiman Marcus’ brand and its ties with Texas clientele.\nSaks, which acquired Neiman Marcus last year for $2.7 billion, previously\nannounced the store’s closure\nby March 31, citing a dispute with landlord Slaughter Partners as a barrier to remaining open. But earlier this month, Dallas officials resolved that problem by securing the deed for the disputed portion of the property.\nThe company, however, has held firm, stating the\ndecision to close is “final”\nand that the situation is “far more complicated than what the public is being led to believe.” Saks has also said its attempts to meet with city officials have been rejected.\n\nIt remains uncertain whether the city’s proposed deal is enough to prompt reconsideration, or even a temporary extension of operations. Tolbert’s letter asked for a response to “the collective group,” and said Neiman Marcus would have time to “capture the opportunity we wish to discuss” if the company keeps the store open for a few months longer.\nAlong with the store, Neiman Marcus also plans to vacate its 82,000-square-foot headquarters in NexPoint’s 42-story Cityplace Tower at 2711 North Haskell Avenue.\nThe looming closure threatens to leave a major gap in the city’s downtown retail landscape and in the historic character of Dallas. Neiman Marcus has operated its flagship store for more than a century, serving as an anchor for the district’s identity and economic activity.\nThe consortium is holding out hope of avoiding the significant loss to the city’s downtown core, while Saks is investing $100 million into its Neiman Marcus store at NorthPark Center.\n— Judah Duke\n",
    "related_links": [
      "https://www.dallasnews.com/business/retail/2025/03/14/dallas-dangles-financially-beneficial-opportunity-to-keep-neiman-marcus-downtown/",
      "https://therealdeal.com/texas/dallas/2025/02/18/hudson-bay-company-slashes-neiman-marcus-dallas-presence/",
      "https://therealdeal.com/texas/2025/03/05/saks-to-close-historic-neiman-marcus-store/",
      "https://therealdeal.com/texas/2025/03/05/saks-to-close-historic-neiman-marcus-store/",
      "https://therealdeal.com/texas/dallas/2025/02/18/hudson-bay-company-slashes-neiman-marcus-dallas-presence/",
      "https://therealdeal.com/texas/dallas/2022/07/29/neiman-marcus-corporate-hub-project-lands-at-cityplace-tower/"
    ],
    "market": "Texas",
    "published": "Mon, 17 Mar 2025 18:26:41 +0000",
    "published_dt": "2025-03-17T18:26:41+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/17/government-reverses-hundreds-of-lease-terminations/",
    "title": "You’re (not) fired: Government reverses hundreds of lease terminations",
    "subhead": "Why the Trump admin is tweaking its office downsizing plan",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 2:09 PM",
    "pub_date_dt": "2025-03-17T14:09:00",
    "content": "At first, the federal government met resistance in\ncutting\nits real estate footprint. In more than 100 cases, it’s reversing its planned terminations.\nThe General Services Administration, which manages the government’s real estate holdings, is backtracking on the cancellation of 117 leases, the New York Times\nreported\n. Among the spaces getting a reprieve are an Energy Department office in New Mexico that manages a nuclear waste repository and an office used by the U.S. Army Corps of Engineers for hurricane response in Florida.\nLawmakers and agency officials have worked to slow or stop lease terminations, expressing worry about vital functions and the government’s own return-to-office mandate. One lawmaker in Oklahoma worked directly with Donald Trump’s administration and Elon Musk’s Department of Government Efficiency to salvage several agency offices in the Sooner State.\nMore leases are still being canceled than saved from the scrap heap. The GSA has sent out 827 termination notices since the start of Trump’s second term and only the 100-plus letters rescinding said notices, according to the agency.\n\nThe reversals are adding more confusion to the post-inauguration chaos in federal government-related real estate. For instance, Musk’s team has already claimed that it cut 793 leases and is saving the country approximately $500 million annually. But those lease cancelations don’t match the GSA’s termination notices, and officials aren’t providing updated lists on what deals are canceled and where. Three leases in Oklahoma supposedly saved from the chopping block still appear on the DOGE website of canceled leases.\nThere’s also the “non-core” asset inventory posted by the GSA two weeks ago. The agency documented 443 properties seemingly “designed for disposal” by the federal government, only for the inventory to disappear the following day; it has yet to reappear.\nThe inventory spanned nearly 80 million square feet of rentable space across the country. The GSA forecasted more than $430 million of annual operating cost savings if the entire inventory were to be offloaded.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://therealdeal.com/national/2025/03/02/real-estate-effect-of-trump-musks-federal-office-downsize/",
      "https://www.nytimes.com/2025/03/17/us/politics/musk-doge-lease-terminations.html",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/national/philadelphia/2025/03/06/philadelphia-buildings-on-gsa-disposal-list/",
      "https://therealdeal.com/national/2025/03/02/real-estate-effect-of-trump-musks-federal-office-downsize/",
      "https://therealdeal.com/national/2025/01/21/federal-government-could-sell-two-thirds-of-office-portfolio/"
    ],
    "market": "National",
    "published": "Mon, 17 Mar 2025 18:09:26 +0000",
    "published_dt": "2025-03-17T18:09:26+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/las-vegas/2025/03/17/oikos-advances-22-unit-affordable-apartment-complex-in-vegas/",
    "title": "Oikos advances 22-unit affordable apartment complex in Las Vegas",
    "subhead": "Planning Commission gives thumbs up despite strong pushback from Historic Westside neighbors",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 1:30 PM",
    "pub_date_dt": "2025-03-17T13:30:00",
    "content": "Oikos Development Nevada has moved forward with plans to build a 22-unit affordable housing complex in west Las Vegas, despite strong pushback from neighbors.\nThe Henderson-based affordable housing developer was unanimously approved by the Las Vegas Planning Commission to build the four-story building at the northwest corner of Van Buren Avenue and F Street, in the Historic Westside,\nthe Las Vegas Review-Journal reported\n.\nNeighbors had turned out to oppose the 51-foot-tall project, raising concerns over lack of parking, increased traffic, lower property values and overcrowding. One woman who lives directly behind the project said it would “result in a loss of privacy.”\nDespite the opposition, the project known as Westside Flats was approved and will be heard by the City Council on April 16. It will replace a one-third acre vacant lot owned by the city.\nPlans call for 22 one- to three-bedroom apartments from 622 square feet to 1,055 square feet, with a rooftop deck with barbecues, a children’s playground and picnic tables.\n\nThe apartments would be for households earning between 30 percent and 50 percent of area median income. Monthly rents would range from $442 to $1,051.\nThe $6.5 million gray, charcoal and periwinkle project, designed by Nadel Architects, aligns with the city’s Hundred Plan by boosting the number of homes, housing density, affordability and availability, according to the nonprofit developer.\nOikos Development Nevada is a unit of Kansas City-based Oikos Development, founded in 2018 by Michael Snodgrass, according to its website and\nClark County meeting records\n. The firm has developed more than 500 affordable apartments in Nebraska, Missouri, Kansas, Florida and Nevada.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.reviewjournal.com/business/proposed-historic-westside-apartment-project-receives-opposition-from-neighbors-3319140/?utm_campaign=widget&utm_medium=latest&utm_source=homepage&utm_term=Proposed%20Historic%20Westside%20apartment%20project%20receives%20opposition%20from%20neighbors",
      "https://webfiles.clarkcountynv.gov//CDAC%20minutes%201.17.23%20FINAL.pdf",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/national/las-vegas/2025/03/11/southern-land-cedar-street-bridge-go-big-in-las-vegas/",
      "https://therealdeal.com/national/las-vegas/2025/02/27/musks-boring-company-pitches-apartments-by-las-vegas-loop/",
      "https://therealdeal.com/national/las-vegas/2025/02/05/las-vegas-enters-top-10-luxury-market-list-beating-out-la/"
    ],
    "market": "National",
    "published": "Mon, 17 Mar 2025 17:30:00 +0000",
    "published_dt": "2025-03-17T17:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/17/can-mayor-karen-bass-suspend-measure-ula-to-help-la-rebuild/",
    "title": "Bass says she wants to pause Measure ULA. Is she allowed?",
    "subhead": "City’s “Mansion Tax” could make it harder for fire victims to rebuild",
    "authors": "ByAbigail Nehring",
    "pub_date": "Mar 17, 2025, 1:02 PM",
    "pub_date_dt": "2025-03-17T13:02:00",
    "content": "Los Angeles Mayor Karen Bass has apparently grown cool toward Measure ULA.\nThe mayor said there’s cause to temporarily suspend the city’s two-year-old “Mansion Tax” and might try to do so herself, if she can find a way.\n“Maybe temporarily — we’re looking into that,” Bass told a\nBreitbart\nreporter\nin a press conference last Tuesday\n. “There’s two schools of thought. One is, that can’t happen. It has to go back to voters. And the other is that it might be able to happen with action from the council and the mayor’s office.\n“We’re having that investigated through our attorneys right now,” Bass said.\nShe hasn’t spoken further about the topic since.\nZach Seidl, the mayor’s communications deputy, didn’t answer specific questions from\nThe Real Deal\nabout Bass’ plans, but said in a statement to\nThe Real Deal\nFriday, “we are going to look at every possible option to support fire survivors and accelerate recovery.”\nIt’s unclear how the mayor or City Council could defy the results of the local ballot measure, which went into effect in 2023 and imposes a 4 percent tax on property sales above $5 million and a 5.5 percent tax on sales over $10 million.\n\nThe\nCity Charter states\nthat ballot measures can be overturned by voters in a subsequent election or by amending the City Charter to supersede the ballot measure.\nA spokesperson for L.A. City Attorney Hydee Feldstein Soto did not immediately respond to a request for comment.\nMeasure ULA aimed to raise up to $1.1 billion in tax revenue to fight homelessness and build affordable housing. It has so far fallen far short of that goal, raising\nabout $300 million in its first year on the books\n.\nFewer than 5 percent of deals meet the threshold to be subject to the tax, but historically they account for about 40 percent the city’s total property tax revenue, according to an analysis by Mott Smith, a founding member of the Council of Infill Builders and adjunct professor at the USC Price School of Public Policy.\nDuring her 2022 campaign for mayor, Bass\nnever took a stance supporting\nthe ballot measure, but she\napplauded a court ruling\ndismissing a lawsuit against it the following year.\nAnd later that year the former deputy mayor for housing took some heat saying real estate investors were having “\na bit of a temper tantrum\n” about the transfer tax, as\nTRD\npreviously reported.\n",
    "related_links": [
      "https://www.breitbart.com/politics/2025/03/11/l-a-mayor-karen-bass-says-city-considering-suspending-measure-ula-tax-to-help-rebuilding/",
      "https://youtu.be/EVJzGokdfAY?si=yUi6lLdDNsTb5z0p&t=746",
      "https://codelibrary.amlegal.com/codes/los_angeles/latest/laac/0-0-0-1863",
      "https://therealdeal.com/la/2024/10/18/las-luxury-home-market-generates-most-measure-ula-funds/",
      "https://www.latimes.com/california/story/2022-09-30/mansion-tax-la-ballot-measure",
      "https://mayor.lacity.gov/news/mayor-bass-city-attorney-hydee-feldstein-soto-and-la-housing-department-applaud-decision",
      "https://therealdeal.com/la/2023/11/01/la-deputy-mayor-recalls-temper-tantrum-on-measure-ula/",
      "https://therealdeal.com/la/2024/10/18/las-luxury-home-market-generates-most-measure-ula-funds/",
      "https://therealdeal.com/la/2024/04/16/las-mayor-bass-asks-the-wealthy-to-pay-for-homeless-housing/",
      "https://therealdeal.com/la/2024/06/20/ballot-measure-to-overturn-ula-struck-down-by-court/"
    ],
    "market": "Los Angeles",
    "published": "Mon, 17 Mar 2025 17:02:13 +0000",
    "published_dt": "2025-03-17T17:02:13+00:00",
    "author": "Abigail Nehring"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/16/relateds-jackson-square-development-moves-forward/",
    "title": "Related California goes from “contrarian” to conviction on Jackson Square hotel-office tower",
    "subhead": "Plus Ralph Lauren, Blue Bottle, Sweetgreen to open new SF locations, $32 million Jackson Square buy and more San Francisco real estate news",
    "authors": "ByEmily Landes",
    "pub_date": "Mar 16, 2025, 1:00 PM",
    "pub_date_dt": "2025-03-16T13:00:00",
    "content": "Jackson Square was the market to watch this week, as Related California explained how its one-time “contrarian bet” on developing a\n41-story office-hotel tower\nin the neighborhood has turned to firm conviction about the future of the enclave.\nRalph Lauren got in the mood, too, opening a Polo store there after shuttering two previous locations in the city, and\nBrick and Timber Collective\nclosed a $32 million deal with a Michelin-starred chef as a partner.\nRelated’s plans call for a 544-foot tower with 360,000 square feet of offices atop a five-star, 200-room hotel at 530 Sansome, plus a new firehouse at 447 Battery Street to replace a station overtaken by the project. A previous 19-story hotel and fitness club project, approved in 2021, stalled.\n“This started out as a contrarian bet but as we dug in deeper and looked at the market, how it is evolving and maturing out of Covid, it doesn’t seem so contrarian any more,” Gino Canori, president of Related California, told the San Francisco Chronicle.\nRelated hopes to secure approvals to build the tower this fall, allowing the firm to break ground by late next year. If all goes well, it could be completed by 2030.\nMichelin-starred chef, Ralph Lauren come to Jackson Square\nRestaurateur Peter Hemsley of Michelin-starred Aphotic\njoined forces\nwith developer Brick &amp; Timber, which keeps its headquarters in the neighborhood, to buy a 15,600-square-foot store and building at 530 Jackson Street for $32.4 million, or over $2,000 a square foot.\n\nHemsley announced last year he would shut Aphotic, blaming the SoMa location. It’s not clear whether the chef intends to revive the sustainable seafood restaurant or launch a new concept in the ground-floor space that was home to Kells Irish Restaurant and Pub for decades. Paul McAleese is the owner of Kells Irish Restaurant and Bar as well as the seller of 530 Jackson.\nJust down the street from 530 Jackson, Ralph Lauren opened its first new store in the city in years.\n“The opening of Polo Ralph Lauren in Jackson Square is a testament to the neighborhood’s growing appeal as a premier destination for retail,” Robbie Silver, CEO of the Downtown SF Partnership, said in a statement.\nSweetgreen, Blue Bottle sign long-term Mission Rock leases\nIn further retail news, Mission Rock developers Tishman Speyer and the San Francisco Giants announced\ntwo new long-term deals\nat their Mission Bay development. Blue Bottle Coffee and Sweetgreen have signed 10-year leases at Mission Rock and Arsicault bakery finally opened its doors in the development.\nOakland-founded Blue Bottle will occupy 2,069 square feet at the base of the building occupied by Visa at 300 Toni Stone Crossing. Salad-and-grain bowl shop Sweetgreen will take just under 2,400 square feet at the base of The Canyon, a residential tower at the intersection of Dr. Maya Angelou Lane and Toni Strone Crossing.\nAlex Sagues and Madeline Mandanis represented the landlords in the deal. Sagues called Mission Bay “the most vibrant neighborhood in San Francisco”. He said retailers are drawn to the transit-friendly area because “it is a true seven-day neighborhood,” with office, life sciences, residential, and the UCSF hospital, as well as events at Chase Center and Oracle Park.\n",
    "related_links": [
      "https://therealdeal.com/san-francisco/2025/03/11/related-california-to-plant-a-41-story-office-hotel-stake-in-san-francisco/",
      "https://therealdeal.com/san-francisco/2025/02/11/brick-timber-bullish-on-sf-office-despite-citys-policies/",
      "https://therealdeal.com/san-francisco/2025/03/10/star-chef-brick-timber-join-up-on-sf-jackson-square-buy/",
      "https://therealdeal.com/san-francisco/2025/03/11/blue-bottle-sweetgreen-sign-leases-in-sfs-mission-rock/",
      "https://therealdeal.com/san-francisco/2025/03/11/related-california-to-plant-a-41-story-office-hotel-stake-in-san-francisco/",
      "https://therealdeal.com/san-francisco/2025/03/10/star-chef-brick-timber-join-up-on-sf-jackson-square-buy/",
      "https://therealdeal.com/san-francisco/2025/03/11/blue-bottle-sweetgreen-sign-leases-in-sfs-mission-rock/"
    ],
    "market": "San Francisco",
    "published": "Sun, 16 Mar 2025 17:00:00 +0000",
    "published_dt": "2025-03-16T17:00:00+00:00",
    "author": "Emily Landes"
  },
  {
    "url": "https://therealdeal.com/texas/2025/03/15/texas-republicans-block-las-vegas-sands-legalization-efforts/",
    "title": "Freshman lawmakers blocking Sands’ legalization efforts",
    "subhead": "Coalition opposes “any attempt to expand gambling” this session, which could kill a proposed megadevelopment in Irving",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 15, 2025, 8:00 AM",
    "pub_date_dt": "2025-03-15T08:00:00",
    "content": "Will the Las Vegas Sands, owners of the Dallas Mavericks, manage to legalize gambling in Texas this legislative session?\nNot if a coalition of freshmen in the Texas House of Representatives gets its way. Twelve Republican lawmakers who replaced pro-gambling politicians in the last election are holding the line against casinos, the Texas Tribune\nreported\n. They are joined by three others who voted in favor of sports betting last session but have since rescinded their support.\nThey said this week they would oppose “any attempt to expand gambling” this session, which ends in May. After that, the Texas Legislature won’t meet in regular session again until 2027.\nProposals to legalize casinos and sports betting have been introduced, but the GOP coalition aims to stop them in their tracks. Neither proposal has received a committee hearing, the first step to consideration by the full house.\nThat could be bad news for the city of Irving, where Sands is seeking zoning approval for a Mavericks stadium with a resort and entertainment center, including a casino. Sands is spending big on lobbying and advertising campaigns in favor of “destination resort” casinos. If a casino is a no-go, Sands has said it is\nlikely to kill the entire proposal\n.\nMeanwhile in Southern Dallas, developer\nHoque Global\nmet its first deadline in its agreement with the city of Dallas for its University Hills megadevelopment. The firm now has\n60 days to purchase\nthe 270 acres for the development.\nOne of Fort Worth’s biggest development players,\nCrescent Real Estate\n, shifted its C-suite with the appointment of\nConrad Suszynski\nas sole CEO following the retirement of co-CEO Jason Anderson. Fort Worth is undergoing a development boom that is touching a beloved antique mall near the Cultural District, where\nPhoenix Property Company\nis planning a\n12-story hotel\n, plus retail and multifamily.\n\nIn office leasing news, the flight-to-quality trend reeled in some big fish.\nLaw firm Skadden, Arps, Slate, Meagher &amp; Flom leased 52,000 square feet spanning two full floors in\nHines’\nTexas Tower\nin Houston. The lease brings the building, at 845 Texas Avenue to 99 percent leased.\nAnother law firm, Hicks Johson, is spending $4.3 million to build out its lease at\nSkanska’s\nNorton Rose Fullbright tower at 1550 Lamar Street, which is\ndowntown Houston’s newest\noffice building.\nAnd a retail merchandiser is\nmoving its headquarters\nto 5801 Headquarters Drive in Plano, owned by\nMonarch Alternative Capital\nand\nTourmaline Capital Partners\nand built in 2021. The company will exit Granite Properties’ Granite Park III, which was built in 2007.\nAnd in Austin, Facebook and Instagram owner Meta Platforms is spending $3.7 million on an\noffice buildout in downtown Austin\n, although it’s not clear for whom.\n—Rachel Stone\n",
    "related_links": [
      "https://www.texastribune.org/2025/03/12/texas-gambling-sports-betting-casinos-house-republicans/",
      "https://therealdeal.com/texas/dallas/2025/03/13/backlash-rises-over-sands-vision-for-irving-casino-resort/",
      "https://therealdeal.com/texas/dallas/2025/03/12/hoque-global-has-60-days-to-buy-southern-dallas-acreage/",
      "https://therealdeal.com/texas/fort-worth/2025/03/13/conrad-suszynski-named-sole-ceo-of-crescent-real-estate/",
      "https://therealdeal.com/texas/fort-worth/2025/03/14/phoenix-property-co-plans-highrise-hotel-amid-fort-worth-boom/",
      "https://therealdeal.com/texas/houston/2025/03/12/houstons-texas-tower-hits-99-leased-with-law-firm-signing/",
      "https://therealdeal.com/texas/houston/2025/03/12/skanskas-houston-tower-lands-law-firm-headquarters-lease/",
      "https://therealdeal.com/texas/dallas/2025/03/14/anderson-merchandisers-takes-full-floor-lease-in-plano/",
      "https://therealdeal.com/texas/austin/2025/03/13/meta-platforms-spending-3m-on-austin-office-buildout/",
      "https://therealdeal.com/texas/dallas/2025/03/11/heres-what-could-happen-to-dallas-federal-buildings/",
      "https://therealdeal.com/texas/houston/2025/03/12/d-r-hortons-forestar-buys-land-for-home-lots-near-galveston/",
      "https://therealdeal.com/texas/houston/2025/03/14/houstons-largest-landowners-include-high-profile-homebuilders/"
    ],
    "market": "Texas",
    "published": "Sat, 15 Mar 2025 12:00:00 +0000",
    "published_dt": "2025-03-15T12:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/14/calif-urges-insurers-to-expand-coverage-in-fire-risk-areas/",
    "title": "State pushes insurers to expand coverage in fire-prone areas",
    "subhead": "New maps of high-risk zones outline where insurers must write more policies",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 6:30 PM",
    "pub_date_dt": "2025-03-14T18:30:00",
    "content": "State insurance regulators have unveiled a new plan to stabilize the home insurance market by pushing insurers to expand coverage in fire-prone areas where companies have dropped hundreds of thousands of homeowners in recent years.\nThe plan updates a map of high-risk zip codes where insurers will be required to write more policies, aiming to create a more equitable insurance market despite growing wildfire threats, the\nSan Jose Mercury News reported\n.\nHowever, many high-risk Bay Area neighborhoods, including Oakland, the Berkeley Hills and Gilroy, aren’t included in the updated map.\nState regulators say this is because those areas fall within zip codes where the overall insurance need is deemed lower. Despite this, new rules will still require insurers to offer coverage to homeowners in these areas who have been rejected by traditional providers due to fire risk.\n“Insurance companies have ignored those homes, and we’re trying to put the spotlight on them,” Michael Soller, spokesperson for the California Department of Insurance, told the Mercury News.\nThe plan stems from a deal with the insurance industry, allowing companies to raise rates based on climate-related risks in exchange for expanding coverage in high-risk areas.\nCalifornians currently pay an average of $1,435 annually for homeowners insurance, below the national average. But prices vary widely. And insurers like State Farm and Allstate have stopped issuing new policies in the state, citing strict rate-setting rules and wildfire losses.\nThe new rules require insurers to cover a proportional share of high-risk policies. For example, if a company covers 100 of every 1,000 policies statewide, it must cover 85 of every 1,000 in high-risk areas.\n\nHowever, some consumer groups argue the reforms have loopholes that may allow insurers to delay meeting these targets or only slightly increase coverage.\nHomeowners in fire-prone areas, like Carolyn Grote of the Berkeley Hills, are preparing independently. Grote formed a “Firewise community” with neighbors to improve fire safety, hoping to retain her insurance.\n“If Firewise could help people retain their insurance, that might be the biggest motivator,” she told the newspaper.\nConsumer groups are skeptical.\n“Insurers can use secret models to raise rates right away with unenforceable promises to expand coverage,” Carmen Balber of nonprofit Consumer Watchdog told the Mercury News.\nRegulators, however, insist they will monitor compliance closely and can revoke rate-setting privileges if insurers fail to meet coverage requirements.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.mercurynews.com/2025/03/14/wildfire-insurance-homeowners-bay-area/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2024/07/25/california-insurance-head-plans-to-fix-home-market-crisis/",
      "https://therealdeal.com/la/2025/02/05/state-farm-seeks-38-rate-hike-on-rental-buildings/",
      "https://therealdeal.com/san-francisco/2024/12/13/farmers-insurance-ups-home-policy-line-in-california/"
    ],
    "market": "San Francisco",
    "published": "Fri, 14 Mar 2025 22:30:37 +0000",
    "published_dt": "2025-03-14T22:30:37+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/14/developer-saj-eyes-office-to-resi-conversion-in-lafayette/",
    "title": "Developer eyes office-to-resi conversion in wake of YIMBY lawsuit in Lafayette",
    "subhead": "SAJ wants to replace three office buildings with 90-unit apartment building",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 4:00 PM",
    "pub_date_dt": "2025-03-14T16:00:00",
    "content": "SAJ Development wants to swing a wrecking ball into three office buildings in Lafayette to erect a 90-unit apartment building in an upscale city long opposed to affordable housing.\nThe locally based developer filed revised plans to replace the offices with a seven-story, 171,400-square-foot complex at 1001 Oak Hill Road,\nthe San Francisco Business Times reported\n. The city will consider the project on March 17.\nThe application came as housing advocates\nsued the East Bay city\nfor creating “misleading and unrealistic housing sites” to satisfy state-mandated housing goals. The lawsuit by the Housing Action Coalition accused Lafayette of “pretending” to comply with the state housing element, a planning blueprint required of every city and county across the state every eight years.\nLafayette’s alleged shell game includes relying on faith-based institutions and longtime businesses with no plans to develop housing as potential building sites for homes, according to the complaint.\nThe lawsuit seeks a court to compel the city to adopt a revised plan with an update to its zoning laws. The city must rezone to build 2,114 homes, 943 of them affordable, by 2031. Within the decade through 2019, the city permitted 115 homes.\nSAJ could help remedy that by its mixed-use project calling for 79 market-rate apartments and 11 affordable apartments, including five for very-low-income households and six for moderate-income households.\nWhat appears to be a U-shaped complex, designed by Berkeley-based Trachtenberg Architects, would be draped in two shades of brown, with tiered roof decks, and floor-to-ceiling corner windows with exterior balconies, according to a rendering.\nThe developer would employ a nearly 23 percent state density bonus in exchange for the affordable housing, plus a state streamlining law for faster approvals. A cost and timeline for construction were not disclosed.\n\nSAJ applied using Senate Bill 330, which effectively freezes zoning that’s in place at the time a project is submitted, limits the number of public hearings to five and suspends or eliminates restrictions on housing development.\nThe law aims to prevent cities from delaying projects unnecessarily over subjective standards, along with several other laws meant to stop cities from blocking affordable housing.\nThe developer had submitted an earlier version of the project in 2022 that called for tearing down just two of the three offices to build\n53 units\n. City officials approved that version in May, before SAJ revised its plans. Jeff Stone, owner of Diamond Construction, was listed as the property owner operating through SAJ Development, according to SFYimby.\nLafayette was once a battleground for the region’s housing wars, with two lawsuits, a ballot referendum and more than 100 public hearings that delayed a 315-unit apartment building for almost a dozen years.\nLast year, the\nstate Supreme Court declined\nto hear an appeal from a neighborhood group, allowing the development to move forward. The project has not broken ground.\nMembership in SAJ Development, led by Stone, includes Diamond Swope Holdings, the Steven Kay Trust, the Griggs Community Property Trust and Outdo, based in Lafayette, according to state business records. Another firm, Valley Oak Capital, is based in Texas.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.bizjournals.com/sanfrancisco/news/2025/03/13/lafayette-office-residential-oak-hill-saj.html",
      "https://therealdeal.com/san-francisco/2025/03/11/housing-advocate-sues-lafayette-for-misleading-housing-plan/",
      "https://sfyimby.com/2024/04/updated-plans-shared-for-1001-oak-hill-road-in-lafayette.html",
      "https://www.sfchronicle.com/realestate/article/lafayette-housing-project-court-17844162.php",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/03/11/housing-advocate-sues-lafayette-for-misleading-housing-plan/",
      "https://therealdeal.com/san-francisco/2024/03/14/former-sf-giant-buster-posey-buys-lafayette-home-for-8-3m/",
      "https://therealdeal.com/san-francisco/2022/05/13/midwest-investor-pays-103m-for-two-shopping-centers-in-lafayette/"
    ],
    "market": "San Francisco",
    "published": "Fri, 14 Mar 2025 20:00:00 +0000",
    "published_dt": "2025-03-14T20:00:00+00:00",
    "author": "TRD Staff"
  }
]